# -*- coding: utf-8 -*-
# Проблема с  кнопкой "Ты чет не то пишешь". После неё надо сделать возвращение к вопросу



#ТУТ ИМПОРТИРУЕМ ВСЯКИЕ МОДУЛИ, И ОПРЕДЕЛЯЕМ НЕКОТОРЫЕ НУЖНЫЕ ПЕРЕМЕННЫЕ     ТУТ ИМПОРТИРУЕМ ВСЯКИЕ МОДУЛИ, И ОПРЕДЕЛЯЕМ НЕКОТОРЫЕ НУЖНЫЕ ПЕРЕМЕННЫЕ     
import telebot
from telebot import types
import time
import io
kluch = 'CAADAgADMQADX2uZJslfoemgxGkiAg'
kluchkovar = 'CAADAgADMgADX2uZJm7PKqdZili4Ag'
kluchgrust = 'CAADAgADMwADX2uZJi2whgABB8ztSgI'
kluchvesel =  'CAADAgADNAADX2uZJrr5AAG1VMx9pwI'

pic1_13_16 = 'CAADAgADYAADX2uZJrppKaCN7ulbAg'
pic1_18 = 'CAADAgADYQADX2uZJqXxAAEyhJXq0QI'
pic1_19 = 'CAADAgADYgADX2uZJkK2kF8AASYjNQI'
pic2_13_16 = 'CAADAgADYwADX2uZJiUflkY6VqyRAg'
pic2_18 = 'CAADAgADZAADX2uZJh2cPXL7EzaqAg'
pic2_19 = 'CAADAgADZQADX2uZJmjVxab8pg4bAg'
pic3_13_16 = 'CAADAgADZgADX2uZJjHdo4_HXMu4Ag'
pic3_18 = 'CAADAgADZwADX2uZJvPwWCLCLDOkAg'
pic3_19 = 'CAADAgADaAADX2uZJimC0OlmIdq8Ag'
pic4_13_16 = 'CAADAgADaQADX2uZJiahLY_IfNGcAg'
pic4_18 = 'CAADAgADagADX2uZJsxakd1jZiXlAg'
pic4_19 = 'CAADAgADawADX2uZJkT2azoYAAFMJAI'
bot = telebot.TeleBot('783960584:AAFCXxw6HUzfi9JwOibjaK2KKWT6goMCdXQ')

#ТУТ ОПРЕДЕЛЯЕМ НЕКОТОРЫЕ ОСНОВНЫЕ ФУНКЦИИ     ТУТ ОПРЕДЕЛЯЕМ НЕКОТОРЫЕ ОСНОВНЫЕ ФУНКЦИИ     ТУТ ОПРЕДЕЛЯЕМ НЕКОТОРЫЕ ОСНОВНЫЕ ФУНКЦИИ     ТУТ ОПРЕДЕЛЯЕМ НЕКОТОРЫЕ ОСНОВНЫЕ ФУНКЦИИ     
#Эта херня загружает базу состояний из файла
sostfile =  (io.open('baza.txt', mode = 'r', encoding = 'utf8'))
sost = [t.split(',') for t in list(sostfile)]
sostfile.close()
sost = {int(x):[int(a),int(b),int(c),int(d)] for x,a,b,c,d in sost} #x - Это id юзера,
                                            #a - на каком вопросе ЕГЭ юзер,
                                            #b - сколько он уже заработал баллов,
                                            #c - когда закончится время на ЕГЭ (Unix)
                                            #d - Открывает и закрывает возможность добавления баллов (1 или 0)
#Эта херня выгружает базу в файлик, если всё накрывается
def vigruzka():
    sostfile =  (io.open('baza.txt', mode = 'w', encoding = 'utf8'))
    for r in sost:
        sostfile.write(str(r)+','+str(sost[r][0])+','+str(sost[r][1])+','+str(sost[r][2])+','+str(sost[r][3])+'\n')
    sostfile.close()

    
#ТУТ ОПРЕДЕЛЯЕМ ВОПРОСЫ     ТУТ ОПРЕДЕЛЯЕМ ВОПРОСЫ     ТУТ ОПРЕДЕЛЯЕМ ВОПРОСЫ     ТУТ ОПРЕДЕЛЯЕМ ВОПРОСЫ     ТУТ ОПРЕДЕЛЯЕМ ВОПРОСЫ     ТУТ ОПРЕДЕЛЯЕМ ВОПРОСЫ     ТУТ ОПРЕДЕЛЯЕМ ВОПРОСЫ
                    #Первый вариант
Q1_1 = """№1
Расположи в хронологической последовательности исторические события. \
Запиши в сообщении цифры, которыми обозначены исторические события, в правильной \
последовательности, без пробелов (Например 123).

1) подписание Ясского мира между Россией и Османской империей
2) Смоленская война
3) первый созыв Генеральных штатов во Франции"""

Q1_2 = """№2
Установи соответствие между событиями и годами: к каждой \
позиции первого столбца подбери соответствующую позицию из второго столбца.

СОБЫТИЯ
А) введение паспортной системы в СССР
Б) начало Крымской войны
В) Соляной бунт в Москве
Г) Невская битва

ГОДЫ
1) 972 г.
2) 1240 г.
3) 1648 г.
4) 1853 г.
5) 1932 г.
6) 1985 г.

Запиши 4 цифры ответа подряд, без пробелов
Например Если А=6,Б=2,В=4,Г=3, то ответ будет 6243"""

Q1_3 = """№3
Ниже приведён список терминов. Все они, за исключением двух, \
относятся к событиям (явлениям) периода 1953—1964 гг.

1) Хельсинкский процесс
2) общий рынок
3) десталинизация
4) новое политическое мышление
5) антипартийная группа
6) «оттепель».

Найди и запиши порядковые номера терминов, относящихся к другому \
историческому периоду."""

Q1_4 = """№4
Запиши термин, о котором идёт речь.
Срок, в течение которого владельцы могли возбудить иск о возвращении \
им беглых крепостных крестьян."""

Q1_5 = """№5
Установи соответствие между процессами (явлениями, событиями) и \
фактами, относящимися к этим процессам (явлениям, событиям): к каждой позиции \
первого столбца подбери соответствующую позицию из второго столбца.

ПРОЦЕССЫ (ЯВЛЕНИЯ, СОБЫТИЯ)
А) внешнеполитическая деятельность
первых русских князей
Б) реформы Избранной рады
В) реформы государственного управления Петра I
Г) «холодная война»

ФАКТЫ
1) отмена кормлений
2) подписание договора между Русью и Византией
3) первое упоминание Москвы в летописи
4) исключение СССР из Лиги Наций
5) создание Совета экономической взаимопомощи
6) учреждение Правительствующего Сената

Запиши 4 цифры ответа подряд, без пробелов
Например Если А=6,Б=2,В=4,Г=3, то ответ будет 6243"""

Q1_6 = """№6
Установи соответствие между фрагментами исторических источников и их \
краткими характеристиками: к каждому фрагменту, обозначенному буквой, подбери \
по две соответствующие характеристики, обозначенные цифрами.

ФРАГМЕНТЫ ИСТОЧНИКОВ
А) «К утверждению и распространению единообразия и порядка в Государственном \
управлении, признали Мы нужным установлению Государственного Совета дать образование, \
свойственное пространству и величию нашей империи...
I. В порядке Государственных установлений, Совет составляет сословие, в коем все части \
управления в главных их отношениях к Законодательству соображаются и чрез него восходят \
к Верховной Императорской Власти.
II. По сему все законы, уставы и учреждения в первообразных их начертаниях предлагаются \
и рассматриваются в Государственном Совете, и потом действием Державной Власти поступают \
к предназначенному им совершению».

Б)  «За благо мы рассудили и повелели с нынешнего времени, при дворе нашем, как для \
внешних, так и для внутренних государственных важных дел, учредить Верховный тайный \
совет, при котором мы будем сами присутствовать. В том Верховном тайном совете быть \
при нас из первых сенаторов, а вместо их в Сенат выбраны будут другие, которые всегда \
при одном сенатском правлении будут. Быть при нас в Тайном верховном совете нижеписанным персонам…»

ХАРАКТЕРИСТИКИ
1) Данный документ был издан Александром I.
2) Членом государственного органа, учреждённого по данному документу, был А.Л. Ордин-Нащокин.
3) Членом государственного органа, учреждённого по данному документу, был А.Д. Меншиков.
4) Данный документ был издан Екатериной I.
5) Государственный орган, учреждённый по данному документу, просуществовал до 1917 г.
6) Данный документ был издан Екатериной II.

Запиши 4 цифры ответа подряд, без пробелов
Например Если А=6,2 а Б=4,3, то ответ будет 6243"""

Q1_7 = """№7
Какие из перечисленных событий относятся к 1920-м гг.? Выбери три ответа \
и запиши подряд цифры, под которыми они указаны.

1) принятие первой Конституции СССР
2) выступление «троцкистской оппозиции»
3) подписание Договора о дружбе и границах между СССР и Германией
4) убийство С.М. Кирова
5) разрыв дипломатических отношений между СССР и Англией
6) бои у озера Хасан с японскими войсками"""

Q1_8 = """№8
Заполни пропуски в данных предложениях, используя приведённый ниже список \
пропущенных элементов: для каждого предложения, обозначенного буквой и содержащего \
пропуск, выбери номер нужного элемента.

А) Конструктором самолётов в годы Великой Отечественной войны был_________.
Б) Полное освобождение Ленинграда от вражеской блокады произошло в _________г.
В) К 1943 г. относится _________.

Пропущенные элементы:
1) 1943
2) А.С. Яковлев
3) битва за Днепр
4) М.И. Кошкин
5) 1944
6) операция советских войск «Багратион»

Запиши 3 цифры ответа подряд, без пробелов
Например Если А=6, Б=2, В=4, то ответ будет 624"""

Q1_9 = """№9
Установи соответствие между событиями и участниками этих событий: к \
каждой позиции первого столбца подбери соответствующую позицию из второго \
столбца.

СОБЫТИЯ
А) междоусобная война в Московском
государстве во второй четверти XV в.
Б) Смоленская война
В) «перестройка» в СССР
Г) Крымская война

УЧАСТНИКИ
1) П.С. Нахимов
2) Дмитрий Шемяка
3) Владимир Мономах
4) Е.К. Лигачёв
5) А.А. Аракчеев
6) М.Б. Шеин

Запиши 4 цифры ответа подряд, без пробелов
Например Если А=6,Б=2,В=4,Г=3, то ответ будет 6243"""

Q1_10 = """№10
Прочти отрывок из воспоминаний и укажи фамилию руководителя СССР \
в период, когда произошли описываемые события.

«Наконец, политический и организационный вопрос. Войдут наши войска в \
Чехословакию, а дальше что? Ведь войска вступают в страну без согласия \
правительства и руководства КПЧ. Ожидать, что теперешнее руководство страны \
и КПЧ положительно отнесётся к этой акции, это больше чем политическая наивность. \
На кого же опереться внутри страны? Тоже вопрос совершенно неясен, больше того, \
он просто тёмный».
Ответ:_________"""

Q1_11 = """№11
Даны несколько цепочек вида:
Век: Событие в России, Событие за рубежом
Некоторые значения пропущены. Необходимо заполнить их, используя предложенные варианты.

XIV в: (А), (Б)
(В): (Г), выступление М. Лютера с 95-ю тезисами, начало Реформации в Германии
XVII в: восстание под предводительством С.Т. Разина, (Д)
(Е): издание Манифеста о вольности дворянской, принятие Конституции США

Пропущенные элементы:
1) XIII в.
2) битва на р. Воже
3) восстание под предводительством У. Тайлера в Англии
4) XVI в.
5) созыв первого Земского собора
6) нормандское завоевание Англии
7) битва на р. Калке
8) гражданская война в Англии
9) XVIII в.

Запиши подряд цифры, соответствующие А, Б, В, Г, Д и Е (например 123456)"""

Q1_12 = """№12
Прочти отрывок из Постановления ЦК КПСС.

«Документальными данными и признаниями арестованных установлено, что вражеская \
группа была связана с английским и американским посольствами, действовала по \
указке американской и английской разведки и ставила своей целью осуществление \
террористических актов против руководителей Коммунистической партии и Советского \
правительства.
Участники группы под тяжестью улик признались, что они вредительски ставили неправильные \
диагнозы болезней, назначали и осуществляли неправильные методы лечения и тем самым \
вели больных к смерти. Преступники признались, что им удалось таким путём умертвить \
А.А. Жданова и А.С. Щербакова.
Были ли возможности своевременно разоблачить и обезглавить вражескую группу, \
орудовавшую в Лечсанупре? Да, к этому были возможности. ... Министерство \
государственной безопасности располагало сигналами, которые со всей очевидностью говорили \
о неблагополучии в Лечсанупре. Врач т. Тимашук обратилась в МГБ с заявлением, в котором \
на основании электрокардиограммы утверждала, что диагноз болезни т. Жданова А.А. \
поставлен неправильно и не соответствует данным исследования, а назначенное больному \
лечение шло во вред больному. Если бы МГБ СССР добросовестно расследовало такое \
исключительно важное заявление, оно наверняка смогло бы предотвратить злодейское \
умерщвление т. Жданова А.А., разоблачить и ликвидировать террористическую группу \
врачей. Этого не произошло, потому что работники МГБ СССР подошли к делу преступно, \
передав заявление т. Тимашук в руки Егорова, оказавшегося участником террористической \
группы».

Используя отрывок и знания по истории, выбери в приведённом списке три верных суждения.
Запиши подряд цифры, под которыми они указаны.

1) Данное постановление было принято в 1950-х гг.
2) В постановлении сказано, что арестованные ни в чём не признались.
3) В постановлении сказано о вине работников Министерства государственной безопасности \
в том, что «преступникам» удавалось осуществлять свои замыслы.
4) Обвиняемые в преступлениях, указанных в данном постановлении, были расстреляны.
5) В период, когда было принято данное постановление, Министерством внутренних \
дел СССР руководил Н.И. Ежов.
6) Один из государственных деятелей, о смерти которых говорится в отрывке, выступил \
с докладом, осуждающим лирические стихи А.А. Ахматовой и сатирические рассказы \
М.М. Зощенко."""

Q1_13 = """№13
Назови российского императора (императрицу), в чьё правление произошли события, \
обозначенные на схеме."""

Q1_14 = """№14
Укажи название населённого пункта, обозначенного на схеме цифрой «2», у которого \
произошло одно из крупнейших сражений данной войны."""

Q1_15 = """№15
Назови короля, против войск которого действовали русские войска в данной войне."""

Q1_16 = """№16
Какие суждения, относящиеся к исторической ситуации, обозначенной на схеме, являются \
верными? Выбери три суждения из шести предложенных. Запиши подряд цифры, под которыми \
они указаны.

1) В ходе данной войны русские войска удерживали более года город, обозначенный на схеме \
цифрой «1».
2) В сражении, произошедшем у населённого пункта, обозначенного на схеме цифрой «3», русскими \
войсками командовал В.В. Фермор.
3) На схеме обозначена столица Речи Посполитой.
4) Россия вышла из войны, которой посвящена схема, до её окончания.
5) События, обозначенные на схеме стрелками, происходили во второй половине XVIII в.
6) В ходе данной войны произошло Гангутское сражение."""

Q1_17 = """№17
Установи соответствие между памятниками культуры и их краткими характеристиками: \
к каждой позиции первого столбца подбери соответствующую позицию из второго столбца.

ПАМЯТНИКИ КУЛЬТУРЫ
А) «Задонщина»
Б) кинофильм «Летят журавли»
В) картина «Утро стрелецкой казни»
Г) «Повесть о Ерше Ершовиче, сыне Щетинникове»

ХАРАКТЕРИСТИКИ
1) Автор — И.Е. Репин.
2) Данный памятник культуры создан в период руководства СССР Л.И. Брежнева.
3) Данный памятник культуры создан в период руководства СССР Н.С. Хрущёва.
4) Данный памятник культуры создан в XVII.
5) Автор — В.И. Суриков.
6) Данный памятник культуры посвящён событиям, произошедшим в XIV в.

Запиши подряд 4 цифры ответа - например, 1234"""

Q1_18 = """№18
Какие суждения о данной афише являются верными? Выбери два суждения из пяти \
предложенных. Запиши подряд цифры, под которыми они указаны.

1) Фильм, которому посвящена афиша, был снят в период руководства страной И.В. Сталина.
2) Режиссёром фильма, которому посвящена данная афиша, является Э.А. Рязанов.
3) Фильм, которому посвящена афиша, стал лауреатом «Золотой пальмовой ветви» \
Международного Каннского кинофестиваля.
4) Один из городов, указанных на афише, в настоящее время имеет другое название.
5) Фильм посвящён событиям, произошедшим до начала Великой Отечественной войны."""

Q1_19 = """№19
Какие из данных плакатов были созданы в том же десятилетии, что и фильм, которому \
посвящена афиша? В ответе запиши подряд две цифры, под которыми указаны эти плакаты."""

Q1_20 = """№20
В общем, дальше для меня оценивать сложновато, так что тебе предстоит оценивать себя самостоятельно \
Прочти отрывок из исторического источника и кратко ответь на вопросы 20—22. До того, как решишь, \
в ответы не смотреть, иначе будет необъективно. 

Из записок современника событий
«За год, или года за два до кончины императрицы Екатерины II, известный богач Бекетов, \
умирая, составил духовное завещание, вопреки существовавшим тогда на этот предмет законам, \
и назначил родовое имение отдать, помимо прямых по роду его наследников, сторонним людям и \
дальним родственникам.
Само собою разумеется, возникла из этого тяжба. Имение Бекетова \
стоило многих миллионов, много и денег оставлено за него тяжущимися в судах; наконец тяжба \
поступила в Сенат, и должно полагать, что в то время боялись Бога в Сенате: дело решено по \
сущей справедливости, основанной на точной силе слов закона, т. е. духовное завещание \
Бекетова уничтожено, и родовое имение его велено отдать по праву наследия ближайшим \
родственникам, прямым Бекетова наследникам.
Решение Сената последовало, можно сказать, в \
последние дни жизни Екатерины и не было ещё приведено в исполнение.
С [воцарением нового императора] всё переменилось, и быстрота выполнения особых \
велений, по первому на предмет взгляду, без объёма, без обсуждения и рассуждения, без \
собрания сведений, произвела во всём такое смешение, такую тьму, как в хаосе довременном. \
Все торопились, все суетились, все были, казалось, в непрестанном движении, все трудились, \
работали, и всё не шло, и никто не знал, что делал, как делал, почему и для чего так делал. \
Барабанный грохот навёл на всё царство одурение! Воспоминая о [том времени], содрогаешься, \
ужасное было время!
Лишившиеся по решению Сената данного им, по завещанию, Бекетовым большого \
достояния воспользовались водворившимся хаосом и, прискакав во град св. Петра, в короткое \
время успели туго набитым мешком золота или ассигнациями отворить себе всюду дверь и \
доступ.
Алексей Куракин, тогдашний генерал-прокурор, близкий человек царю, облечённый полною его \
доверенностью, осыпанный милостями и почестями, утопавший в роскоши и сладострастии, алчный, \
корыстолюбивый и ненасытный, не замедлил благосклонно выслушать просителей и устроил обманом \
так, что явился указ Сенату, изложенный весьма лаконически: “Духовное завещание Бекетова \
утвердить во всей его силе”».

Назови «нового императора», о котором идёт речь в отрывке. Укажи год начала его \
правления. Назови государственного деятеля, который первым занимал должность, упомянутую в \
последнем абзаце данного отрывка.
После выполнения посмотри ответы, поставь себе оценку (от 0 до 2) и пришли мне сообщением."""

Q1_21 = """№21
Из записок современника событий
«За год, или года за два до кончины императрицы Екатерины II, известный богач Бекетов, \
умирая, составил духовное завещание, вопреки существовавшим тогда на этот предмет законам, \
и назначил родовое имение отдать, помимо прямых по роду его наследников, сторонним людям и \
дальним родственникам.
Само собою разумеется, возникла из этого тяжба. Имение Бекетова \
стоило многих миллионов, много и денег оставлено за него тяжущимися в судах; наконец тяжба \
поступила в Сенат, и должно полагать, что в то время боялись Бога в Сенате: дело решено по \
сущей справедливости, основанной на точной силе слов закона, т. е. духовное завещание \
Бекетова уничтожено, и родовое имение его велено отдать по праву наследия ближайшим \
родственникам, прямым Бекетова наследникам.
Решение Сената последовало, можно сказать, в \
последние дни жизни Екатерины и не было ещё приведено в исполнение.
С [воцарением нового императора] всё переменилось, и быстрота выполнения особых \
велений, по первому на предмет взгляду, без объёма, без обсуждения и рассуждения, без \
собрания сведений, произвела во всём такое смешение, такую тьму, как в хаосе довременном. \
Все торопились, все суетились, все были, казалось, в непрестанном движении, все трудились, \
работали, и всё не шло, и никто не знал, что делал, как делал, почему и для чего так делал. \
Барабанный грохот навёл на всё царство одурение! Воспоминая о [том времени], содрогаешься, \
ужасное было время!
Лишившиеся по решению Сената данного им, по завещанию, Бекетовым большого \
достояния воспользовались водворившимся хаосом и, прискакав во град св. Петра, в короткое \
время успели туго набитым мешком золота или ассигнациями отворить себе всюду дверь и \
доступ.
Алексей Куракин, тогдашний генерал-прокурор, близкий человек царю, облечённый полною его \
доверенностью, осыпанный милостями и почестями, утопавший в роскоши и сладострастии, алчный, \
корыстолюбивый и ненасытный, не замедлил благосклонно выслушать просителей и устроил обманом \
так, что явился указ Сенату, изложенный весьма лаконически: “Духовное завещание Бекетова \
утвердить во всей его силе”».

В чём состояло нарушение действовавших законов богачом Бекетовым? В чём состояло отмеченное \
автором изменение в осуществлении дел, связанных с управлением государством, произошедшее \
при «новом императоре» (укажи одно положение)? С помощью какого средства наследники \
Бекетова по завещанию сумели изменить первоначальное решение Сената?
После выполнения посмотри ответы, поставь себе оценку (от 0 до 2) и пришли мне сообщением."""

Q1_22 = """№22
Из записок современника событий
«За год, или года за два до кончины императрицы Екатерины II, известный богач Бекетов, \
умирая, составил духовное завещание, вопреки существовавшим тогда на этот предмет законам, \
и назначил родовое имение отдать, помимо прямых по роду его наследников, сторонним людям и \
дальним родственникам.
Само собою разумеется, возникла из этого тяжба. Имение Бекетова \
стоило многих миллионов, много и денег оставлено за него тяжущимися в судах; наконец тяжба \
поступила в Сенат, и должно полагать, что в то время боялись Бога в Сенате: дело решено по \
сущей справедливости, основанной на точной силе слов закона, т. е. духовное завещание \
Бекетова уничтожено, и родовое имение его велено отдать по праву наследия ближайшим \
родственникам, прямым Бекетова наследникам.
Решение Сената последовало, можно сказать, в \
последние дни жизни Екатерины и не было ещё приведено в исполнение.
С [воцарением нового императора] всё переменилось, и быстрота выполнения особых \
велений, по первому на предмет взгляду, без объёма, без обсуждения и рассуждения, без \
собрания сведений, произвела во всём такое смешение, такую тьму, как в хаосе довременном. \
Все торопились, все суетились, все были, казалось, в непрестанном движении, все трудились, \
работали, и всё не шло, и никто не знал, что делал, как делал, почему и для чего так делал. \
Барабанный грохот навёл на всё царство одурение! Воспоминая о [том времени], содрогаешься, \
ужасное было время!
Лишившиеся по решению Сената данного им, по завещанию, Бекетовым большого \
достояния воспользовались водворившимся хаосом и, прискакав во град св. Петра, в короткое \
время успели туго набитым мешком золота или ассигнациями отворить себе всюду дверь и \
доступ.
Алексей Куракин, тогдашний генерал-прокурор, близкий человек царю, облечённый полною его \
доверенностью, осыпанный милостями и почестями, утопавший в роскоши и сладострастии, алчный, \
корыстолюбивый и ненасытный, не замедлил благосклонно выслушать просителей и устроил обманом \
так, что явился указ Сенату, изложенный весьма лаконически: “Духовное завещание Бекетова \
утвердить во всей его силе”».

Укажи любые три внутриполитические меры, предпринятые в период своего правления \
«новым императором», о котором идёт речь.
После выполнения посмотри ответы и поставь себе оценку (от 0 до 2)."""

Q1_23 = """№23
В 1879 г. произошёл раскол народнической организации, в результате которого \
образовались две организации — «Народная воля» и «Чёрный передел».
Укажи название расколовшейся организации. В чём состояла причина раскола?
Назови идеологическое направление организации, созданной через четыре года по инициативе \
участников «Чёрного передела».

После выполнения посмотри ответы, поставь себе оценку (от 0 до 3) и пришли мне сообщением."""

Q1_24 = """№24
В исторической науке существуют дискуссионные проблемы, по которым \
высказываются различные, часто противоречивые, точки зрения. Ниже приведена одна из \
спорных точек зрения, существующих в исторической науке.
«В период «оттепели» были нормализованы отношения между СССР и Западом».
Используя исторические знания, приведи два аргумента, которыми можно подтвердить \
данную точку зрения, и два аргумента, которыми можно опровергнуть её. При изложении \
аргументов обязательно используй исторические факты.
Ответ запиши в следующем виде.

Аргументы в подтверждение:
1) ...
2) ...

Аргументы в опровержение:
1) ...
2) ...

После выполнения посмотри ответы, поставь себе оценку (от 0 до 4) и пришли мне сообщением."""

Q1_25 = """№25
Тебе необходимо написать историческое сочинение об ОДНОМ из периодов истории России:
1) 1132–1236 гг.; 2) июнь 1812 г.–декабрь 1825 г.; 3) октябрь 1964 г.–март 1985 г.
В сочинении необходимо:
— указать не менее двух значимых событий (явлений, процессов), относящихся к \
данному периоду истории;
— назвать две исторические личности, деятельность которых связана с указанными \
событиями (явлениями, процессами), и, используя знание исторических фактов, \
охарактеризовать роли названных тобой личностей в этих событиях (явлениях, процессах);
— указать не менее двух причинно-следственных связей, характеризующих причины \
возникновения событий (явлений, процессов), происходивших в данный период;
— используя знание исторических фактов и (или) мнений историков, оценить влияние \
событий (явлений, процессов) данного периода на дальнейшую историю России.
В ходе изложения необходимо корректно использовать исторические термины, понятия, \
относящиеся к данному периоду.

Внимание!
При характеристике роли каждой названной тобой личности необходимо указать конкретные \
действия этой личности, в значительной степени повлиявшие на ход и (или) результат указанных \
событий (процессов, явлений).

После выполнения посмотри критерии, поставь себе оценку (от 0 до 11) и пришли мне сообщением."""

otvet1_20 = '''Правильный ответ должен содержать следующие элементы:
1) «новый император» — Павел I;
2) год — 1796 г.;
3) государственный деятель — П.И. Ягужинский

Правильно указаны «новый император», год и государственный деятель - 2 БАЛЛА
Правильно указаны любые два элемента ответа - 1 БАЛЛ
Правильно указан один любой элемент ответа.
ИЛИ Ответ неправильный - 0 БАЛЛОВ'''

otvet1_21 = '''Правильный ответ должен содержать следующие элементы:
1) ответ на первый вопрос: Бекетов передал имение сторонним людям и дальним родственникам, обойдя \
прямых наследников;
2) ответ на второй вопрос: дела стали вестись быстрее (в спешке), но менее продуманно;
3) ответ на третий вопрос: с помощью дачи взяток, в том числе генерал-прокурору Алексею Куракину

Правильно даны ответы на три вопроса - 2 БАЛЛА
Правильно даны ответы на два вопроса - 1 БАЛЛ
Правильно дан ответ на один вопрос.
ИЛИ Ответ неправильный - 0 БАЛЛОВ'''

otvet1_22 = '''Могут быть указаны следующие меры, например:
1) издание нового закона о престолонаследии;
2) издание Указа о трёхдневной барщине;
3) введение телесных наказаний для дворян;
4) упразднение губернских дворянских собраний;
5) усиление цензуры;
6) изменение функций Сената.
Могут быть указаны другие меры

Правильно указаны три меры - 2 БАЛЛА
Правильно указаны любые две меры - 1 БАЛЛ
Правильно указана любая одна мера.
ИЛИ Ответ неправильный - 0 БАЛЛОВ'''

otvet1_23 = '''Правильный ответ должен содержать следующие элементы:
1) название организации — «Земля и воля»;
2) причина раскола: разногласия по вопросу приемлемости тактики террора и о целесообразности политической борьбы;
3) идеологическое направление — марксизм

Правильно указаны название организации, причина раскола и идеологическое направление - 3 БАЛЛА
Правильно указаны любые два элемента ответа - 2 БАЛЛА
Правильно указан любой один элемент ответа - 1 БАЛЛ
Приведены рассуждения общего характера, не соответствующие требованию задания.
ИЛИ Ответ неправильный - 0 БАЛЛОВ'''

otvet1_24 = '''Правильный ответ должен содержать аргументы:
1) в подтверждение, например:
— в 1955 г. состоялось Женевское совещание — первая в период после окончания Второй мировой войны встреча \
глав четырёх правительств — СССР, США, Великобритании и Франции;
— в 1955 г. советские войска были выведены из Австрии, что способствовало смягчению отношений между СССР и странами Запада;
— в 1959 г. Н.С. Хрущёв посетил США; это был первый в истории визит высшего советского руководителя в Соединённые Штаты;
— в период Карибского кризиса СССР и США удалось прийти к договорённости и избежать начала ядерной войны, что \
свидетельствует о взаимопонимании между руководством двух стран;
— в 1963 г. СССР, США и Великобритания подписали Договор о запрещении ядерных испытаний в атмосфере, космическом \
пространстве и под водой;
2) в опровержение, например:
— в 1961 г. вокруг Западного Берлина была построена бетонная стена, ставшая символом разделения мира на два \
враждующих лагеря; это свидетельствовало об остроте противостояния между СССР и Западом в германском вопросе;
— в 1962 г. произошёл Карибский кризис, едва не приведший к началу ядерной войны;
— после того как в 1960 г. над территорией СССР был сбит американский самолёт-шпион У-2, развитие \
отношений между СССР и США было заморожено, визит президента США Д. Эйзенхауэра в СССР был сорван;
— в 1955 г. была создана Организация Варшавского договора — военная организация для противостояния НАТО.
Могут быть приведены другие аргументы

Приведены два аргумента в подтверждение и два в опровержение оценки - 4 БАЛЛА
Приведены два аргумента в подтверждение и один в опровержение оценки.
ИЛИ Приведены один аргумент в подтверждение и два в опровержение оценки - 3 БАЛЛА
Приведены один аргумент в подтверждение и один в опровержение оценки - 2 БАЛЛА
Приведены только два аргумента в подтверждение оценки.
ИЛИ Приведены только два аргумента в опровержение оценки - 1 БАЛЛОВ
Приведён только один любой аргумент.
ИЛИ Приведены только факты, иллюстрирующие события (явления, процессы), связанные с данной \
точкой зрения, но не являющиеся аргументами.
ИЛИ Приведены рассуждения общего характера, не соответствующие требованию задания.
ИЛИ Ответ неправильный - 0 БАЛЛОВ'''

otvet1_25 = otvet2_25 = otvet3_25 = otvet4_25 = '''НАЙДИ СУММУ БАЛЛОВ ПО КРИТЕРИЯМ:

Правильно указаны два события (явления, процесса) - 2 БАЛЛА
Правильно указано одно событие (явление, процесс) - 1 БАЛЛ
События (явления, процессы) не указаны или указаны неверно - 0 БАЛЛОВ

Правильно названы две исторические личности, правильно охарактеризована роль каждой из \
этих личностей с указанием их конкретных действий, в значительной степени повлиявших на \
ход и (или) результат названных событий (явлений, процессов) рассматриваемого периода истории России - 2 БАЛЛА
Правильно названы одна-две исторические личности, правильно охарактеризована роль только \
одной личности с указанием её конкретных действий (или конкретного действия), в значительной \
степени повлиявших на ход и (или) результат названных событий (явлений, процессов) рассматриваемого \
периода истории России (или одного события (явления, процесса)) - 1 БАЛЛ
Правильно названы одна-две исторические личности, роль каждой из них в указанных событиях (явлениях, процессах) \
данного периода истории России не охарактеризована / охарактеризована неправильно.
ИЛИ Правильно названы одна-две исторические личности, при характеристике роли каждой из них \
в указанных событиях (явлениях, процессах) данного периода истории России приведены рассуждения \
общего характера без указания их конкретных действий, в значительной степени \
повлиявших на ход и (или) результат названных событий (явлений, процессов) рассматриваемого периода истории России.
ИЛИ Исторические личности названы неверно.
ИЛИ Исторические личности не названы - 0 БАЛЛОВ

Правильно указаны две причинно-следственные связи, характеризующие причины возникновения \
событий (явлений, процессов), происходивших в данный период - 2 БАЛЛА
Правильно указана одна причинно-следственная связь, характеризующая причины возникновения \
событий (явлений, процессов), происходивших в данный период - 1 БАЛЛ
Причинно-следственные связи указаны неверно / не указаны - 0 БАЛЛОВ

Дана оценка влияния событий (явлений, процессов) данного периода на дальнейшую историю \
России с опорой на исторические факты и (или) мнения историков - 1 БАЛЛ
Оценка влияния событий (явлений, процессов) данного периода на дальнейшую историю России сформулирована \
в общей форме или на уровне обыденных представлений, без привлечения исторических фактов и (или) мнений историков.
ИЛИ Оценка влияния событий (явлений, процессов) данного периода на дальнейшую историю России не дана - 0 БАЛЛОВ

При изложении корректно использована историческая терминология - 1 БАЛЛ
Все исторические термины, понятия использованы некорректно. \
ИЛИ Исторические термины, понятия не использованы - 0 БАЛЛОВ

В историческом сочинении отсутствуют фактические ошибки - 2 БАЛЛА
Допущена одна фактическая ошибка - 1 БАЛЛ
Допущены две или более фактические ошибки - 0 БАЛЛОВ

Ответ представлен в виде исторического сочинения (последовательное, связное изложение материала) - 1 БАЛЛ
Ответ представлен в виде отдельных отрывочных положений - 0 БАЛЛОВ


Максимальный балл 11'''

                    #Второй вариант
Q2_1 = """№1
Расположи в хронологической последовательности исторические события. Запиши \
цифры, которыми обозначены исторические события, в правильной последовательности, \
без пробелов (Например 123)

1) начало Крестовых походов
2) заключение Кючук-Кайнарджийского мира между Россией и Османской империей
3) отмена кормлений"""

Q2_2 = """№2
Установи соответствие между событиями и годами: к каждой позиции первого \
столбца подбери соответствующую позицию из второго столбца.

СОБЫТИЯ
А) начало освоения целинных земель
Б) разорение Москвы ханом Тохтамышем
В) начало реформы управления государственными крестьянами П.Д. Киселёва
Г) начало царствования Бориса Годунова

ГОДЫ
1) 1237 г.
2) 1382 г.
3) 1598 г.
4) 1837 г.
5) 1929 г.
6) 1954 г.

Запиши 4 цифры ответа подряд, без пробелов
Например Если А=6,Б=2,В=4,Г=3, то ответ будет 6243"""

Q2_3 = """№3
Ниже приведён список терминов. Все они, за исключением двух, относятся к \
событиям, явлениям истории СССР периода 1945—1953 гг.

1) космополитизм; 2) новое политическое мышление; 3) социалистический лагерь; \
4) демобилизация; 5) страны народной демократии; 6) либерализация цен.

Найди и запиши порядковые номера терминов, относящихся к другому историческому \
периоду."""

Q2_4 = """№4
Запиши термин, о котором идёт речь.
Процесс передачи государственного имущества Российской Федерации в частную \
собственность, который осуществляется в России с начала 1990-х годов."""

Q2_5 = """№5
Установи соответствие между процессами (явлениями, событиями) и фактами, \
относящимися к этим процессам (явлениям, событиям): к каждой позиции первого столбца \
подбери соответствующую позицию из второго столбца.

ПРОЦЕССЫ (ЯВЛЕНИЯ, СОБЫТИЯ)
А) преодоление Россией последствий Смутного времени
Б) объединение русских земель вокруг Москвы
В) внешняя политика Екатерины II
Г) критика культа личности И.В. Сталина

ФАКТЫ
1) XX съезд КПСС
2) II Всероссийский съезд Советов
3) первое упоминание Москвы в летописи
4) Смоленская война
5) штурм Измаила русскими войскам под командованием А.В. Суворова
6) битва на р. Шелони

Запиши 4 цифры ответа подряд, без пробелов
Например Если А=6,Б=2,В=4,Г=3, то ответ будет 6243"""

Q2_6 = """№6
Установи соответствие между фрагментами исторических источников и их краткими \
характеристиками: к каждому фрагменту, обозначенному буквой, подбери по две \
соответствующие характеристики, обозначенные цифрами.

ФРАГМЕНТЫ ИСТОЧНИКОВ
А) «Выступил в поход Олег, взяв с собою много воинов своих: варягов, чудь, славян, \
мерю, весь, кривичей, и овладел городом Смоленском и посадил в нём своего мужа. \
Оттуда отправился вниз, и придя, взял Любеч, и также посадил мужа своего. \
И пришли к горам киевским, и увидел Олег, что княжат тут Аскольд и Дир, спрятал \
он воинов в ладьях, а других оставил позади, а сам приступил, неся отрока Игоря. \
И подошёл к Угорской горе, спрятав своих воинов, и послал к Аскольду и Диру, \
говоря им, что-де “мы купцы, идём в Греки от Олега и княжича Игоря, придите к нам, \
к родичам своим”. Когда же Аскольд и Дир пришли, выскочили все из ладей, \
и сказал Олег Аскольду и Диру: “Не князья вы и не княжеского рода, но я княжеского \
рода”, и вынесли Игоря: “А это сын Рюрика”. И убили Аскольда и Дира…»

Б) «Новгородцы призвали псковичей и ладожан и задумали изгнать князя своего Всеволода \
Мстиславича; посадили его в епископский двор с женой, детьми и тёщей, месяца мая 28, \
и стража с оружием сторожила его день и ночь, 30 мужей ежедневно. Сидел он два месяца, \
и отпустили его из города июля 15, а приняли его сына Владимира. А вот в чём обвиняли его: \
1) не бережёт смердов, 2) зачем захотел сесть в Переяславле, 3) бежал с поля битвы впереди \
всех; а из-за того много убитых…»

ХАРАКТЕРИСТИКИ
1) Описываемые события произошли в IX в.
2) Александр Невский в XIII в. княжил в городе, в котором происходили описываемые события.
3) Описываемые события произошли в период политической раздробленности Древнерусского государства.
4) Современником описываемых событий был Ярослав Мудрый.
5) События, описываемые в отрывке, привели к образованию Древнерусского государства.
6) Описываемые события произошли в XI в.

Запиши 4 цифры ответа подряд, без пробелов
Например Если А=6,2 а Б=4,3, то ответ будет 6243"""

Q2_7 = """№7
Какие из перечисленных событий относятся к XIII в.? Выбери три ответа и запиши \
подряд цифры, под которыми они указаны.


1) поход хана Едигея на Русь
2) образование государства Золотая Орда
3) Куликовская битва
4) разгром немецких рыцарей на Чудском озере
5) первое упоминание Москвы в летописи
6) битва на р. Калке"""

Q2_8 = """№8
Заполни пропуски в данных предложениях, используя приведённый ниже список \
пропущенных элементов: для каждого предложения, обозначенного буквой и содержащего \
пропуск, выбери номер нужного элемента.

А) Участником подпольной организации «Молодая гвардия», действовавшей в годы \
Великой Отечественной войны в городе Краснодоне, был ________.
Б) В 1945 г. от фашистов был освобождён город ________.
В) Частичный прорыв блокады Ленинграда был осуществлён в ________ г.

Пропущенные элементы:
1) ноябре 1942 г.
2) Л.М. Доватор
3) О.В. Кошевой
4) Варшава
5) январь 1943 г.
6) Минск

Запиши 3 цифры ответа подряд, без пробелов
Например Если А=6, Б=2, В=4, то ответ будет 624"""

Q2_9 = """№9
Установи соответствие между событиями и участниками этих событий: к каждой \
позиции первого столбца подбери соответствующую позицию из второго столбца.

СОБЫТИЯ
А) освоение Дальнего Востока в XVII в.
Б) подготовка Великих реформ 1860–1870-х гг.
В) Любечский съезд князей
Г) экономические реформы в СССР в 1960-х гг.

УЧАСТНИКИ
1) Е.П. Хабаров
2) Н.А. Милютин
3) Владимир Мономах
4) А.А. Жданов
5) А.Н. Косыгин
6) Даниил Галицкий

Запиши 4 цифры ответа подряд, без пробелов
Например Если А=6,Б=2,В=4,Г=3, то ответ будет 6243"""

Q2_10 = """№10
Прочти отрывок из постановления Президиума ЦК КПСС и укажи фамилию, \
дважды пропущенную в тексте.

«Учитывая также поданное т. _________ заявление, Президиум ЦК КПСС постановляет:
Удовлетворить просьбу т. _________ об освобождении его от обязанностей Первого секретаря, \
члена Президиума ЦК и председателя Совета Министров СССР в связи с преклонным возрастом и \
ухудшением состояния здоровья.
Признать нецелесообразным в дальнейшем объединять в одном лице обязанности Первого \
секретаря ЦК и председателя Совета Министров СССР»."""

Q2_11 = """№11
Даны несколько цепочек вида:
Век: Событие в России, Событие за рубежом
Некоторые значения пропущены. Необходимо заполнить их, используя предложенные варианты.

(А): (Б), нормандское завоевание Англии

(В): начало правления Ивана Калиты, Начало Столетней войны
XV в: (Г), (Д)
XVII в: принятие Соборного уложения, (Е)

Пропущенные элементы:
1) начало создания «Русской Правды»
2) стояние на Угре
3) Варфоломеевская ночь во Франции
4) XI в.
5) заключение Вестфальского мира
6) начало Ливонской войны
7) XVI в.
8) открытие Америки Христофором Колумбом
9) XIV в.

Запиши подряд цифры, соответствующие А, Б, В, Г, Д и Е (например 123456)"""

Q2_12 = """№12
Прочти отрывок из воспоминаний советского военачальника.

«...Пульс тяжёлой индустрии, оборонной промышленности бился учащённо, достиг в \
предвоенные годы и месяцы наивысшего напряжения и полноты. Строже, как бы \
собраннее становилась и жизнь государства в целом.
Внеочередная IV сессия Верховного Совета СССР в сентябре... принимает Закон \
“О всеобщей воинской обязанности”. По новому закону в армию призываются лица, \
которым исполнилось 19 лет, а для окончивших среднюю школу призывной возраст \
устанавливается в 18 лет. Для более совершенного овладения военным делом были \
увеличены сроки действительной службы: для младших командиров сухопутных войск и \
ВВС — с двух до трёх лет, для рядового состава ВВС, а также рядового и младшего \
комсостава пограничных войск — до четырёх лет, на кораблях и в частях флота — \
до пяти лет.
Выполнение третьего пятилетнего плана в целом и заданий в области тяжёлой и оборонной \
промышленности в частности, а также угроза военного нападения на СССР требовали \
увеличения количества рабочего времени, отданного народному хозяйству. В связи с этим \
Президиум Верховного Совета СССР... принимает Указ «О переходе на восьмичасовой рабочий \
день, на семидневную неделю и о запрещении самовольного ухода рабочих и служащих с \
предприятий и учреждений»...
Тогда же... Президиум Верховного Совета СССР издал Указ «Об ответственности за выпуск \
недоброкачественной продукции и за несоблюдение обязательных стандартов промышленными \
предприятиями». Вводились строгие меры, способствовавшие улучшению руководства \
предприятиями, укреплялись дисциплина, ответственность и порядок...
Все эти изменения вызывались исключительно возросшим объёмом работы, требованиями \
подготовки к активной обороне от агрессии, возможность которой нарастала с каждым месяцем».

Используя отрывок и знания по истории, выбери в приведённом списке три верных
суждения. Запиши подряд цифры, под которыми они указаны.

1) Все нормативные акты, названные в отрывке, были приняты (изданы) в период 1939—1941 гг.
2) Сроки военной службы по закону, о котором идёт речь в данном отрывке, \
сокращались по сравнению с предшествующим периодом.
3) Автор считает, что меры, описанные в отрывке, были излишне строгими.
4) По указу, о котором сказано в третьем абзаце отрывка, устанавливался \
порядок, при котором у работников не было дней отдыха.
5) В годы, когда были приняты (изданы) нормативные акты, о которых идёт \
речь в отрывке, к СССР были присоединены новые территории.
6) Орган государственной власти, о внеочередной сессии которого сказано \
во втором абзаце отрывка, был создан в 1930-е гг."""

Q2_13 = """№13
Укажи месяц, когда Красная армия перешла в контрнаступление с линии максимального \
продвижения войск противника, обозначенной на схеме."""

Q2_14 = """№14
Укажи название города, обозначенного на схеме цифрой «1»."""

Q2_15 = """Назови фамилию премьер-министра Великобритании в период, когда \
произошли события, обозначенные на схеме."""

Q2_16 = """№16
Какие суждения, относящиеся к событиям, обозначенным на схеме, являются \
верными? Выбери три суждения из шести предложенных. Запиши подряд цифры, \
под которыми они указаны.

1) На схеме обозначены действия немецких войск в ходе осуществления операции «Цитадель».
2) На схеме обозначены «котлы» окружения, в которые попадали части Красной армии.
3) Линия фронта, обозначенная на схеме цифрой «3», образовалась к концу сентября.
4) Цифрой «2» на схеме обозначен г. Смоленск.
5) На схеме обозначен город, в котором находилась приграничная крепость, \
прославившаяся героизмом своих защитников в первые недели войны.
6) В период, когда начались события, обозначенные на схеме стрелками, \
существовало независимое государство Польша. """

Q2_17 = """№17
Установи соответствие между памятниками культуры и их краткими \
характеристиками: к каждой позиции первого столбца подбери соответствующую \
позицию из второго столбца.

ПАМЯТНИКИ КУЛЬТУРЫ
А) «Хожение за три моря»
Б) «Архипелаг ГУЛаг»
В) Казанский собор в Санкт-Петербурге
Г) «История о великом князе московском»

ХАРАКТЕРИСТИКИ
1) Автор — Андрей Курбский.
2) Автор — А.Т. Твардовский.
3) Автор — А.Н. Воронихин.
4) Автор был удостоен Нобелевской премии по литературе.
5) Автор — Афанасий Никитин.
6) Данный памятник культуры создан в XIV в.

Запиши подряд 4 цифры ответа - например, 1234"""

Q2_18 = """№18
Какие суждения о данном изображении являются верными? Укажи два суждения \
из пяти предложенных. Запиши подряд цифры, под которыми они указаны.

1) Данная марка выпущена в 1960-х гг.
2) Событие, изображённое на марке, произошло в период правления в России Екатерины II.
3) Монарх, правивший в России в период, когда произошло событие, изображённое \
на марке, выступил в поддержку революционеров.
4) Событие, изображённое на марке, произошло в Версале.
5) Король, правивший во Франции в период, когда произошло событие, изображённое \
на марке, был казнён."""

Q2_19 = """№19
Какие из зданий были построены в том же веке, когда произошло событие, \
которому посвящена данная марка? В ответе запиши подряд две цифры, под которыми указаны \
эти здания."""

Q2_20 = """№20
В общем, дальше для меня оценивать сложновато, так что тебе предстоит оценивать себя самостоятельно \
Прочти отрывок из исторического источника и кратко ответь на вопросы 20—22. До того, как решишь, \
в ответы не смотреть, иначе будет необъективно.

Из сочинения иностранца, побывавшего в России
«Ныне царствующий император происходит от потомков Ивана с материнской стороны... \
Все сыновья императорские называются царевичами, т.е. сыновьями царя; что же касается \
до слова царь, то оно очень близко к титулу цезарь, и потому большое сходство имеет \
с титулом император. <...>
Ныне царствующий император <...> как испанцы, помещает много титулов в гербе своём. \
<...> На гербе императорском изображён орёл с распростёртыми крыльями, что знаменует \
происхождение его от римских императоров; но у этого герба есть то отличие, что над \
двойной головою орла изображается корона с крестом, а на груди — св. Георгий на коне; \
последний, как некоторые говорят, прибавлен с тех пор, как королева Елизавета прислала \
Ивану Васильевичу орден Подвязки. <...>
Некоторые из главных бояр имеют каменные дома, заключённые во внутренней ограде, как то: \
князь Яков Черкасский; Борис Иванович Морозов, бывший пестуном императора во время его \
малолетства ... Илья Данилович Милославский, тесть императора; князь Иван Васильевич \
Одоевский. <...>
Город Москва занимает очень большое пространство, обнесённое тремя стенами, кроме той \
стены, что окружает императорский дворец. Внутренняя стена красного цвета и сложена из \
кирпича, вторая белая, а третья деревянная и набита землёю. Последняя имеет около \
пятнадцати или шестнадцати миль в окружности, а выстроена была в четыре или пять дней \
по случаю приближения крымских татар. В ней брёвен столько, что можно выстроить из них \
род лондонских тонкостенных домиков в пятнадцать миль длины. С тех пор как его величество \
был в Польше, видел тамошний образ жизни и стал подражать польскому королю, круг его \
понятий расширился: он начинает ... строить здания красивее прежнего, украшать покои \
обоями и заводить увеселительные дома. <...>
Одежда царя такая же, как и боярская, только богаче. Царица отличается высокой уборкой \
головы и рукавами рубашки длиною от 30 до 36 английских футов, а рукава её верхнего \
платья так же широки, как у наших бакалавров. Все женщины высшего сословия одеваются \
так же».

Назови «императора», о котором идёт речь в отрывке. Укажи год начала его правления. \
Назови архитектора белой стены, упомянутой в отрывке.

После выполнения посмотри ответы, поставь себе оценку (от 0 до 2) и пришли мне сообщением."""

Q2_21 = """№21
Из сочинения иностранца, побывавшего в России
«Ныне царствующий император происходит от потомков Ивана с материнской стороны... \
Все сыновья императорские называются царевичами, т.е. сыновьями царя; что же касается \
до слова царь, то оно очень близко к титулу цезарь, и потому большое сходство имеет \
с титулом император. <...>
Ныне царствующий император <...> как испанцы, помещает много титулов в гербе своём. \
<...> На гербе императорском изображён орёл с распростёртыми крыльями, что знаменует \
происхождение его от римских императоров; но у этого герба есть то отличие, что над \
двойной головою орла изображается корона с крестом, а на груди — св. Георгий на коне; \
последний, как некоторые говорят, прибавлен с тех пор, как королева Елизавета прислала \
Ивану Васильевичу орден Подвязки. <...>
Некоторые из главных бояр имеют каменные дома, заключённые во внутренней ограде, как то: \
князь Яков Черкасский; Борис Иванович Морозов, бывший пестуном императора во время его \
малолетства ... Илья Данилович Милославский, тесть императора; князь Иван Васильевич \
Одоевский. <...>
Город Москва занимает очень большое пространство, обнесённое тремя стенами, кроме той \
стены, что окружает императорский дворец. Внутренняя стена красного цвета и сложена из \
кирпича, вторая белая, а третья деревянная и набита землёю. Последняя имеет около \
пятнадцати или шестнадцати миль в окружности, а выстроена была в четыре или пять дней \
по случаю приближения крымских татар. В ней брёвен столько, что можно выстроить из них \
род лондонских тонкостенных домиков в пятнадцать миль длины. С тех пор как его величество \
был в Польше, видел тамошний образ жизни и стал подражать польскому королю, круг его \
понятий расширился: он начинает ... строить здания красивее прежнего, украшать покои \
обоями и заводить увеселительные дома. <...>
Одежда царя такая же, как и боярская, только богаче. Царица отличается высокой уборкой \
головы и рукавами рубашки длиною от 30 до 36 английских футов, а рукава её верхнего \
платья так же широки, как у наших бакалавров. Все женщины высшего сословия одеваются \
так же».

Укажи событие, с которым автор связывает появление на российском гербе изображения \
святого Георгия Победоносца. Какие новшества в жизни царского двора, по мнению автора, \
связаны с тем, что император побывал на территории другого государства? Укажи два \
новшества.
После выполнения посмотри ответы, поставь себе оценку (от 0 до 2) и пришли мне сообщением."""

Q2_22 = """№22
Из сочинения иностранца, побывавшего в России
«Ныне царствующий император происходит от потомков Ивана с материнской стороны... \
Все сыновья императорские называются царевичами, т.е. сыновьями царя; что же касается \
до слова царь, то оно очень близко к титулу цезарь, и потому большое сходство имеет \
с титулом император. <...>
Ныне царствующий император <...> как испанцы, помещает много титулов в гербе своём. \
<...> На гербе императорском изображён орёл с распростёртыми крыльями, что знаменует \
происхождение его от римских императоров; но у этого герба есть то отличие, что над \
двойной головою орла изображается корона с крестом, а на груди — св. Георгий на коне; \
последний, как некоторые говорят, прибавлен с тех пор, как королева Елизавета прислала \
Ивану Васильевичу орден Подвязки. <...>
Некоторые из главных бояр имеют каменные дома, заключённые во внутренней ограде, как то: \
князь Яков Черкасский; Борис Иванович Морозов, бывший пестуном императора во время его \
малолетства ... Илья Данилович Милославский, тесть императора; князь Иван Васильевич \
Одоевский. <...>
Город Москва занимает очень большое пространство, обнесённое тремя стенами, кроме той \
стены, что окружает императорский дворец. Внутренняя стена красного цвета и сложена из \
кирпича, вторая белая, а третья деревянная и набита землёю. Последняя имеет около \
пятнадцати или шестнадцати миль в окружности, а выстроена была в четыре или пять дней \
по случаю приближения крымских татар. В ней брёвен столько, что можно выстроить из них \
род лондонских тонкостенных домиков в пятнадцать миль длины. С тех пор как его величество \
был в Польше, видел тамошний образ жизни и стал подражать польскому королю, круг его \
понятий расширился: он начинает ... строить здания красивее прежнего, украшать покои \
обоями и заводить увеселительные дома. <...>
Одежда царя такая же, как и боярская, только богаче. Царица отличается высокой уборкой \
головы и рукавами рубашки длиною от 30 до 36 английских футов, а рукава её верхнего \
платья так же широки, как у наших бакалавров. Все женщины высшего сословия одеваются \
так же».

Укажи любые три меры в сфере социально-экономических отношений, предпринятые в период \
правления монарха, о котором идёт речь.
После выполнения посмотри ответы, поставь себе оценку (от 0 до 2) и пришли мне сообщением."""

Q2_23 = """№23
Летом 1830 г. на французский престол вступил король Луи Филипп. Но российский \
император Николай не хотел признавать нового короля и даже вынашивал планы военной \
интервенции во Францию. Однако в октябре Россия всё же признала нового короля Франции. \
Почему Николай I не желал признавать Луи Филиппа? Укажи одну любую причину. Назови \
одно обстоятельство, по причине которого Россия не начала интервенцию во Францию и Николай \
I всё же признал Луи Филиппа. Назови иностранное государство, в котором в период правления \
Николая I революция была подавлена при помощи русских войск.
После выполнения посмотри ответы, поставь себе оценку (от 0 до 3) и пришли мне сообщением."""

Q2_24 = """№24
В исторической науке существуют дискуссионные проблемы, по которым \
высказываются различные, часто противоречивые, точки зрения. Ниже приведена одна из \
спорных точек зрения, существующих в исторической науке.
«В период «оттепели» были нормализованы отношения между СССР и Западом».
Используя исторические знания, приведи два аргумента, которыми можно подтвердить \
данную точку зрения, и два аргумента, которыми можно опровергнуть её. При изложении \
аргументов обязательно используй исторические факты.
Ответ запиши в следующем виде.

Аргументы в подтверждение:
1) ...
2) ...

Аргументы в опровержение:
1) ...
2) ...

После выполнения посмотри ответы, поставь себе оценку (от 0 до 4) и пришли мне сообщением."""

Q2_25 = """Тебе необходимо написать историческое сочинение об ОДНОМ из периодов \
истории России:
1) 1132–1236 гг.; 2) июнь 1812 г.–декабрь 1825 г.; 3) октябрь 1964 г.–март 1985 г.
В сочинении необходимо:
— указать не менее двух значимых событий (явлений, процессов), относящихся к \
данному периоду истории;
— назвать две исторические личности, деятельность которых связана с указанными \
событиями (явлениями, процессами), и, используя знание исторических фактов, \
охарактеризовать роли названных тобой личностей в этих событиях (явлениях, \
процессах);

— указать не менее двух причинно-следственных связей, характеризующих причины \
возникновения событий (явлений, процессов), происходивших в данный период;
— используя знание исторических фактов и (или) мнений историков, оценить \
влияние событий (явлений, процессов) данного периода на дальнейшую историю России.
В ходе изложения необходимо корректно использовать исторические термины, \
понятия, относящиеся к данному периоду.
Внимание!
При характеристике роли каждой названной  тобой личности необходимо указать \
конкретные действия этой личности, в значительной степени повлиявшие на ход \
и (или) результат указанных событий (процессов, явлений).

После выполнения посмотри критерии, поставь себе оценку (от 0 до 11) и пришли мне сообщением."""

otvet2_20 = '''Правильный ответ должен содержать следующие элементы:
1) «император» — Алексей Михайлович;
2) год — 1645 г.;
3) архитектор — Ф.С. Конь

Правильно указаны «император», год и архитектор - 2 БАЛЛА
Правильно указаны любые два элемента ответа - 1 БАЛЛ
Правильно указан один любой элемент ответа.
ИЛИ Ответ неправильный - 0 БАЛЛОВ'''

otvet2_21 = '''Правильный ответ должен содержать следующие элементы:
1) событие: получение Иваном IV от английской королевы Елизаветы ордена Подвязки;
2) новшества:
— строительство более красивых зданий;
— украшение покоев обоями;
— заведение увеселительных домов

Правильно указаны событие и два новшества - 2 БАЛЛА
Правильно указаны событие и одно новшество.
ИЛИ Правильно указаны только два новшества - 1 БАЛЛ
Правильно указано только событие.
ИЛИ Правильно указано только одно новшество.
ИЛИ Ответ неправильный - 0 БАЛЛОВ'''

otvet2_22 = '''Могут быть указаны следующие меры, например:
1) денежная реформа (введение в обращение медных денег);
2) отмена «урочных лет»;
3) отмена «белых слобод» и передача их в тягло;
4) регламентация норм русского торгового права (издание Торгового и Новоторгового уставов);
5) запрещение взимать мелкие таможенные пошлины;
6) неудачная попытка введения новой соляной пошлины.
Могут быть указаны другие меры

Правильно указаны три меры - 2 БАЛЛА
Правильно указаны любые две меры - 1 БАЛЛ
Правильно указана любая одна мера.
ИЛИ Ответ неправильный - 0 БАЛЛОВ'''

otvet2_23 = '''Правильный ответ должен содержать следующие элементы:
1) причина, например:
— Луи Филипп пришёл к власти в результате революции;
(Может быть указана другая причина);
2) обстоятельство, например:
— восшествие на престол Луи Филиппа положило конец развитию революции во Франции;
— в сентябре Англия, Австрия и Пруссия признали Луи Филиппа;
(Может быть указано другое обстоятельство);
3) иностранное государство — Австрия (Венгрия)

Правильно указаны причина, обстоятельство и иностранное государство - 3 БАЛЛА
Правильно указаны любые два элемента ответа - 2 БАЛЛА
Правильно указан любой один элемент ответа - 1 БАЛЛ
Приведены рассуждения общего характера, не соответствующие требованию задания.
ИЛИ Ответ неправильный - 0 БАЛЛОВ'''

otvet2_24 = '''Правильный ответ должен содержать аргументы:
1) в подтверждение, например:
— в докладе на заключительном заседании XX съезда КПСС Н.С. Хрущёв осудил культ личности
И.В. Сталина, массовый террор и преступления второй половины 1930-х — начала 1950-х гг.;
— в СССР прекратились массовые репрессии;
— начался процесс реабилитации политических заключённых;
— ослабло идеологическое давление со стороны государства на сферу культуры, что сделало возможным \
публикацию ранее запрещённых произведений;
— экономика периода «оттепели» стала более ориентированной на удовлетворение потребностей людей, \
чем в период руководства СССР И.В. Сталина (массовое жилищное строительство и др.);
2) в опровержение, например:
— в СССР сохранилась партийная власть, все решения принимались верхушкой КПСС;
— в СССР сохранилось господство марксистско-ленинской идеологии;
— продолжались гонения на неугодных власти деятелей культуры (например, «дело Пастернака»).
Могут быть приведены другие аргументы

Приведены два аргумента в подтверждение и два в опровержение оценки - 4 БАЛЛА
Приведены два аргумента в подтверждение и один в опровержение оценки.
ИЛИ Приведены один аргумент в подтверждение и два в опровержение оценки - 3 БАЛЛА
Приведены один аргумент в подтверждение и один в опровержение оценки - 2 БАЛЛА
Приведены только два аргумента в подтверждение оценки.
ИЛИ Приведены только два аргумента в опровержение оценки - 1 БАЛЛ
Приведён только один любой аргумент.
ИЛИ Приведены только факты, иллюстрирующие события (явления, процессы), связанные с данной \
точкой зрения, но не являющиеся аргументами.
ИЛИ Приведены рассуждения общего характера, не соответствующие требованию задания.
ИЛИ Ответ неправильный - 0 БАЛЛОВ'''

                    #Третий вариант

Q3_1 = """№1
Расположи в хронологической последовательности исторические события. Запиши \
цифры, которыми обозначены исторические события, в правильной последовательности \
без пробелов (Например 123)

1) присоединение Крыма к Российской империи
2) покорение Сибирского ханства Ермаком Тимофеевичем
3) «Сто дней» Наполеона """

Q3_2 = """№2
Установи соответствие между событиями и годами: к каждой позиции первого \
столбца подбери соответствующую позицию из второго столбца.

СОБЫТИЯ
А) издание Указа о единонаследии
Б) Карибский кризис
В) Медный бунт
Г) битва на р. Воже

ГОДЫ
1) 1240 г.
2) 1378 г.
3) 1662 г.
4) 1714 г.
5) 1939 г.
6) 1962 г.

Запиши 4 цифры ответа подряд, без пробелов
Например Если А=6,Б=2,В=4,Г=3, то ответ будет 6243"""

Q3_3 = """№3
Ниже приведён список терминов. Все они, за исключением двух, \
относятся к событиям, явлениям периода существования Древнерусского государства.

1) вервь; 2) закуп; 3) стрельцы; 4) мануфактура; 5) христианство; 6) погосты.

Найди и запиши порядковые номера терминов, относящихся к другому историческому периоду."""

Q3_4 = """№4
Запиши пропущенное слово

В 1864 г. был введён новый Устав гимназий и прогимназий, по которому гимназии \
стали делиться на и реальные."""

Q3_5 = """№5
Установи соответствие между процессами (явлениями, событиями) и фактами, \
относящимися к этим процессам (явлениям, событиям): к каждой позиции первого столбца \
подбери соответствующую позицию из второго столбца.

ПРОЦЕССЫ (ЯВЛЕНИЯ, СОБЫТИЯ)
А) внешняя политика первых русских князей
Б) внешняя политика Ивана IV
В) Северная война
Г) советско-финляндская война

ФАКТЫ
1) битва на Калке
2) присоединение к России Астрахани
3) Полтавская битва
4) сражение под Прохоровкой
5) поход Олега на Константинополь
6) штурм «Линии Маннергейма»

Запиши 4 цифры ответа подряд, без пробелов
Например Если А=6,Б=2,В=4,Г=3, то ответ будет 6243"""

Q3_6 = """№6
Установи соответствие между фрагментами исторических источников и их \
краткими характеристиками: к каждому фрагменту, обозначенному буквой, подбери \
по две соответствующие характеристики, обозначенные цифрами.

ФРАГМЕНТЫ ИСТОЧНИКОВ
А) «Что се есть? До чего мы дожили, о россияне? Что видим? Что делаем? Петра Великого \
погребаем! Не мечтание ли се? Не сонное ли нам привидение? Ох, как истинная печаль! \
Ох, как известное наше злоключение! Виновник бесчисленных благополучий наших и \
радостей, воскресивший аки от мертвых Россию и воздвигший в толикую силу и славу…»
Б) «В 25 день января повезли тело Государыни, во гробе лежащей, со всевозможным \
великолепием и подобающими почестями изо дворца чрез реку в Петропавловский собор \
в крепость. Сам император, за ним — я, за мною — Скавронские, за ними — Нарышкины, \
потом все по рангам шли пеши за гробом от самого дворца до церкви.
Император в сей день был чрезмерно весел и посреди церемонии сей траурной сделал \
себе забаву: нарочно отстанет от везущего тела одра, пустив оного вперёд сажен \
тридцать, потом изо всей силы добежит; старшие камергеры, носящие шлейф епанчи его \
чёрной, паче же обер-камергер, граф Шереметев, носящий конец епанчи, не могши бежать \
за ним, принуждены были епанчу пустить, и как ветром её раздувало, то сие Петру III \
пуще забавно стало, и он повторял несколько раз сию штуку…»

ХАРАКТЕРИСТИКИ
1) Текст документа был написан в 1720-х гг.
2) События, описываемые в отрывке, произошли в 1760-х гг..
3) В отрывке речь идёт о похоронах Петра II.
4) Император, о котором идёт речь, издал Манифест о вольности дворянской.
5) Современником похорон, о которых идёт речь, был А.Д. Меншиков.
6) Современником описываемых событий был М.М. Сперанский.

Запиши 4 цифры ответа подряд, без пробелов
Например Если А=6,2 а Б=4,3, то ответ будет 6243"""

Q3_7 = """№7
Кто из перечисленных военачальников был участником Северной войны? Выбери \
три ответа и запиши подряд цифры, под которыми они указаны.

1) Б.П. Шереметев
2) А.Г. Орлов
3) М.Б. Шеин
4) Ф.М. Апраксин
5) М.В. Скопин-Шуйский
6) А.Д. Меншиков"""

Q3_8 = """№8
Заполни пропуски в данных предложениях, используя приведённый ниже список \
пропущенных элементов: для каждого предложения, обозначенного буквой и содержащего \
пропуск, выбери номер нужного элемента.

А) Операция «Багратион» была проведена Красной армией в ______г.
Б) В водружении Знамени Победы над рейхстагом участвовал ______.
В) В 1941 г. от фашистов был освобождён город ______.

Пропущенные элементы:
1) М.В. Кантария
2) 1944
3) Клин
4) Смоленск
5) 1943
6) М.С. Шумилов

Запиши 3 цифры ответа подряд, без пробелов
Например Если А=6, Б=2, В=4, то ответ будет 624"""

Q3_9 = """№9
Установи соответствие между событиями и участниками этих событий: к каждой \
позиции первого столбца подбери соответствующую позицию из второго столбца.

СОБЫТИЯ
А) междоусобная война в Московском государстве второй четверти XV в.
Б) Смутное время в России
В) Крымская война
Г) Гражданская война в России

УЧАСТНИКИ
1) В.А. Корнилов
2) Иван III
3) П.А. Столыпин
4) А.В. Колчак
5) Дмитрий Шемяка
6) В.И. Шуйский

Запиши 4 цифры ответа подряд, без пробелов
Например Если А=6,Б=2,В=4,Г=3, то ответ будет 6243"""

Q3_10 = """№10
Прочти отрывок из воспоминаний и укажи фамилию, дважды пропущенную в тексте.

« _________ и его ближайшее окружение и думать не хотели о расставании с властью. \
И себя, и других убеждали, что-де уход _________ нарушит установившееся равновесие, \
подорвёт стабильность. Словом, опять «незаменимый», хотя и полуживой.
Помню, как на одном из заседаний Политбюро председательствовавший потерял \
смысловую нить обсуждения. Все сделали вид, что ничего не произошло. Хотя всё это \
оставляло тяжкое впечатление. После заседания я поделился своими переживаниями \
с Андроповым.
— Знаешь, Михаил, — повторил он почти дословно то, что и раньше мне говорил, — \
надо делать всё, чтобы и в этом положении поддержать Генерального секретаря. \
Это вопрос стабильности в партии, государстве, да и вопрос международной \
стабильности»."""

Q3_11 = """№11
Даны несколько цепочек вида:
Век: Событие в России, Событие за рубежом
Некоторые значения пропущены. Необходимо заполнить их, используя предложенные варианты.

XIII в:(А), захват крестоносцами Константинополя
XIV в: начало княжения Дмитрия Донского, (Б)
(В): (Г), падение Византийской империи
(Д): учреждение опричнины, (Е)

Пропущенные элементы:
1) XVI в.
2) XV в.
3) Смоленская война
4) присоединение Новгородской земли к Московскому княжеству
5) выступление М. Лютера с 95-ю тезисами, начало Реформации в Германии
6) Жакерия во Франции
7) Невская битва
8) провозглашение Англии республикой
9) XVII в.

Запиши подряд цифры, соответствующие А, Б, В, Г, Д и Е (например 123456)"""

Q3_12 = """№12
Прочти отрывок из летописи.

«Пошёл Олег на греков, оставив Игоря в Киеве; взял же с собою множество варягов, и \
славян, и чуди, и кривичей, и мерю, и древлян, и радимичей, и полян, и северян, и \
вятичей, и хорватов, и дулебов, и тиверцев, известных как толмачи: этих всех называли \
греки “Великая Скифь”. И с этими всеми пошёл Олег на конях и в кораблях; и было \
кораблей числом 2000. И пришёл к Царьграду: греки же замкнули Суд, а город затворили. \
И вышел Олег на берег, и начал воевать...
И повелел Олег своим воинам сделать колёса и поставить на колёса корабли. И когда \
подул попутный ветер, подняли они в поле паруса и пошли к городу. Греки же, увидев \
это, испугались и сказали, послав к Олегу: “Не губи города, дадим тебе дань, какую \
захочешь”. И остановил Олег воинов, и вынесли ему пищу и вино, но не принял его, так как \
было оно отравлено. И испугались греки, и сказали: “Это не Олег, но святой Дмитрий, \
посланный на нас Богом”. И приказал Олег дать дани на 2000 кораблей: по 12 гривен на \
человека, а было в каждом корабле по 40 мужей.
И согласились на это греки, и стали греки просить мира, чтобы не воевал Греческой \
земли. Олег же, немного отойдя от столицы, начал переговоры о мире с греческими \
царями Леоном и Александром...»

Используя отрывок и знания по истории, выбери в приведённом списке три верных
суждения. Запиши подряд цифры, под которыми они указаны.

1) События, описанные в данном отрывке, произошли в 882 г.
2) Олег, о котором идёт речь в отрывке, был сыном Рюрика.
3) Летопись, в которую вошёл данный отрывок, была создана в XII в.
4) По свидетельству летописца, греки пытались отравить Олега.
5) В отрывке упомянуты названия финно-угорских племён.
6) В результате переговоров о мире Олегу не удалось заключить договора с греками."""

Q3_13 = """№13
Укажи название населённого пункта, обозначенного на схеме цифрой «1», в \
котором находился укреплённый лагерь русских войск."""

Q3_14 = """№14
Назови российского военачальника, командовавшего армией, расположение \
которой обозначено на схеме цифрой «4»."""

Q3_15 = """№15
Укажи название города, обозначенного на схеме цифрой «3»."""

Q3_16 = """№16
Какие суждения, относящиеся к ситуации, обозначенной на схеме, являются верными? \
Выбери три суждения из шести предложенных. Запиши подряд цифры, под \
которыми они указаны.

1) События, обозначенные на схеме, произошли в период правления Александра I.
2) На данной схеме обозначено отступление армии Наполеона из Москвы.
3) На схеме обозначена столица Российской империи в период, когда произошли \
события, обозначенные на схеме стрелками.
4) В сражении у населённого пункта, обозначенного на схеме цифрой «2», был \
смертельно ранен П.И. Багратион.
5) Во время войны, события которой обозначены на схеме, неприятельские войска \
осенью вступили в Москву.
6) Пунктирными стрелками на схеме обозначены действия французских войск. """

Q3_17 = """№17
Установи соответствие между памятниками культуры и их краткими \
характеристиками: к каждой позиции первого столбца подбери соответствующую \
позицию из второго столбца.

ПАМЯТНИКИ КУЛЬТУРЫ
А) «Слово о полку Игореве»
Б) картина «Боярыня Морозова»
В) парсуна князя М.В. Скопина-Шуйского
Г) роман «Тихий Дон»

ХАРАКТЕРИСТИКИ

1) Данный памятник культуры посвящён событиям XII в.
2) Автор — А.И. Солженицын.
3) Данный памятник культуры создан в XVIII в.
4) Автор — В.И. Суриков.
5) Автор — М.А. Шолохов.
6) Данный памятник культуры создан в XVII в.

Запиши подряд 4 цифры ответа - например, 1234"""

Q3_18 = """№18
Какие суждения о данной карикатуре являются верными? Выбери два суждения из \
пяти предложенных. Запиши подряд цифры, под которыми они указаны.

1) Карикатура посвящёна событиям, начавшимся во второй половине 1940-х гг.
2) Забор, изображённый на карикатуре, символизирует границу между СССР и \
странами Восточной Европы.
3) Автор карикатуры — сторонник осуществления «Плана маршала Сталина», а \
не Плана Маршалла.
4) На карикатуре отсутствуют элементы герба СССР.
5) План, название которого написано на тракторе, был разработан в США."""

Q3_19 = """№19
Строительство каких зданий было начато в том же веке, когда была создана \
данная карикатура? В ответе запиши подряд две цифры, под которыми указаны эти здания."""

Q3_20 = """№20
В общем, дальше для меня оценивать сложновато, так что тебе предстоит оценивать себя самостоятельно \
Прочти отрывок из исторического источника и кратко ответь на вопросы 20—22. До того, как решишь, \
в ответы не смотреть, иначе будет необъективно.

Из выступления императора перед представителями дворянства
«У нас существует класс людей весьма дурной, и на который я прошу вас обратить \
особенное внимание — это дворовые люди. Будучи взяты из крестьян, они отстали от \
них, не имея оседлости и не получив ни малейшего образования. Люди эти вообще развратны \
и опасны как для общества, так и для господ своих. Я вас прошу быть крайне осторожными \
в отношениях с ними. Часто, за столом или в вечерней беседе, вы рассуждаете о делах \
политических, правительственных и других, забывая, что люди эти вас слушают и по \
необразованности своей и глупости толкуют суждения ваши по-своему, т. е. \
превратно. <...> Это очень вредно!
Переходя к быту крестьян, скажу вам, что необходимо обратить особенное внимание \
на их благосостояние. Некоторые лица приписывали мне по сему предмету самые нелепые \
и безрассудные мысли и намерения. Я их отвергаю с негодованием. Когда я издал указ \
об обязанных крестьянах, то объявил, что вся без исключения земля принадлежит \
дворянину-помещику. Это вещь святая и никто к ней прикасаться не может. Но я должен \
сказать с прискорбием, что у нас весьма мало хороших и попечительных помещиков, \
много посредственных и ещё более худых, а при духе времени, кроме предписаний совести \
и закона, вы должны для собственного своего интереса заботиться о благосостоянии \
вверенных вам людей и стараться всеми силами снискать их любовь и уважение. Ежели \
окажется среди вас помещик безнравственный или жестокий, вы обязаны предать его \
силе закона. Некоторые русские журналы дозволили себе напечатать статьи, \
возбуждающие крестьян против помещиков и вообще неблаговидные, но я принял меры \
и этого впредь не будет.
Господа! У меня полиции нет, я не люблю её: вы моя полиция. Каждый из вас мой \
управляющий и должен для спокойствия государства доводить до моего сведения все \
дурные действия и поступки, какие он заметит. Если и в моих имениях вы усмотрите \
притеснения и беспорядки, то убедительно прошу вас, не жалея никого, немедленно \
мне о том доносить. Будем идти дружною стопою, будем действовать единодушно и \
мы будем непобедимы».

Назови императора — автора данного выступления. Укажи десятилетие начала \
его правления. Укажи название войны, в которой участвовала Россия во время \
окончания правления этого императора.

После выполнения посмотри ответы, поставь себе оценку (от 0 до 2) и пришли мне сообщением."""

Q3_21 = """№21
Из выступления императора перед представителями дворянства
«У нас существует класс людей весьма дурной, и на который я прошу вас обратить \
особенное внимание — это дворовые люди. Будучи взяты из крестьян, они отстали от \
них, не имея оседлости и не получив ни малейшего образования. Люди эти вообще развратны \
и опасны как для общества, так и для господ своих. Я вас прошу быть крайне осторожными \
в отношениях с ними. Часто, за столом или в вечерней беседе, вы рассуждаете о делах \
политических, правительственных и других, забывая, что люди эти вас слушают и по \
необразованности своей и глупости толкуют суждения ваши по-своему, т. е. \
превратно. <...> Это очень вредно!
Переходя к быту крестьян, скажу вам, что необходимо обратить особенное внимание \
на их благосостояние. Некоторые лица приписывали мне по сему предмету самые нелепые \
и безрассудные мысли и намерения. Я их отвергаю с негодованием. Когда я издал указ \
об обязанных крестьянах, то объявил, что вся без исключения земля принадлежит \
дворянину-помещику. Это вещь святая и никто к ней прикасаться не может. Но я должен \
сказать с прискорбием, что у нас весьма мало хороших и попечительных помещиков, \
много посредственных и ещё более худых, а при духе времени, кроме предписаний совести \
и закона, вы должны для собственного своего интереса заботиться о благосостоянии \
вверенных вам людей и стараться всеми силами снискать их любовь и уважение. Ежели \
окажется среди вас помещик безнравственный или жестокий, вы обязаны предать его \
силе закона. Некоторые русские журналы дозволили себе напечатать статьи, \
возбуждающие крестьян против помещиков и вообще неблаговидные, но я принял меры \
и этого впредь не будет.
Господа! У меня полиции нет, я не люблю её: вы моя полиция. Каждый из вас мой \
управляющий и должен для спокойствия государства доводить до моего сведения все \
дурные действия и поступки, какие он заметит. Если и в моих имениях вы усмотрите \
притеснения и беспорядки, то убедительно прошу вас, не жалея никого, немедленно \
мне о том доносить. Будем идти дружною стопою, будем действовать единодушно и \
мы будем непобедимы».

Укажи три просьбы императора к представителям дворянства, приведённые \
в данном отрывке.
После выполнения посмотри ответы, поставь себе оценку (от 0 до 2) и пришли мне сообщением."""

Q3_22 = """№22
Из выступления императора перед представителями дворянства
«У нас существует класс людей весьма дурной, и на который я прошу вас обратить \
особенное внимание — это дворовые люди. Будучи взяты из крестьян, они отстали от \
них, не имея оседлости и не получив ни малейшего образования. Люди эти вообще развратны \
и опасны как для общества, так и для господ своих. Я вас прошу быть крайне осторожными \
в отношениях с ними. Часто, за столом или в вечерней беседе, вы рассуждаете о делах \
политических, правительственных и других, забывая, что люди эти вас слушают и по \
необразованности своей и глупости толкуют суждения ваши по-своему, т. е. \
превратно. <...> Это очень вредно!
Переходя к быту крестьян, скажу вам, что необходимо обратить особенное внимание \
на их благосостояние. Некоторые лица приписывали мне по сему предмету самые нелепые \
и безрассудные мысли и намерения. Я их отвергаю с негодованием. Когда я издал указ \
об обязанных крестьянах, то объявил, что вся без исключения земля принадлежит \
дворянину-помещику. Это вещь святая и никто к ней прикасаться не может. Но я должен \
сказать с прискорбием, что у нас весьма мало хороших и попечительных помещиков, \
много посредственных и ещё более худых, а при духе времени, кроме предписаний совести \
и закона, вы должны для собственного своего интереса заботиться о благосостоянии \
вверенных вам людей и стараться всеми силами снискать их любовь и уважение. Ежели \
окажется среди вас помещик безнравственный или жестокий, вы обязаны предать его \
силе закона. Некоторые русские журналы дозволили себе напечатать статьи, \
возбуждающие крестьян против помещиков и вообще неблаговидные, но я принял меры \
и этого впредь не будет.
Господа! У меня полиции нет, я не люблю её: вы моя полиция. Каждый из вас мой \
управляющий и должен для спокойствия государства доводить до моего сведения все \
дурные действия и поступки, какие он заметит. Если и в моих имениях вы усмотрите \
притеснения и беспорядки, то убедительно прошу вас, не жалея никого, немедленно \
мне о том доносить. Будем идти дружною стопою, будем действовать единодушно и \
мы будем непобедимы».

Укажи любые три, не названные в данном отрывке, меры, предпринятые в период \
правления императора — автора данного выступления — для улучшения положения крестьян.
После выполнения посмотри ответы, поставь себе оценку (от 0 до 2) и пришли мне сообщением."""

Q3_23 = """№23
2 марта 1930 г. в газете «Правда» была напечатана статья И.В. Сталина «Головокружение \
от успехов». После этого политика властей в деревне значительно изменилась.
Укажи причину появления данной статьи в газете «Правда». Укажи любые два \
последствия появления статьи.
После выполнения посмотри ответы, поставь себе оценку (от 0 до 3) и пришли мне сообщением."""

Q3_24 = """№24
В исторической науке существуют дискуссионные проблемы, по которым высказываются \
различные, часто противоречивые, точки зрения. Ниже приведена одна из спорных \
точек зрения, существующих в исторической науке.
«Деятельность Екатерины II, связанную с созывом Уложенной комиссии, следует \
признать неудачной».
Используя исторические знания, приведи два аргумента, которыми можно подтвердить \
данную точку зрения, и два аргумента, которыми можно опровергнуть её. При \
изложении аргументов обязательно используй исторические факты.
Ответ запиши в следующем виде.

Аргументы в подтверждение:
1) ...
2) ...

Аргументы в опровержение:
1) ...
2) ...

После выполнения посмотри ответы, поставь себе оценку (от 0 до 4) и пришли мне сообщением."""

Q3_25 = """№25
Тебе необходимо написать историческое сочинение об ОДНОМ из периодов истории России:
1) 1132–1236 гг.; 2) ноябрь 1796 г. – март 1801 г.; 3) март 1921 г. – октябрь 1928 г.
В сочинении необходимо:
— указать не менее двух значимых событий (явлений, процессов), относящихся к \
данному периоду истории;
— назвать две исторические личности, деятельность которых связана с указанными \
событиями (явлениями, процессами), и, используя знание исторических фактов, \
охарактеризовать роли названных тобой личностей в этих событиях (явлениях, \
процессах);
— указать не менее двух причинно-следственных связей, характеризующих причины \
возникновения событий (явлений, процессов), происходивших в данный период;
— используя знание исторических фактов и (или) мнений историков, оценить влияние \
событий (явлений, процессов) данного периода на дальнейшую историю России.
Внимание!
При характеристике роли каждой названной тобой личности необходимо указать \
конкретные действия этой личности, в значительной степени повлиявшие на ход \
и (или) результат указанных событий (процессов, явлений).
В ходе изложения необходимо корректно использовать исторические термины, \
понятия, относящиеся к данному периоду.

После выполнения посмотри ответы, поставь себе оценку (от 0 до 11) и пришли мне сообщением."""

otvet3_20 = '''Правильный ответ должен содержать следующие элементы:
1) император — Николай I;
2) десятилетие — 1820-е гг.;
3) война — Крымская война

Правильно указаны император, десятилетие и война - 2 БАЛЛА
Правильно указаны любые два элемента ответа - 1 БАЛЛ
Правильно указан любой один элемент ответа.
ИЛИ Ответ неправильный - 0 БАЛЛОВ'''

otvet3_21 = '''Могут быть указаны просьбы:
— быть осторожнее с дворовыми людьми, не вести при них разговоров о политических делах;
— заботиться о благосостоянии крепостных крестьян и стараться всеми силами снискать \
их любовь и уважение;
— «предавать силе закона» безнравственных или жестоких помещиков;
— сообщать императору о притеснениях и беспорядках в императорских имениях

Правильно указаны три просьбы - 2 БАЛЛА
Правильно указаны две просьбы - 1 БАЛЛ
Правильно указана одна просьба.
ИЛИ Ответ неправильный - 0 БАЛЛОВ'''

otvet3_22 = '''Могут быть указаны следующие меры:
1) запрет для помещиков продавать крестьян без земли или одну землю без крестьян;
2) запрет отдавать крестьян на заводы;
3) запрет продавать крестьян с публичного торга с раздроблением семейств;
4) запрет передавать крестьян в дворовые, отбирая у них наделы;
5) ограничение права помещиков ссылать крестьян в Сибирь по своему усмотрению;
6) запрещение покупать крестьян без земли;
7) создание «секретных комитетов» для решения крестьянского вопроса;
8) предоставление крестьянам имений, продающихся с публичных торгов за долги, \
права выкупать себя с землёй;
9) предоставление помещичьим крестьянам права покупать землю;
10) учреждение Министерства государственных имуществ и его местных органов, на \
которые было возложено «попечительство» над государственными крестьянами;
11) создание системы самоуправления для государственных крестьян;
12) ликвидация барщинных повинностей государственных крестьян в Литве, \
Белоруссии и Правобережной Украине;
13) наделение землёй и переселение безземельных и малоземельных государственных крестьян;
14) создание в государственной деревне школ, медицинских и ветеринарных пунктов.
Могут быть указаны другие меры

Правильно указаны три меры - 2 БАЛЛА
Правильно указаны две меры - 1 БАЛЛ
Правильно указана одна мера.
ИЛИ Ответ неправильный - 0 БАЛЛОВ'''

otvet3_23 = '''Правильный ответ должен содержать следующие элементы:
1) причина: массовое недовольство крестьян политикой сплошной коллективизации;
2) последствия, например:
— был осуждён ряд низовых работников, допустивших «перегибы» при создании колхозов;
— сплошная коллективизация была на время приостановлена;
— начался массовый отток крестьян из колхозов.
Могут быть указаны другие последствия

Правильно указаны причина и два последствия - 3 БАЛЛА
Правильно указаны причина и одно последствие.
ИЛИ Правильно указаны только два последствия - 2 БАЛЛА
Правильно указана только причина.
ИЛИ Правильно указано только одно последствие - 1 БАЛЛ
Приведены рассуждения общего характера, не соответствующие требованию задания.
ИЛИ Ответ неправильный - 0 БАЛЛОВ'''

otvet3_24 = '''Правильный ответ должен содержать аргументы:
1) в подтверждение, например:
— Уложенная комиссия оказалась слишком громоздким учреждением для решения такой \
задачи, как выработка Уложения (в ней присутствовали представители различных \
сословий, интересы которых зачастую противоречили друг другу);
— Уложенная комиссия состояла из людей, которые, в силу слабой юридической \
подготовки, не могли справиться с поставленной перед ними задачей;
— «Наказ», написанный Екатериной II к созыву комиссии, был противоречив по содержанию \
(например, говорилось, что «равенство граждан всех состоит в том, чтобы все подвержены \
были тем же законам», но в то же время в «Наказе» говорилось о сословных правах и обязанностях);
— некоторые иностранные наблюдатели дали негативную оценку комиссии (французский посол назвал \
работу комиссии комедией), что не способствовало международному авторитету России;
2) в опровержение, например:
— созыв Уложенной комиссии помог Екатерине II выявить наиболее острые проблемы страны, которые \
необходимо было решать (этот материал содержался в наказах депутатам и их выступлениях);
— деятельность Уложенной комиссии, а также периодические издания «Наказа» Екатерины II \
способствовали распространению в России идей французского Просвещения;
— созыв Уложенной комиссии способствовал росту авторитета Екатерины II в обществе и, \
главное, укреплению её положения на троне (в этот период ей необходимо было \
опровергнуть репутацию узурпатора власти).
Могут быть приведены другие аргументы

Приведены два аргумента в подтверждение и два в опровержение оценки - 4 БАЛЛА
Приведены два аргумента в подтверждение и один в опровержение оценки.
ИЛИ Приведены один аргумент в подтверждение и два в опровержение оценки - 3 БАЛЛА
Приведены один аргумент в подтверждение и один в опровержение оценки - 2 БАЛЛА
Приведены только два аргумента в подтверждение оценки.
ИЛИ Приведены только два аргумента в опровержение оценки - 1 БАЛЛ
Приведён только один любой аргумент.
ИЛИ Приведены только факты, иллюстрирующие события (явления, процессы), связанные с данной \
точкой зрения, но не являющиеся аргументами.
ИЛИ Приведены рассуждения общего характера, не соответствующие требованию задания.
ИЛИ Ответ неправильный - 0 БАЛЛОВ'''


                    #Четвёртый вариант
Q4_1 = """№1
Расположи в хронологической последовательности исторические события. Запиши\
цифры, которыми обозначены исторические события, в правильной последовательности, \
без пробелов (Например 123).


1) разгром Золотой Орды Тимуром
2) Чесменское сражение
3) «Славная революция» в Англии """

Q4_2 = """№2
Установи соответствие между событиями и годами: к каждой позиции первого \
столбца подбери соответствующую позицию из второго столбца.

СОБЫТИЯ
А) учреждение в России патриаршества
Б) издание Жалованной грамоты дворянству и городам
В) антиордынское восстание в Твери
Г) начало Второй мировой войны

ГОДЫ
1) 1237 г.
2) 1327 г.
3) 1589 г.
4) 1785 г.
5) 1914 г.
6) 1939 г.

Запиши 4 цифры ответа подряд, без пробелов
Например Если А=6,Б=2,В=4,Г=3, то ответ будет 6243"""

Q4_3 = """№3
Ниже приведён список терминов. Все они, за исключением двух, относятся к \
событиям, явлениям периода «перестройки» в СССР.

1) «новоогарёвский процесс»; 2) гласность; 3) «война законов»; \
4) приватизационный чек; 5) референдум; 6) дефолт.

Найди и запиши порядковые номера терминов, относящихся к другому \
историческому периоду."""

Q4_4 = """№4
Запиши термин, о котором идёт речь.

Название слоя зажиточных крестьян, сложившегося в результате социальной \
дифференциации. В начале XX в. представителям этого слоя принадлежало около 20% \
крестьянских хозяйств, в 1913 г. они производили 50% товарного хлеба. В СССР этот \
слой крестьян был ликвидирован в ходе коллективизации путём насильственного изъятия \
имущества и высылки семей, принадлежавших к этому общественному слою, в отдалённые \
районы страны."""

Q4_5 = """№5
Установи соответствие между процессами (явлениями, событиями) и фактами, \
относящимися к этим процессам (явлениям, событиям): к каждой позиции первого столбца \
подбери соответствующую позицию из второго столбца.

ПРОЦЕССЫ (ЯВЛЕНИЯ, СОБЫТИЯ)
А) политика московских князей по отношению к Орде в XIV в.
Б) Ливонская война
В) русско-турецкая война 1877–1878 гг.
Г) Великая Отечественная война

ФАКТЫ
1) танковое сражение под Про
хоровкой
2) Куликовская битва
3) Карибский кризис
4) осада Плевны
5) стояние на Угре
6) осада Пскова войском Стефана Батория

Запиши 4 цифры ответа подряд, без пробелов
Например Если А=6,Б=2,В=4,Г=3, то ответ будет 6243"""

Q4_6 = """№6
Установи соответствие между фрагментами исторических источников и их краткими \
характеристиками: к каждому фрагменту, обозначенному буквой, подбери по две \
соответствующие характеристики, обозначенные цифрами.

ФРАГМЕНТЫ ИСТОЧНИКОВ
А)  «Когда все успокоились, Борис приступил к осуществлению своего намерения, \
совещаясь со своими друзьями и родственниками, которых было до 70 домов, а именно: \
Годуновы, над которыми Борис был главою, хотя некоторые из них были старше его, \
Вельяминовы и Сабуровы — два рода, прозванные так; с ними он каждодневно \
советовался, как достичь короны; прежде же всего необходимо было избавиться от \
юного царевича Дмитрия, ибо весьма опасались, что удобное время упущено, ибо \
Дмитрию было десять лет и по своему возрасту он был очень умён, часто говоря: \
“Плохой какой царь, мой брат. Он не способен управлять таким царством”, и нередко \
спрашивал, что за человек Борис Годунов, державший в своих руках всё управление \
государством, говоря при этом: “Я сам хочу ехать в Москву, хочу видеть, как там \
идут дела, ибо предвижу дурной конец, если будут столь доверять недостойным \
дворянам, поэтому надо позаботиться заблаговременно”».
Б) «Преставился великий князь русский Ярослав. Ещё при жизни дал он наставление \
сыновьям своим, сказав им: "Вот я покидаю мир этот, а вы, сыновья мои, имейте любовь \
между собой, потому что все вы братья, от одного отца и от одной матери. И если \
будете жить в любви между собой, Бог будет с вами и покорит вам врагов. И будете \
жить в мире. Если же будете в ненависти жить, в распрях и ссорах, то погибнете \
сами и погубите землю отцов своих и дедов, которые добыли её трудом своим великим; \
но слушайтесь брат брата, живите мирно. Вот я поручаю престол мой в Киеве старшему \
сыну моему и брату вашему Изяславу; слушайтесь его, как слушались меня, пусть \
будет он вам вместо меня; а Святославу даю Чернигов, а Всеволоду Переяславль, \
а Вячеславу Смоленск"».

ХАРАКТЕРИСТИКИ
1) Описываемые события произошли в XVI в.
2) Описываемые события произошли в XVII в.
3) Один из исторических деятелей, упомянутых в отрывке, был избран на царство \
Земским собором.
4) Описываемые события произошли в XI в.
5) Царевич, о котором идёт речь в отрывке, впоследствии стал царём.
6) Один из исторических деятелей, упомянутых в отрывке, прославился разгромом \
печенегов под Киевом.

Запиши 4 цифры ответа подряд, без пробелов
Например Если А=6,2 а Б=4,3, то ответ будет 6243"""

Q4_7 = """№7
Какие из перечисленных городов вошли в состав России в XVIII в.? Выбери три \
ответа и запиши подряд цифры, под которыми они указаны.
1) Киев 
2) Керчь 
3) Минск 
4) Смоленск
5) Нарва
6) Варшава"""

Q4_8 = """№8
Заполни пропуски в данных предложениях, используя приведённый ниже список \
пропущенных элементов: для каждого предложения, обозначенного буквой и содержащего \
пропуск, выбери номер нужного элемента.

А) В 1945 г. состоялась ______ конференция Большой тройки.
Б) Пионер-герой, юный партизан-разведчик, самый молодой Герой Советского Союза — ______.
В) Совет по эвакуации был создан в ______ 1941 г.

Пропущенные элементы:
1) В.А. Котик
2) декабрь
3) Тегеранская
4) Д.Г. Павлов
5) июнь
6) Ялтинская

Запиши 3 цифры ответа подряд, без пробелов
Например Если А=6, Б=2, В=4, то ответ будет 624"""

Q4_9 = """№9
Установи соответствие между событиями и участниками этих событий: к каждой \
позиции первого столбца подбери соответствующую позицию из второго столбца.

СОБЫТИЯ
А) первое упоминание Москвы в летописи
Б) опричнина
В) внутренняя политика Александра I
Г) «перестройка» в СССР

УЧАСТНИКИ
1) Малюта Скуратов
2) А.Н. Косыгин
3) Владимир Мономах
4) А.А. Аракчеев
5) Юрий Долгорукий
6) М.С. Горбачёв

Запиши 4 цифры ответа подряд, без пробелов
Например Если А=6,Б=2,В=4,Г=3, то ответ будет 6243"""

Q4_10 = """№10
Прочти отрывок из Программы КПСС и укажи фамилию руководителя СССР в \
период принятия этой программы.

«...В итоге второго десятилетия (1971—1980 годы) будет создана материально-техническая \
база коммунизма, обеспечивающая изобилие материальных и культурных благ для всего \
населения; советское общество вплотную подойдёт к осуществлению принципа распределения \
по потребностям, произойдёт постепенный переход к единой общенародной собственности. \
Таким образом, в СССР будет в основном построено коммунистическое общество...»"""

Q4_11 = """№11
Даны несколько цепочек вида:
Век: Событие в России, Событие за рубежом
Некоторые значения пропущены. Необходимо заполнить их, используя предложенные варианты.

(А): (Б), гуситские войны
XVI в: присоединение Рязанского княжества к Московскому государству, (В)
XVIII в: (Г), (Д)
(Е)
: издание «Положения о мерах к охранению государственного порядка и \
общественного спокойствия», провозглашение доктрины Монро в США

Пропущенные элементы:
1) XVII в.
2) вступление на престол Елизаветы Петровны
3) принятие английским парламентом «Великой ремонстрации»
4) «Бостонское чаепитие» в США
5) Нантский эдикт Генриха IV во Франции
6) XV в.
7) Медный бунт
8) XIX в.
9) начало княжения Василия II

Запиши подряд цифры, соответствующие А, Б, В, Г, Д и Е (например 123456)"""

Q4_12 = """№12
Прочти отрывок из обращения Полномочной комиссии ВЦИК к населению \
Тамбовской губернии.

«Ко всему населению Тамбовской губернии.
Надежды наших врагов не оправдались. Нападение на красный Петроград отбито, \
враг раздавлен у самых его ворот, в Кронштадте. Большинство рабочих и матросов \
Кронштадта, увидя, куда их заводят провокаторы-эсеры и белогвардейцы, опомнились \
и помогли изнутри нашей наступавшей Красной Армии покончить с подлой затеей. И \
Кронштадт вновь поднял советское знамя.
Перед лицом всех наших врагов и наших друзей подтверждена несокрушимая сила \
Советской власти.
Граждане! Пора и нам в Тамбовской губернии покончить с эсеро-бандитизмом. Наша \
губерния и без того отощала за время войны и неурожая, ей нужен твёрдый внутренний \
порядок, ей нужен спокойный дружный труд. Все честные граждане обязаны помочь \
Советской власти восстановить этот порядок.
С 21 марта по 5 апреля в уездах, охваченных бандитским движением, проводится \
добровольная явка участников белых шаек. Добровольно явившиеся с оружием будут \
прощены.
Граждане! Содействуйте успеху этого начинания. Разъясняйте тем, кто вовлечён \
своим неразумием или обманом в разбойное дело, весь его вред для трудового народа. \
Разъясняйте, что Советская власть милостива к заблудшим труженикам и сурова только \
к несознательным врагам народа. С бандитизмом надо покончить немедля и решительно. \
Надо дать возможность трудовому крестьянству свободно приняться за полевые работы. \
Надо также избавить крестьянство скорее от обременительного постоя красных войск. \
Теперь по постановлению Всероссийского съезда Советов проводится широкая кампания \
всемерной помощи крестьянскому сельскому хозяйству. Теперь по решению партии \
коммунистов разрабатывается закон о замене продовольственных развёрсток \
продовольственным налогом».

Используя отрывок и знания по истории, выбери в приведённом списке три \
верных суждения. Запиши подряд, под которыми они указаны.
1) Данное обращение написано в 1921 г.
2) Одним из руководителей восстания, против которого направлено данное \
обращение, был Н.И. Махно.
3) Данное обращение появилось в год, когда произошёл переход к политике \
«военного коммунизма».
4) Авторы обращения обещают прощение добровольно сдавшимся участникам восстания.
5) Во время событий в Кронштадте, о которых упоминается в отрывке, \
не было погибших.
6) Авторы обращения считают, что восстание организовано представителями \
социалистической партии."""

Q4_13 = """№13
Заполни пропуск в предложении: «Окончание строительства и открытие движения \
по железной дороге, обозначенной на схеме буквой «А», относится к тысяча восемьсот \
______ годам». Ответ запиши словом.
"""

Q4_14 = """№14
Назови императора, в период правления которого в состав Российской империи
вошла территория, обозначенная на схеме цифрой «3».
"""

Q4_15 = """№15
Укажи территорию, обозначенную на схеме цифрой «1»."""

Q4_16 = """№16
Какие суждения, относящиеся к ситуации, обозначенной на схеме, являются верными? \
Выбери три суждения из шести предложенных. Запиши подряд цифры, под \
которыми они указаны.

1) Наибольшее число металлургических предприятий страны в период, которому \
посвящена схема, находилось на Урале.
2) На схеме обозначена территория государства, с которым Россия в 1855 г. \
подписала Симодский договор.
3) Территория, обозначенная на схеме цифрой «1», вошла в состав России после \
Отечественной войны 1812 г.
4) Территории, обозначенной на схеме цифрой «2», российский император даровал \
конституцию.
5) Все территории, заштрихованные на схеме, вошли в состав России в период \
правления одного и того же императора.
6) На схеме обозначена территория государства, с которым Россия подписала \
Фридрихсгамский мирный договор.
"""

Q4_17 = """№17
Установи соответствие между памятниками культуры и их краткими характеристиками: \
к каждой позиции первого столбца подбери соответствующую позицию из второго столбца.

ПАМЯТНИКИ КУЛЬТУРЫ
А) картина «Последний день Помпеи»
Б) музыка к песне «Моя Москва» («Дорогая моя столица»)
В) «Слово о Законе и Благодати»
Г) «Синопсис» Иннокентия Гизеля

ХАРАКТЕРИСТИКИ
1) Данный памятник культуры посвящён событиям, произошедшим до начала новой эры.
2) Автор — И.О. Дунаевский.
3) Данный памятник культуры создан в XV в.
4) Данный памятник культуры создан в XVII в.
5) Автор — В.В. Маяковский.
6) Автор — митрополит Иларион.

Запиши подряд 4 цифры ответа - например, 1234
"""

Q4_18 = """№18
Какие суждения о данной марке являются верными? Выбери два суждения из пяти \
предложенных. Запиши подряд цифры, под которыми они указаны.

1) Первые по времени обнаружения грамоты, одна из которых изображена на марке, \
найдены археологами на территории Киева.
2) Материал для письма, использованный при составлении данной грамоты, был \
значительно дешевле пергамена.
3) На грамотах, одна из которых изображена на марке, писали только официальные \
документы, исходящие от князя.
4) Город, где археологами обнаружено наибольшее количество грамот, одна из \
которых изображена на марке, был присоединён к Московскому княжеству в XIV в.
5) В городе, где археологами обнаружено наибольшее количество грамот, одна из \
которых изображена на марке, княжил Александр Невский.

"""

Q4_19 = """№19
Какие из данных памятников архитектуры находятся в городе, где археологами обнаружено \
наибольшее количество грамот, одна из которых изображена на марке? В ответе \
запиши подряд две цифры, под которыми указаны эти памятники архитектуры."""

Q4_20 = """№20
В общем, дальше для меня оценивать сложновато, так что тебе предстоит оценивать себя самостоятельно \
Прочти отрывок из исторического источника и кратко ответь на вопросы 20—22. До того, как решишь, \
в ответы не смотреть, иначе будет необъективно.

Из некролога
«В тяжёлый для России час вступил в Бозе почивший Государь на престол. Царствование, \
ознаменовавшееся великими реформами, закончилось трагическою смертью их виновника. \
Монарх, отменивший крепостное право, обновивший суд, даровавший земские учреждения, \
погиб насильственною смертью <...>
Но, даже независимо от постигшей Царя-Освободителя мученической смерти, многие явления \
в народной жизни заставляли людей, преданных благу родины, глубоко призадуматься. \
Злополучное польское восстание <...> недовольство, постоянно сквозившее в печати, \
целый ряд политических преступлений вместе с другими менее яркими признаками не \
прекращавшегося протеста, представляли собою весьма прискорбный для всех благомыслящих \
людей ответ на великие реформы Царя-Освободителя. Трагизм нашей общественной и \
государственной жизни состоял в том, что, по общему убеждению, русский народ и \
русское общество не могли дать такого ответа; напротив, они до глубины души сознавали \
плодотворность этих реформ, и тем не менее выходило так, как будто они если не \
вызывали указанного отрицательного явления, то по меньшей мере своим бездействием \
способствовали его развитию и распространению.
<...> Действительно, получалось какоето странное, почти загадочное явление. Во все \
моменты русской истории, когда государству приходилось совершать какое-нибудь \
крупное дело: отразить внешнего неприятеля, справиться с внутреннею смутою, сделать \
крупный шаг на пути дальнейшего культурного развития, неизменно происходил подъём \
земских сил, и, благодаря этому единодушию, достигались изумительные результаты. \
Вспомним Смутное время, вспомним Петра Великого, царствование Екатерины II и \
Александра I. И вдруг, оказывалось совсем иное. Правда, приступ к великим реформам \
Царя-Освободителя сопровождался сильным подъёмом общественного самосознания, и \
важнейшая из этих реформ, отмена крепостного права, именно благодаря этому \
обстоятельству, могла совершиться без всяких внутренних потрясений, с успехом, \
поразившим весь цивилизованный мир. Но эта реформа была только началом целого ряда \
других реформ, и что же мы видим? Число недовольных всё увеличивалось, настроение \
общества не только не благоприятствовало этим реформам, но вызывало даже сомнения \
в их плодотворности. Крайние элементы уже не ограничивались словами, а перешли к \
действиям, и дело кончилось катастрофой 1го марта.
При таких-то условиях вступил покойный Государь на престол».

Назови императора, на смерть которого написан данный некролог. Укажи год, \
когда был написан этот некролог. Укажи десятилетие, когда началась реализация \
реформ, о которых говорится в первом абзаце отрывка.
После выполнения посмотри ответы, поставь себе оценку (от 0 до 2) и пришли мне сообщением."""

Q4_21 = """№21
Из некролога
«В тяжёлый для России час вступил в Бозе почивший Государь на престол. Царствование, \
ознаменовавшееся великими реформами, закончилось трагическою смертью их виновника. \
Монарх, отменивший крепостное право, обновивший суд, даровавший земские учреждения, \
погиб насильственною смертью <...>
Но, даже независимо от постигшей Царя-Освободителя мученической смерти, многие явления \
в народной жизни заставляли людей, преданных благу родины, глубоко призадуматься. \
Злополучное польское восстание <...> недовольство, постоянно сквозившее в печати, \
целый ряд политических преступлений вместе с другими менее яркими признаками не \
прекращавшегося протеста, представляли собою весьма прискорбный для всех благомыслящих \
людей ответ на великие реформы Царя-Освободителя. Трагизм нашей общественной и \
государственной жизни состоял в том, что, по общему убеждению, русский народ и \
русское общество не могли дать такого ответа; напротив, они до глубины души сознавали \
плодотворность этих реформ, и тем не менее выходило так, как будто они если не \
вызывали указанного отрицательного явления, то по меньшей мере своим бездействием \
способствовали его развитию и распространению.
<...> Действительно, получалось какоето странное, почти загадочное явление. Во все \
моменты русской истории, когда государству приходилось совершать какое-нибудь \
крупное дело: отразить внешнего неприятеля, справиться с внутреннею смутою, сделать \
крупный шаг на пути дальнейшего культурного развития, неизменно происходил подъём \
земских сил, и, благодаря этому единодушию, достигались изумительные результаты. \
Вспомним Смутное время, вспомним Петра Великого, царствование Екатерины II и \
Александра I. И вдруг, оказывалось совсем иное. Правда, приступ к великим реформам \
Царя-Освободителя сопровождался сильным подъёмом общественного самосознания, и \
важнейшая из этих реформ, отмена крепостного права, именно благодаря этому \
обстоятельству, могла совершиться без всяких внутренних потрясений, с успехом, \
поразившим весь цивилизованный мир. Но эта реформа была только началом целого ряда \
других реформ, и что же мы видим? Число недовольных всё увеличивалось, настроение \
общества не только не благоприятствовало этим реформам, но вызывало даже сомнения \
в их плодотворности. Крайние элементы уже не ограничивались словами, а перешли к \
действиям, и дело кончилось катастрофой 1го марта.
При таких-то условиях вступил покойный Государь на престол».

Укажи любую одну из Великих реформ, которые называет автор в данном отрывке. \
В чём, по мнению автора, состояла противоречивость в отношении российского общества \
к Великим реформам? Какой фактор, по мнению автора, во все предшествующие Великим \
реформам периоды истории помогал России достигать положительных результатов?
После выполнения посмотри ответы, поставь себе оценку (от 0 до 2) и пришли мне сообщением."""

Q4_22 = """№22
Из некролога
«В тяжёлый для России час вступил в Бозе почивший Государь на престол. Царствование, \
ознаменовавшееся великими реформами, закончилось трагическою смертью их виновника. \
Монарх, отменивший крепостное право, обновивший суд, даровавший земские учреждения, \
погиб насильственною смертью <...>
Но, даже независимо от постигшей Царя-Освободителя мученической смерти, многие явления \
в народной жизни заставляли людей, преданных благу родины, глубоко призадуматься. \
Злополучное польское восстание <...> недовольство, постоянно сквозившее в печати, \
целый ряд политических преступлений вместе с другими менее яркими признаками не \
прекращавшегося протеста, представляли собою весьма прискорбный для всех благомыслящих \
людей ответ на великие реформы Царя-Освободителя. Трагизм нашей общественной и \
государственной жизни состоял в том, что, по общему убеждению, русский народ и \
русское общество не могли дать такого ответа; напротив, они до глубины души сознавали \
плодотворность этих реформ, и тем не менее выходило так, как будто они если не \
вызывали указанного отрицательного явления, то по меньшей мере своим бездействием \
способствовали его развитию и распространению.
<...> Действительно, получалось какоето странное, почти загадочное явление. Во все \
моменты русской истории, когда государству приходилось совершать какое-нибудь \
крупное дело: отразить внешнего неприятеля, справиться с внутреннею смутою, сделать \
крупный шаг на пути дальнейшего культурного развития, неизменно происходил подъём \
земских сил, и, благодаря этому единодушию, достигались изумительные результаты. \
Вспомним Смутное время, вспомним Петра Великого, царствование Екатерины II и \
Александра I. И вдруг, оказывалось совсем иное. Правда, приступ к великим реформам \
Царя-Освободителя сопровождался сильным подъёмом общественного самосознания, и \
важнейшая из этих реформ, отмена крепостного права, именно благодаря этому \
обстоятельству, могла совершиться без всяких внутренних потрясений, с успехом, \
поразившим весь цивилизованный мир. Но эта реформа была только началом целого ряда \
других реформ, и что же мы видим? Число недовольных всё увеличивалось, настроение \
общества не только не благоприятствовало этим реформам, но вызывало даже сомнения \
в их плодотворности. Крайние элементы уже не ограничивались словами, а перешли к \
действиям, и дело кончилось катастрофой 1го марта.
При таких-то условиях вступил покойный Государь на престол».

Укажи любые три внутриполитические меры консервативного (реакционного) \
характера, предпринятые в период правления императора, по случаю смерти которого \
написан данный некролог.
После выполнения посмотри ответы, поставь себе оценку (от 0 до 2) и пришли мне сообщением."""

Q4_23 = """№23
Бывший министр-председатель Временного правительства А.Ф. Керенский, находясь \
в эмиграции, однажды заявил, что для недопущения большевиков к власти надо было \
расстрелять одного человека — Керенского. Этим он признал свою вину в том, что \
Временное правительство было свергнуто. Объясни, как деятельность А.Ф. Керенского \
на посту главы Временного правительства способствовала приходу большевиков к власти \
(приведи любые три объяснения).

После выполнения посмотри ответы, поставь себе оценку (от 0 до 3) и пришли мне сообщением."""

Q4_24 = """№24
В исторической науке существуют дискуссионные проблемы, по которым высказываются \
различные, часто противоречивые, точки зрения. Ниже приведена одна из спорных \
точек зрения, существующих в исторической науке.
«Следствием Смутного времени в России стали существенные изменения в управлении страной».
Используя исторические знания, приведи два аргумента, которыми можно подтвердить \
данную точку зрения, и два аргумента, которыми можно опровергнуть её. При изложении \
аргументов обязательно используй исторические факты.

Ответ запиши в следующем виде.

Аргументы в подтверждение:
1) ...
2) ...

Аргументы в опровержение:
1) ...
2) ...

После выполнения посмотри ответы, поставь себе оценку (от 0 до 4) и пришли мне сообщением."""

Q4_25 = """№25
Тебе необходимо написать историческое сочинение об ОДНОМ из периодов истории России:
1) 945–972 гг.; 2) сентябрь 1689 г. – январь 1725 г.; 3) ноябрь 1942 г. – декабрь 1943 г.
В сочинении необходимо:
— указать не менее двух значимых событий (явлений, процессов), относящихся \
к данному периоду истории;
— назвать две исторические личности, деятельность которых связана с указанными \
событиями (явлениями, процессами), и, используя знание исторических фактов, \
охарактеризовать роли названных  тобой личностей в этих событиях (явлениях, \
процессах);
— указать не менее двух причинно-следственных связей, характеризующих причины \
возникновения событий (явлений, процессов), происходивших в данный период;
— используя знание исторических фактов и (или) мнений историков, оценить \
влияние событий (явлений, процессов) данного периода на дальнейшую историю России.
Внимание!
При характеристике роли каждой названной тобой личности необходимо указать \
конкретные действия этой личности, в значительной степени повлиявшие на ход \
и (или) результат указанных событий (процессов, явлений).
В ходе изложения необходимо корректно использовать исторические термины, \
понятия, относящиеся к данному периоду.

После выполнения посмотри ответы, поставь себе оценку (от 0 до 11) и пришли мне сообщением."""

otvet4_20 = '''Правильный ответ должен содержать следующие элементы:
1) император — Александр III;
2) год — 1894;
3) десятилетие — 1860-е гг.

Правильно указаны император, год и десятилетие - 2 БАЛЛА
Правильно указаны любые два элемента ответа - 1 БАЛЛ
Правильно указан любой один элемент ответа.
ИЛИ Ответ неправильный - 0 БАЛЛОВ'''

otvet4_21 = '''Правильный ответ должен содержать следующие элементы:
1) реформа, например:
— отмена крепостного права;
— судебная реформа;
— земская реформа;
2) ответ на первый вопрос: по общему убеждению российское общество не могло ответить \
неблагодарностью на реформы, но события и явления свидетельствовали об отсутствии в \
обществе благоприятного восприятия этих реформ;
3) ответ на второй вопрос: «подъём земских сил» (помощь государству со стороны народа)

Правильно указана любая одна реформа и даны ответы на два вопроса - 2 БАЛЛА
Правильно указаны любые два элемента ответа - 1 БАЛЛ
Правильно указан любой один элемент ответа.
ИЛИ Ответ неправильный - 0 БАЛЛОВ'''

otvet4_22 = '''Могут быть указаны следующие меры:
1) издание Манифеста «О незыблемости самодержавия»;
2) отклонение проекта М.Т. Лорис-Меликова;
3) издание «Распоряжения о мерах к охранению государственного порядка и \
общественного спокойствия»;
4) утверждение новых «Временных правил» о печати, устанавливавших строгий \
административный надзор за газетами и журналами;
5) закрытие радикальных и либеральных периодических изданий \
(«Отечественные записки», «Дело» и др.);
6) издание циркуляра о «кухаркиных детях»;
7) введение нового университетского устава, ликвидировавшего автономию университетов;
8) введение института земских начальников;
9) изменение порядка формирования земств и ограничение их прав («земская контрреформа»);
10) изменение порядка формирования органов городского самоуправления и усиление \
контроля над ними («городская контрреформа»);
11) изменения в судопроизводстве (ограничение гласности, нарушение принципа \
несменяемости судей, ограничение роли присяжных заседателей).
Могут быть указаны другие меры

Правильно указаны три меры - 2 БАЛЛА
Правильно указаны две меры - 1 БАЛЛ
Правильно указана одна мера.
ИЛИ Ответ неправильный - 0 БАЛЛОВ'''

otvet4_23 = '''Могут быть приведены следующие объяснения:
1) А.Ф. Керенский призвал к борьбе против выступления Л.Г. Корнилова в конце августа \
1917 г. Этим воспользовались большевики, которые сыграли важную роль в разгроме \
Корнилова, значительно увеличив свою популярность;
2) А.Ф. Керенский выступал за продолжение войны, что ослабляло его позиции и усиливало \
позиции большевиков, выступавших за выход России из войны;
3) Временное правительство, возглавляемое А.Ф. Керенским, так и не приступило к \
немедленному решению важнейших социально-экономических вопросов (рабочий, аграрный);
4) Временное правительство, возглавляемое А.Ф. Керенским, перенесло сроки выборов \
Учредительного собрания с 17 сентября на 12 ноября, в результате чего большевики \
получили время для организации вооружённого восстания.
Могут быть приведены другие объяснения

Приведены три объяснения - 3 БАЛЛА
Приведены два объяснения - 2 БАЛЛА
Приведено одно объяснение - 1 БАЛЛ
Приведены рассуждения общего характера, не соответствующие требованию задания.
ИЛИ Ответ неправильный - 0 БАЛЛОВ'''

otvet4_24 =  '''Правильный ответ должен содержать аргументы:
1) в подтверждение, например:
— в результате Смуты на престол взошёл представитель новой царской династии — Романовых;
— в результате Смуты значительно усилилась роль Земских соборов в решении государственных дел;
— в период Смуты власть на местах перешла в руки назначаемых из центра воевод;
— при Михаиле Романове, избранном на царский престол в период Смуты, возросла \
роль патриарха в управлении государством;
2) в опровержение, например:
— в России сохранилась монархическая форма правления;
— при царе сохранилась Боярская дума — высший совет из представителей аристократии;
— после Смуты в России действовали Земские соборы, которые созывались и до начала Смутного времени;
— после Смуты в России продолжала действовать система приказов (органов \
центрального государственного управления).
Могут быть приведены другие аргументы

Приведены два аргумента в подтверждение и два в опровержение оценки - 4 БАЛЛА
Приведены два аргумента в подтверждение и один в опровержение оценки.
ИЛИ Приведены один аргумент в подтверждение и два в опровержение оценки - 3 БАЛЛА
Приведены один аргумент в подтверждение и один в опровержение оценки - 2 БАЛЛА
Приведены только два аргумента в подтверждение оценки.
ИЛИ Приведены только два аргумента в опровержение оценки - 1 БАЛЛ
Приведён только один любой аргумент.
ИЛИ Приведены только факты, иллюстрирующие события (явления, процессы), связанные с данной \
точкой зрения, но не являющиеся аргументами.
ИЛИ Приведены рассуждения общего характера, не соответствующие требованию задания.
ИЛИ Ответ неправильный - 0 БАЛЛОВ'''


#ТУТ ОПРЕДЕЛЯЕМ КЛАВИАТУРЫ     ТУТ ОПРЕДЕЛЯЕМ КЛАВИАТУРЫ     ТУТ ОПРЕДЕЛЯЕМ КЛАВИАТУРЫ     ТУТ ОПРЕДЕЛЯЕМ КЛАВИАТУРЫ     ТУТ ОПРЕДЕЛЯЕМ КЛАВИАТУРЫ     ТУТ ОПРЕДЕЛЯЕМ КЛАВИАТУРЫ

#Главная
keyboard = types.InlineKeyboardMarkup()
keyboard.add(types.InlineKeyboardButton(text='Решать ЕГЭ на время',callback_data='Решать ЕГЭ на время'))
keyboard.add(types.InlineKeyboardButton(text='Решать ЕГЭ не на время',callback_data='Решать ЕГЭ не на время'))
keyboard.add(types.InlineKeyboardButton(text='Полезные советы',callback_data='Полезные советы'))
keyboard.add(types.InlineKeyboardButton(text='Купить ответы к ЕГЭ 2019 по истории',callback_data='Купить ответы к ЕГЭ 2019 по истории'))

#Меню выбор варианта в режиме без времени
keyboard_variant_ne_time = types.InlineKeyboardMarkup()
v1 = types.InlineKeyboardButton(text='1 вариант',callback_data='101')
v2 = types.InlineKeyboardButton(text='2 вариант',callback_data='201')
v3 = types.InlineKeyboardButton(text='3 вариант',callback_data='301')
v4 = types.InlineKeyboardButton(text='4 вариант',callback_data='401')
keyboard_variant_ne_time.add(v1,v2)
keyboard_variant_ne_time.add(v3,v4)
keyboard_variant_ne_time.add(types.InlineKeyboardButton(text='На главную',callback_data='На главную'))

#Меню выбор варианта в режиме на время
keyboard_variant_time = types.InlineKeyboardMarkup()
v1 = types.InlineKeyboardButton(text='1 вариант',callback_data='8101')
v2 = types.InlineKeyboardButton(text='2 вариант',callback_data='8201')
v3 = types.InlineKeyboardButton(text='3 вариант',callback_data='8301')
v4 = types.InlineKeyboardButton(text='4 вариант',callback_data='8401')
keyboard_variant_time.add(v1,v2)
keyboard_variant_time.add(v3,v4)
keyboard_variant_time.add(types.InlineKeyboardButton(text='На главную',callback_data='На главную'))

#Меню решать на время    
keyboard_reshat_na_vremia = types.InlineKeyboardMarkup()
keyboard_reshat_na_vremia.add(types.InlineKeyboardButton(text='Поехали!',callback_data='Поехали!'))
keyboard_reshat_na_vremia.add(types.InlineKeyboardButton(text='На главную',callback_data='На главную'))

#Меню решать не на время    
keyboard_reshat_ne_na_vremia = types.InlineKeyboardMarkup()
keyboard_reshat_ne_na_vremia.add(types.InlineKeyboardButton(text='Начать',callback_data='Начать'))
keyboard_reshat_ne_na_vremia.add(types.InlineKeyboardButton(text='На главную',callback_data='На главную'))


uznattime = types.InlineKeyboardButton(text='Осталось времени',callback_data='Осталось времени')
mainfromz = types.InlineKeyboardButton(text='На главную',callback_data='На главную')
uznatotvet = types.InlineKeyboardButton(text='Узнать ответ',callback_data='Узнать ответ')
uznatkriterii = types.InlineKeyboardButton(text='Узнать критерии',callback_data='Узнать ответ')


                                                #не на время

#Клава при вопросе или ответе в режиме не на время  
def prinetime(p):
    x = types.InlineKeyboardMarkup()
    back = types.InlineKeyboardButton(text='Назад',callback_data=str(sost[p][0]-1))
    forth = types.InlineKeyboardButton(text='Далее',callback_data=str(sost[p][0]+1))
    if sost[p][0] in [101,201,301,401]: x.add(forth)
    elif sost[p][0] in [125,225,325,425]: x.add(back)
    else: x.add(back,forth)
    x.add(mainfromz)
    return x



#Клава при вопросе или ответе в режиме не на время в заданиях 20 - 24
def prinetime2024(p):
    x = types.InlineKeyboardMarkup()
    back = types.InlineKeyboardButton(text='Назад',callback_data=str(sost[p][0]-1))
    forth = types.InlineKeyboardButton(text='Далее',callback_data=str(sost[p][0]+1))
    if sost[p][0] in [101,201,301,401]: x.add(forth)
    elif sost[p][0] in [125,225,325,425]: x.add(back)
    else: x.add(back,forth)
    x.add(uznatotvet)
    x.add(mainfromz)
    return x



#Клава при вопросе в режиме не на время в задании 25
def prinetime25(p):
    x = types.InlineKeyboardMarkup()
    back = types.InlineKeyboardButton(text='Назад',callback_data=str(sost[p][0]-1))
    if sost[p][0] in [101,201,301,401]: x.add(forth)
    elif sost[p][0] in [125,225,325,425]: x.add(back)
    else: x.add(back,forth)
    x.add(uznatkriterii)
    x.add(mainfromz)
    return x


#Клава назад к вопросу в режиме не на время
def netopishesh(p):
    x = types.InlineKeyboardMarkup()
    backtoquest = types.InlineKeyboardButton(text='Назад к вопросу',callback_data=str(sost[p][0]))
    x.add(backtoquest)
    x.add(mainfromz)
    return x
    


                                                  #на время          
#Клава при вопросе в режиме на время
def privoprosetime(p):                                                                                                    #time
    x = types.InlineKeyboardMarkup()
    x.add(uznattime,mainfromz)
    return x

#Клава при ответе в режиме на время
def priotvetetime(p):                                                                                                    #time
    forth = types.InlineKeyboardButton(text='Далее',callback_data=str(sost[p][0]+1))
    x = types.InlineKeyboardMarkup()
    x.add(uznattime,forth)
    x.add(mainfromz)
    return x
                                                       

#Клава при вопросе в режиме на время в заданиях 20 - 24
def privoprosetime2024(p):                                                                                                    #time
    x = types.InlineKeyboardMarkup()
    x.add(uznattime,mainfromz)
    x.add(uznatotvet)
    return x



#Клава при ответе в режиме на время в заданиях 20 - 24
def priotvetetime2024(p):                                                                                                    #time
    forth = types.InlineKeyboardButton(text='Далее',callback_data=str(sost[p][0]+1))
    x = types.InlineKeyboardMarkup()
    x.add(uznattime,forth)
    x.add(mainfromz)
    return x



#Клава при вопросе в режиме на время в задании 25
def privoprosetime25(p):                                                                                                    #time
    x = types.InlineKeyboardMarkup()
    x.add(uznattime,mainfromz)
    x.add(uznatkriterii)
    return x



#Клава при ответе в режиме на время
def priotvetetime25(p):                                                                                                    #time
    x = types.InlineKeyboardMarkup()
    x.add(uznattime)
    x.add(mainfromz)
    return x

#Клава назад к вопросу в режиме на время
def netopisheshtime(p):
    x = types.InlineKeyboardMarkup()
    backtoquest = types.InlineKeyboardButton(text='Назад к вопросу',callback_data=str(sost[p][0]))
    x.add(backtoquest)
    x.add(mainfromz,uznattime)
    return x

#Меню полезных советов
keyboard_poleznie_soveti = types.InlineKeyboardMarkup()

#Меню покупки ЕГЭ
keyboard_buy = types.InlineKeyboardMarkup()


#ТУТ ОПРЕДЕЛЯЕМ ДРУГИЕ ВСПОМОГАТЕЛЬНЫЕ ФУНКЦИИ     ТУТ ОПРЕДЕЛЯЕМ ДРУГИЕ ВСПОМОГАТЕЛЬНЫЕ ФУНКЦИИ     ТУТ ДРУГИЕ ОПРЕДЕЛЯЕМ ВСПОМОГАТЕЛЬНЫЕ ФУНКЦИИ     ТУТ ОПРЕДЕЛЯЕМ ДРУГИЕ ВСПОМОГАТЕЛЬНЫЕ ФУНКЦИИ
#А эта шляпа переводит первичные баллы ЕГЭ во вторичные
def firsttosecond(x):
    if x == 0: y = 'Заработано 0 баллов  из 100.'
    if x == 1: y = 'Заработано 4 балла из 100.'
    elif x == 2: y = 'Заработано 8 баллов из 100.'
    elif x == 3: y = 'Заработано 11 баллов из 100.'
    elif x == 4: y = 'Заработано 15 баллов из 100.'
    elif x == 5: y = 'Заработано 18 баллов из 100.'
    elif x == 6: y = 'Заработано 22 балла из 100.'
    elif x == 7: y = 'Заработано 25 баллов из 100.'
    elif x == 8: y = 'Заработано 29 баллов из 100.'
    elif x == 9: y = 'Заработано 32 балла из 100. Это, кстати, минимальный порог ЕГЭ 2019 года по истории.'
    elif x == 10: y = 'Заработано 34 балла из 100.'
    elif x == 11: y = 'Заработано 35 баллов из 100.'
    elif x == 12: y = 'Заработано 36 баллов из 100.'
    elif x == 13: y = 'Заработано 37 баллов из 100.'
    elif x == 14: y = 'Заработано 38 баллов из 100.'
    elif x == 15: y = 'Заработано 40 баллов из 100.'
    elif x == 16: y = 'Заработан 41 балл из 100.'
    elif x == 17: y = 'Заработано 42 балла из 100.'
    elif x == 18: y = 'Заработано 43 балла из 100.'
    elif x == 19: y = 'Заработано 44 балла из 100.'
    elif x == 20: y = 'Заработано 45 баллов из 100.'
    elif x == 21: y = 'Заработано 47 баллов из 100.'
    elif x == 22: y = 'Заработано 48 баллов из 100.'
    elif x == 23: y = 'Заработано 49 баллов из 100.'
    elif x == 24: y = 'Заработано 50 баллов из 100. Кстати, считается, что это уже четвёрка.'
    elif x == 25: y = 'Заработан 51 балл из 100.'
    elif x == 26: y = 'Заработано 52 балла из 100.'
    elif x == 27: y = 'Заработано 54 балла из 100.'
    elif x == 28: y = 'Заработано 55 баллов из 100.'
    elif x == 29: y = 'Заработано 56 баллов из 100.'
    elif x == 30: y = 'Заработано 57 баллов из 100.'
    elif x == 31: y = 'Заработано 58 баллов из 100.'
    elif x == 32: y = 'Заработано 60 баллов из 100.'
    elif x == 33: y = 'Заработан 61 балл из 100.'
    elif x == 34: y = 'Заработано 62 балла из 100.'
    elif x == 35: y = 'Заработано 63 балла из 100.'
    elif x == 36: y = 'Заработано 64 балла из 100.'
    elif x == 37: y = 'Заработано 65 баллов из 100.'
    elif x == 38: y = 'Заработано 67 баллов из 100.'
    elif x == 39: y = 'Заработано 68 баллов из 100. Кстати, это уже считается пятёркой!.'
    elif x == 40: y = 'Заработано 69 баллов из 100.'
    elif x == 41: y = 'Заработано 70 баллов из 100.'
    elif x == 42: y = 'Заработан 71 балл из 100.'
    elif x == 43: y = 'Заработано 72 балла из 100.'
    elif x == 44: y = 'Заработано 75 баллов из 100.'
    elif x == 45: y = 'Заработано 77 баллов из 100.'
    elif x == 46: y = 'Заработано 79 баллов из 100.'
    elif x == 47: y = 'Заработано 82 балла из 100.'
    elif x == 48: y = 'Заработано 84 балла из 100.'
    elif x == 49: y = 'Заработано 86 баллов из 100.'
    elif x == 50: y = 'Заработано 89 баллов из 100.'
    elif x == 51: y = 'Заработан 91 балл из 100.'
    elif x == 52: y = 'Заработано 93 балла из 100.'
    elif x == 53: y = 'Заработано 96 баллов из 100.'
    elif x == 54: y = 'Заработано 98 баллов из 100.'
    elif x == 55: y = 'У тебя 100 БАЛЛОВ. Мне больше нечему учить тебя) Удачи!'
    return y

#Эта херня заменяет два последних сообщения бота
def smena(soob,text,klava,sticker):
    bot.send_sticker(soob.chat.id,sticker)
    bot.send_message(soob.chat.id,text,reply_markup=klava)
    bot.delete_message(soob.chat.id, message_id=soob.message_id-1)
    bot.delete_message(soob.chat.id, message_id=soob.message_id)

#Эта шняга принимает объект message и ответ, и реагирует на непонятную хрень в режиме без времени
def neponiatno(r,y):
    bot.delete_message(r.chat.id, message_id=r.message_id-2)
    smena(r,y,netopishesh(r.from_user.id),kluchvesel)
    
#Эта шняга принимает объект message и ответ, и реагирует на непонятную хрень в режиме на время
def neponiatnotime(r,y):
    bot.delete_message(r.chat.id, message_id=r.message_id-2)
    smena(r,y,netopisheshtime(r.from_user.id),kluchvesel)

#Эта фиговина принимает объект message и ответ, и реагирует на верный ответ в режиме без времени
def verno(r,y):
    bot.delete_message(r.chat.id, message_id=r.message_id-2)
    if sost[r.from_user.id][0]%100 < 20:
        smena(r,y,prinetime(r.from_user.id),kluchvesel)
    elif sost[r.from_user.id][0]%100 < 25:
        smena(r,y,prinetime2024(r.from_user.id),kluchvesel)
    elif sost[r.from_user.id][0]%100 == 25:
        smena(r,y,prinetime25(r.from_user.id),kluchvesel)
        
#А эта - на неверный
def neverno(r,y):
    bot.delete_message(r.chat.id, message_id=r.message_id-2)
    if sost[r.from_user.id][0]%100 < 20:
       smena(r,y,prinetime(r.from_user.id),kluchgrust)
    elif sost[r.from_user.id][0]%100 < 25:
        smena(r,y,prinetime2024(r.from_user.id),kluchgrust)
    elif sost[r.from_user.id][0]%100 == 25:
        smena(r,y,prinetime25(r.from_user.id),kluchgrust)
        
#Эта фиговина принимает объект message и ответ, и реагирует на верный ответ в режиме на время
def vernotime(r,y,b):
    bot.delete_message(r.chat.id, message_id=r.message_id-2)
    if sost[r.from_user.id][3] == 0:
        sost[r.from_user.id][1] += b
    if sost[r.from_user.id][0]%100 < 20:
        smena(r,y+firsttosecond(sost[r.from_user.id][1]),priotvetetime(r.from_user.id),kluchvesel)
    elif sost[r.from_user.id][0]%100 < 25:
        smena(r,y+firsttosecond(sost[r.from_user.id][1]),priotvetetime2024(r.from_user.id),kluchvesel)
    elif sost[r.from_user.id][0]%100 == 25:
        smena(r,y+firsttosecond(sost[r.from_user.id][1]),priotvetetime25(r.from_user.id),kluchvesel)
    sost[r.from_user.id][3] = 1
    
#А эта - на неверный
def nevernotime(r,y):
    bot.delete_message(r.chat.id, message_id=r.message_id-2)
    if sost[r.from_user.id][0]%100 < 20:
        smena(r,y+firsttosecond(sost[r.from_user.id][1]),priotvetetime(r.from_user.id),kluchgrust)
    elif sost[r.from_user.id][0]%100 < 25:
        smena(r,y+firsttosecond(sost[r.from_user.id][1]),priotvetetime2024(r.from_user.id),kluchgrust)
    elif sost[r.from_user.id][0]%100 == 25:
        smena(r,y+firsttosecond(sost[r.from_user.id][1]),priotvetetime25(r.from_user.id),kluchgrust)
    sost[r.from_user.id][3] = 1
    

#Эта херь возвращает оставшееся до конца экза время, в формате (ч:мин:сек)
def skokostalos(r):
    d = int(sost[r][2] - time.time())
    hours = d//3600
    minutes = (d%3600)//60
    secunds = (d%3600)%60
    if d < 0:
        return 'Всё, часики утикали, сдаём по-одному и никаких пятиминуточек!'
    else:
        return 'До сдачи бланка осталось '+str(hours)+' ч, '+str(minutes)+' мин, '+str(secunds)+' сек, '
    
   
#ТУТ ОПРЕДЕЛЯЕМ ОБРАБОТЧИКИ     ТУТ ОПРЕДЕЛЯЕМ ОБРАБОТЧИКИ     ТУТ ОПРЕДЕЛЯЕМ ОБРАБОТЧИКИ     ТУТ ОПРЕДЕЛЯЕМ ОБРАБОТЧИКИ     ТУТ ОПРЕДЕЛЯЕМ ОБРАБОТЧИКИ     ТУТ ОПРЕДЕЛЯЕМ ОБРАБОТЧИКИ
#Это на всякий случай, если надо узнать id какого-нибудь стикера, по-людски ж никак
#@bot.message_handler(content_types=["sticker"])
#def pssparen(pisun):
#    print(pisun.sticker.file_id)

#Эта херня обрабатывает команды от юзера
@bot.message_handler(commands=["start"])
def start(m):
    sost[m.from_user.id] = [0,0,2000000000,0]
    bot.send_sticker(m.chat.id,kluch)
    bot.send_message(m.chat.id,'Привет, '+m.chat.first_name+'''! Я - бот-историк Василий. Не хочешь \
немного ИСТОРИИ? Если да, то наверни кофейку и проверь свои познания!
(А если ты даже знаешь, на кого я похож, считай, что у тебя уже 4:))''',reply_markup=keyboard)



#Эта херня обрабатывает текстовые сообщения от юзера
@bot.message_handler(content_types=["text"])
def answertxt(r):
    vopros = sost[r.from_user.id][0]
                    #Первый вариант
    if vopros == 101:#101
        if r.text == '321': verno(r,'Неплохо для начала) Это было задание на 4 балла. Напомню, что СУММА баллов и время считается только в режиме "на время", не в этом.\n\nИдём дальше?')
        else: neverno(r,'Не-а. Правильный ответ - 321. Ничего, первый блин комом. Это было задание на 4 балла. Напомню, что СУММА баллов и время считается только в режиме "на время", не в этом.\n\nИдём дальше?')

    elif vopros == 102:#102
        if r.text == '5432': verno(r,'Молодец!\n\nПродолжим?')
        else: neverno(r,'Неправильно. Верный ответ - 5432\n\nПродолжим?')

    elif vopros == 103:#103
        if r.text == '14': verno(r,'Совершенно верно) \n\nДальше?')
        else: neverno(r,'Ошибочка. Верный ответ - 14\n\nДальше?')

    elif vopros == 104:#104
        if r.text.lower() in ('урочныелета','урочныегоды','урочные годы','урочные лета'): verno(r,'Да, именно так назывался 5-летний срок сыска беглых крестьян, введённый указом 1597 года. \n\nПродолжаем?')
        else: neverno(r,'Мимо. Срок давности сыска беглых крепостных, введённый в 1597 году, назывался УРОЧНЫЕ ЛЕТА (или урочные годы)\n\nПродолжаем?')

    elif vopros == 105:#105
        if r.text == '2165': verno(r,'В точку) \n\nЕдем далее?')
        else: neverno(r,'Промах. Правильный ответ 2165\n\nЕдем делее?')

    elif vopros == 106:#106
        if r.text == '1534': verno(r,'Идеально! \n\nИдём дальше?')
        else: neverno(r,'Неверно. Правильное решение  1534\n\nИдём дальше?')

    elif vopros == 107:#107
        if r.text == '125': verno(r,'Точно! \n\nПродолжим?')
        else: neverno(r,'Промах. Правильный ответ 125\n\nПродолжим?')

    elif vopros == 108:#108
        if r.text == '253': verno(r,'Хорошо) \n\nДалее?')
        else: neverno(r,'Не-а. Верный ответ такой: 253\n\nДалее?')

    elif vopros == 109:#109
        if r.text == '2641': verno(r,'Отлично) \n\nПродолжаем?')
        else: neverno(r,'Ошибка. Правильны ответ - 2641\n\nПродолжаем?')

    elif vopros == 110:#110
        if r.text.lower() == 'брежнев': verno(r,'Совершенно верно! Это был товарищ Брежнев)\n\nЕдем далее?')
        else: neverno(r,'Непопадание( Это был товарищ Брежнев)\n\nЕдем далее?')
        
    elif vopros == 111:#111
        if r.text == '234589': verno(r,'Молодец! \n\nДалее?')
        else: neverno(r,'Не верно. Верный ответ такой: 234589\n\nДалее?')

    elif vopros == 112:#112
        if r.text == '136': verno(r,'Совершенно верно) \n\nПродолжаем?')
        else: neverno(r,'Ошибка. Правильны ответ - 136\n\nПродолжаем?')

    elif vopros == 113:#113
        if r.text.lower() in ('елизаветапетровна','елизавета петровна'): verno(r,'Совершенно справедливо! \n\nПродолжаем?')
        else: neverno(r,'Непопадание( Правильно - Елизавета Петровна\n\nЕдем дальше?')   
        
    elif vopros == 114:#114
        if r.text.lower() == 'кунерсдорф': verno(r,'Отлично) \n\nПродолжаем?')
        else: neverno(r,'Ошибка. Правильны ответ - Кунерсдорф\n\nПродолжаем?')

    elif vopros == 115:#115
        if r.text.lower() in ('Фридрихвторой', 'фридрих второй'): verno(r,'Совершенно верно! \n\nЕдем делее?')
        else: neverno(r,'Непопадание( Это был Фридрих Второй\n\nЕдем делее?')
        
    elif vopros == 116:#116
        if r.text == '245': verno(r,'Молодец! \n\nДалее?')
        else: neverno(r,'Не верно. Верный ответ: 245\n\nДалее?')

    elif vopros == 117:#117
        if r.text == '6354': verno(r,'Совершенно верно) \n\nПродолжаем?')
        else: neverno(r,'Ошибка. Правильны ответ - 6354\n\nПродолжаем?')

    elif vopros == 118:#118
        if r.text == '24': verno(r,'Совершенно справедливо! \n\nИдём дальше?')
        else: neverno(r,'Непопадание(Правильно - 24\n\nИдём дальше?')
        
    elif vopros == 119:#119
        if r.text == '24': verno(r,'Совершенно справедливо! \n\nПродолжаем?')
        else: neverno(r,'Промах. Правильно - 24(\n\nПродолжаем?')
        
    elif vopros in (120, 220, 320, 420):#120
        if r.text == '0': neverno(r,'Соберись! Ты можешь лучше! \n\nПродолжим?')
        elif r.text == '1': verno(r,'Гут! Но, могло быть и лучше) \n\nПродолжим?')
        elif r.text == '2': verno(r,'Круть) \n\nПродолжаем?') 
        else: neponiatno(r,'Чей-то ты не то пишешь. Давай ещё раз')
        
    elif vopros in (121, 221, 321, 421):#121
        if r.text == '0': neverno(r,'Ну шо ж ты. Давай, напрягись! \n\nИдём дальше?')
        elif r.text == '1': verno(r,'Неплохо. \n\nИдём дальше?')
        elif r.text == '2': verno(r,'Класс! (Если не врёшь))) \n\nИдём дальше?') 
        else: neponiatno(r,'Чей-то ты не то пишешь. Давай ещё раз')
        
    elif vopros in (122, 222, 322, 422):#122
        if r.text == '0': neverno(r,'Нуу.. не расстраивай Василия( \n\nЕдем далее?')
        elif r.text == '1': verno(r,'Пойдёт. \n\nЕдем далее?')
        elif r.text == '2': verno(r,'Хорош!)) \n\nЕдем далее?') 
        else: neponiatno(r,'Чей-то ты не то пишешь. Давай ещё раз')
        
    elif vopros in (123, 223, 323, 423):#123
        if r.text == '0': neverno(r,'Соберись! Ты можешь лучше! \n\nПродолжим?')
        elif r.text == '1': verno(r,'Ну, могло быть и хуже) \n\nПродолжим?')
        elif r.text == '2': verno(r,'Гут! Но, могло быть и лучше) \n\nПродолжим?')
        elif r.text == '3': verno(r,'Круть) \n\nПродолжаем?') 
        else: neponiatno(r,'Чей-то ты не то пишешь. Давай ещё раз')
        
    elif vopros in (124, 224, 324, 424):#124
        if r.text == '0': neverno(r,'Соберись! Ты можешь лучше! \n\nПродолжим?')
        elif r.text == '1': verno(r,'Ну, могло быть и хуже) \n\nПродолжим?')
        elif r.text == '2': verno(r,'Пойдёт, но стремиться есть куда \n\nПродолжим?')
        elif r.text == '3': verno(r,'Гут! Но, ещё не идеально) \n\nПродолжим?')
        elif r.text == '4': verno(r,'Высший пилотаж) \n\nПродолжаем?') 
        else: neponiatno(r,'Чей-то ты не то пишешь. Давай ещё раз')
        
    elif vopros in (125, 225, 325, 425):#125
        if r.text == '0': neverno(r,'Я ща заплачу( А мне нельзя. Так что, поднажми!')
        elif r.text == '1': verno(r,'Хуже - есть куда, но зачем тебе ориентироваться на это?',1)
        elif r.text == '2': verno(r,'Ну, не фонтан..') 
        elif r.text == '3': verno(r,'Ну, ещё слабо, но уже не смертельно')
        elif r.text == '4': verno(r,'4 по 11 - балльной шкале за сочинение! Сколько это по \
5-балльной - на калькуляторе посчитаешь потом') 
        elif r.text == '5': verno(r,'Отлично! Если шкала была бы пятибалльной)')
        elif r.text == '6': verno(r,'А что - если подтянуть - так и толк выйдет.')
        elif r.text == '7': verno(r,'Твёрдая семёрка! Твердеёшая. Уверенная прям.')
        elif r.text == '8': verno(r,'Годно, гражданин! Годно весьма!')
        elif r.text == '9': verno(r,'Вот же. Сразу видно, что человек учебник истории не вместо подставки использовал')
        elif r.text == '10': verno(r,'Уххх. Аж знаниями через экран повеяло.')
        elif r.text == '11': verno(r,'Не, ну это ТОП. Снимаю шляпу (которой у меня нет)')
        else: neponiatno(r,'Чей-то ты не то пишешь. Давай ещё раз')

    elif vopros == 8101:#8101
        if r.text == '321': vernotime(r,'Неплохо для начала) ',1)
        else: nevernotime(r,'Не-а. Правильный ответ - 321. Ничего, первый блин комом. ')

    elif vopros == 8102:#8102
        if r.text == '5432': vernotime(r,'Молодец! ',2)
        else: nevernotime(r,'Неправильно. Верный ответ - 5432. ')

    elif vopros == 8103:#8103
        if r.text == '14': vernotime(r,'Совершенно верно) ',2)
        else: nevernotime(r,'Ошибочка. Верный ответ - 14. ')

    elif vopros == 8104:#8104
        if r.text.lower() in ('урочныелета','урочныегоды','урочные годы','урочные лета'): vernotime(r,'Совершенно верно, именно так назывался 5-летний срок сыска беглых крестьян, введённый указом 1597 года. ',1)
        else: nevernotime(r,'Мимо. Срок сыска беглых крепостных, введённый в 1597 году, назывался УРОЧНЫЕ ЛЕТА (или урочные годы). ')

    elif vopros == 8105:#8105
        if r.text == '2165': vernotime(r,'В точку) ',2)
        else: nevernotime(r,'Промах. Правильный ответ 2165. ')

    elif vopros == 8106:#8106
        if r.text == '1534': vernotime(r,'Идеально! ',2)
        else: nevernotime(r,'Неверно. Правильное решение - 1534. ')

    elif vopros == 8107:#8107
        if r.text == '125': vernotime(r,'Точно! ',2)
        else: nevernotime(r,'Промах. Правильный ответ - 125. ')

    elif vopros == 8108:#8108
        if r.text == '253': vernotime(r,'Абсолюрно верно. ',2)
        else: nevernotime(r,'Не-а. Верный ответ - 253. ')

    elif vopros == 8109:#8109
        if r.text == '2641': vernotime(r,'Отлично)  ',2)
        else: nevernotime(r,'Ошибка. Правильный ответ - 2641. ')

    elif vopros == 8110:#8110
        if r.text.lower() == 'брежнев': vernotime(r,'Совершенно верно! Это был товарищ Брежнев. ',1)
        else: nevernotime(r,'Непопадание( Это был товарищ Брежнев) ')

    elif vopros == 8111:#8111
        if r.text == '234589': vernotime(r,'В точку) ',3)
        else: nevernotime(r,'Промах. Правильный ответ 234589. ')

    elif vopros == 8112:#8112
        if r.text == '136': vernotime(r,'Идеально! ',2)
        else: nevernotime(r,'Неверно. Правильное решение - 136. ')

    elif vopros == 8113:#8113
        if r.text.lower() in ('елизаветапетровна','елизавета петровна'): vernotime(r,'Точно! ',1)
        else: nevernotime(r,'Промах. Правильный ответ - Елизавета Петровна. ')

    elif vopros == 8114:#8114
        if r.text.lower() == 'кунерсдорф': vernotime(r,'Абсолюрно верно. ',1)
        else: nevernotime(r,'Не-а. Верный ответ - Кунерсдорф. ')

    elif vopros == 8115:#8115
        if r.text.lower() in ('фридрихвторой', 'фридрих второй'): vernotime(r,'Отлично)  ',1)
        else: nevernotime(r,'Ошибка. Правильный ответ - Фридрих Второй. ')

    elif vopros == 8116:#8116
        if r.text == '245': vernotime(r,'Совершенно верно! ',2)
        else: nevernotime(r,'Непопадание( Верно - 245 ')

    elif vopros == 8117:#8117
        if r.text == '6354': vernotime(r,'Абсолюрно верно. ',2)
        else: nevernotime(r,'Не-а. Верный ответ - 6354. ')

    elif vopros == 8118:#8118
        if r.text == '24': vernotime(r,'Отлично)  ',1)
        else: nevernotime(r,'Ошибка. Правильный ответ - 24. ')

    elif vopros == 8119:#8119
        if r.text == '24': vernotime(r,'Совершенно верно! ',1)
        else: nevernotime(r,'Непопадание( Правильно было бы 24')

    elif vopros in (8120, 8220, 8320, 8420):#8120
        if r.text == '0': nevernotime(r,'Соберись! Ты можешь лучше! \n\nПродолжим?')
        elif r.text == '1': vernotime(r,'Гут! Но, могло быть и лучше) \n\nПродолжим?',1)
        elif r.text == '2': vernotime(r,'Круть) \n\nПродолжаем?',1) 
        else: neponiatnotime(r,'Чей-то ты не то пишешь. Давай ещё раз')
        
    elif vopros in (8121, 8221, 8321, 8421):#8121
        if r.text == '0': nevernotime(r,'Ну шо ж ты. Давай, напрягись! \n\nИдём дальше?')
        elif r.text == '1': vernotime(r,'Неплохо. \n\nИдём дальше?',1)
        elif r.text == '2': vernotime(r,'Класс! (Если не врёшь))) \n\nИдём дальше?',2) 
        else: neponiatnotime(r,'Чей-то ты не то пишешь. Давай ещё раз')
        
    elif vopros in (8122, 8222, 8322, 8422):#8122
        if r.text == '0': nevernotime(r,'Нуу.. не расстраивай Василия( \n\nЕдем далее?')
        elif r.text == '1': vernotime(r,'Пойдёт. \n\nЕдем далее??',1)
        elif r.text == '2': vernotime(r,'Хорош!)) \n\nЕдем далее?',2) 
        else: neponiatnotime(r,'Чей-то ты не то пишешь. Давай ещё раз')
        
    elif vopros in (8123, 8223, 8323, 8423):#8123
        if r.text == '0': nevernotime(r,'Соберись! Ты можешь лучше! \n\nПродолжим?')
        elif r.text == '1': vernotime(r,'Ну, могло быть и хуже) \n\nПродолжим?',1)
        elif r.text == '2': vernotime(r,'Гут! Но, могло быть и лучше) \n\nПродолжим?',2)
        elif r.text == '3': vernotime(r,'Круть) \n\nПродолжаем?',3) 
        else: neponiatnotime(r,'Чей-то ты не то пишешь. Давай ещё раз')
        
    elif vopros in (8124, 8224, 8324, 8424):#8124
        if r.text == '0': nevernotime(r,'Соберись! Ты можешь лучше! \n\nПродолжим?')
        elif r.text == '1': vernotime(r,'Ну, могло быть и хуже) \n\nПродолжим?',1)
        elif r.text == '2': vernotime(r,'Пойдёт, но стремиться есть куда \n\nПродолжим?',2)
        elif r.text == '3': vernotime(r,'Гут! Но, ещё не идеально) \n\nПродолжим?',3)
        elif r.text == '4': vernotime(r,'Высший пилотаж) \n\nПродолжаем?',4) 
        else: neponiatnotime(r,'Чей-то ты не то пишешь. Давай ещё раз')
        
    elif vopros in (8125, 8225, 8325, 8425):#8125
        if r.text == '0': nevernotime(r,'Я ща заплачу( А мне нельзя. Так что, поднажми!')
        elif r.text == '1': vernotime(r,'Хуже - есть куда, но зачем тебе ориентироваться на это?',1)
        elif r.text == '2': vernotime(r,'Ну, не фонтан..',2) 
        elif r.text == '3': vernotime(r,'Ну, ещё слабо, но уже не смертельно',3)
        elif r.text == '4': vernotime(r,'4 по 11 - балльной шкале за сочинение! Сколько это по \
                                  5-балльной - на калькуляторе посчитаешь потом',4) 
        elif r.text == '5': vernotime(r,'Отлично! Если шкала была бы пятибалльной)',5)
        elif r.text == '6': vernotime(r,'А что - если подтянуть - так и толк выйдет.',6)
        elif r.text == '7': vernotime(r,'Твёрдая семёрка! Твердеёшая. Уверенная прям.',7)
        elif r.text == '8': vernotime(r,'Годно, гражданин! Годно весьма!',8)
        elif r.text == '9': vernotime(r,'Вот же. Сразу видно, что человек учебник истории не вместо подставки использовал',9)
        elif r.text == '10': vernotime(r,'Уххх. Аж знаниями через экран повеяло.',10)
        elif r.text == '11': vernotime(r,'Не, ну это ТОП. Снимаю шляпу (которой у меня нет)',11)
        else: neponiatnotime(r,'Чей-то ты не то пишешь. Давай ещё раз')

                    #Второй вариант
    elif vopros == 201:#201
        if r.text == '132': verno(r,'Неплохо для начала) Это было задание на 4 балла. Напомню, что СУММА баллов и время считается только в режиме "на время", не в этом.\n\nИдём дальше?')
        else: neverno(r,'Не-а. Правильный ответ - 132. Ничего, первый блин комом. Это было задание на 4 балла. Напомню, что СУММА баллов и время считается только в режиме "на время", не в этом.\n\nИдём дальше?')

    elif vopros == 202:#202
        if r.text == '6243': verno(r,'Молодец!\n\nПродолжим?')
        else: neverno(r,'Неправильно. Верный ответ - 6243\n\nПродолжим?')

    elif vopros == 203:#203
        if r.text == '26': verno(r,'Совершенно верно) \n\nДальше?')
        else: neverno(r,'Ошибочка. Верный ответ - 26\n\nДальше?')

    elif vopros == 204:#204
        if r.text.lower() == 'приватизация': verno(r,'Да, именно так.\n\nПродолжаем?')
        else: neverno(r,'Мимо. Верный ответ - "приватизация"\n\nПродолжаем?')

    elif vopros == 205:#205
        if r.text == '4651': verno(r,'В точку) \n\nЕдем далее?')
        else: neverno(r,'Промах. Правильный ответ 4651\n\nЕдем делее?')

    elif vopros == 206:#206
        if r.text == '1523': verno(r,'Идеально! \n\nИдём дальше?')
        else: neverno(r,'Неверно. Правильное решение  1523\n\nИдём дальше?')

    elif vopros == 207:#207
        if r.text == '246': verno(r,'Точно! \n\nПродолжим?')
        else: neverno(r,'Промах. Правильный ответ 246\n\nПродолжим?')

    elif vopros == 208:#208
        if r.text == '345': verno(r,'Хорошо) \n\nДалее?')
        else: neverno(r,'Не-а. Верный ответ такой: 345\n\nДалее?')

    elif vopros == 209:#209
        if r.text == '1235': verno(r,'Отлично) \n\nПродолжаем?')
        else: neverno(r,'Ошибка. Правильны ответ - 1235\n\nПродолжаем?')

    elif vopros == 210:#210
        if r.text.lower() == 'хрущёв': verno(r,'Совершенно верно!\n\nЕдем далее?')
        else: neverno(r,'Непопадание( Правильный ответ - товарищ "Хрущёв"\n\nЕдем далее?')
        
    elif vopros == 211:#211
        if r.text == '419285': verno(r,'Молодец! \n\nДалее?')
        else: neverno(r,'Не верно. Верный ответ такой: 419285\n\nДалее?')

    elif vopros == 212:#212
        if r.text == '156': verno(r,'Совершенно верно) \n\nПродолжаем?')
        else: neverno(r,'Ошибка. Правильны ответ - 156\n\nПродолжаем?')

    elif vopros == 213:#213
        if r.text.lower() == 'декабрь': verno(r,'Совершенно справедливо! \n\nПродолжаем?')
        else: neverno(r,'Непопадание( Правильно - "декабрь"\n\nЕдем дальше?')   
        
    elif vopros == 214:#214
        if r.text.lower() == 'тула': verno(r,'Отлично) \n\nПродолжаем?')
        else: neverno(r,'Ошибка. Правильны ответ - Тула\n\nПродолжаем?')

    elif vopros == 215:#215
        if r.text.lower() == 'черчилль': verno(r,'Совершенно верно! \n\nЕдем делее?')
        else: neverno(r,'Непопадание( Правильный ответ - Черчилль\n\nЕдем делее?')
        
    elif vopros == 216:#216
        if r.text == '245': verno(r,'Молодец! \n\nДалее?')
        else: neverno(r,'Не верно. Верный ответ: 245\n\nДалее?')

    elif vopros == 217:#217
        if r.text == '5431': verno(r,'Совершенно верно) \n\nПродолжаем?')
        else: neverno(r,'Ошибка. Правильны ответ - 5431\n\nПродолжаем?')

    elif vopros == 218:#218
        if r.text == '25': verno(r,'Совершенно справедливо! \n\nИдём дальше?')
        else: neverno(r,'Непопадание(Правильно - 25\n\nИдём дальше?')
    elif vopros == 219:#219
        if r.text == '13': verno(r,'Совершенно справедливо! \n\nПродолжаем?')
        else: neverno(r,'Промах. Правильно - 13(\n\nПродолжаем?')


    elif vopros == 8201:#8201
        if r.text == '132': vernotime(r,'Неплохо для начала) ',1)
        else: nevernotime(r,'Не-а. Правильный ответ - 132. Ничего, первый блин комом. ')

    elif vopros == 8202:#8202
        if r.text == '6243': vernotime(r,'Молодец! ',2)
        else: nevernotime(r,'Неправильно. Верный ответ - 6243. ')

    elif vopros == 8203:#8203
        if r.text == '26': vernotime(r,'Совершенно верно) ',2)
        else: nevernotime(r,'Ошибочка. Верный ответ - 26. ')

    elif vopros == 8204:#8204
        if r.text.lower() == 'приватизация': vernotime(r,'Совершенно верно. ',1)
        else: nevernotime(r,'Мимо. Правильный ответ - "приватизация" ')

    elif vopros == 8205:#8205
        if r.text == '4651': vernotime(r,'В точку) ',2)
        else: nevernotime(r,'Промах. Правильный ответ 4651. ')

    elif vopros == 8206:#8206
        if r.text == '1523': vernotime(r,'Идеально! ',2)
        else: nevernotime(r,'Неверно. Правильное решение - 1523. ')

    elif vopros == 8207:#8207
        if r.text == '246': vernotime(r,'Точно! ',2)
        else: nevernotime(r,'Промах. Правильный ответ - 246. ')

    elif vopros == 8208:#8208
        if r.text == '345': vernotime(r,'Абсолюрно верно. ',2)
        else: nevernotime(r,'Не-а. Верный ответ - 345. ')

    elif vopros == 8209:#8209
        if r.text == '1235': vernotime(r,'Отлично)  ',2)
        else: nevernotime(r,'Ошибка. Правильный ответ - 1235. ')

    elif vopros == 8210:#8210
        if r.text.lower() == 'хрущёв': vernotime(r,'Совершенно верно! ',1)
        else: nevernotime(r,'Непопадание( Правильный ответ - Хрущёв. ')

    elif vopros == 8211:#8211
        if r.text == '419285': vernotime(r,'В точку) ',3)
        else: nevernotime(r,'Промах. Правильный ответ 419285. ')

    elif vopros == 8212:#8212
        if r.text == '156': vernotime(r,'Идеально! ',2)
        else: nevernotime(r,'Неверно. Правильное решение - 156. ')

    elif vopros == 8213:#8213
        if r.text.lower() == 'декабрь': vernotime(r,'Точно! ',1)
        else: nevernotime(r,'Промах. Правильный ответ - "декабрь" ')

    elif vopros == 8214:#8214
        if r.text.lower() == 'тула': vernotime(r,'Абсолюрно верно. ',1)
        else: nevernotime(r,'Не-а. Верный ответ - Тула. ')

    elif vopros == 8215:#8215
        if r.text.lower() == 'черчилль': vernotime(r,'Отлично)  ',1)
        else: nevernotime(r,'Ошибка. Правильный ответ - Черчилль. ')

    elif vopros == 8216:#8216
        if r.text == '245': vernotime(r,'Совершенно верно! ',2)
        else: nevernotime(r,'Непопадание( Верно - 245 ')

    elif vopros == 8217:#8217
        if r.text == '5431': vernotime(r,'Абсолюрно верно. ',2)
        else: nevernotime(r,'Не-а. Верный ответ - 5431. ')

    elif vopros == 8218:#8218
        if r.text == '25': vernotime(r,'Отлично)  ',1)
        else: nevernotime(r,'Ошибка. Правильный ответ - 25. ')

    elif vopros == 8219:#8219
        if r.text == '13': vernotime(r,'Совершенно верно! ',1)
        else: nevernotime(r,'Непопадание( Правильно было бы 13')

                    #Третий вариант
    elif vopros == 301:#301
        if r.text == '213': verno(r,'Неплохо для начала) Это было задание на 4 балла. Напомню, что СУММА баллов и время считается только в режиме "на время", не в этом.\n\nИдём дальше?')
        else: neverno(r,'Не-а. Правильный ответ - 213. Ничего, первый блин комом. Это было задание на 4 балла. Напомню, что СУММА баллов и время считается только в режиме "на время", не в этом.\n\nИдём дальше?')

    elif vopros == 302:#302
        if r.text == '4632': verno(r,'Молодец!\n\nПродолжим?')
        else: neverno(r,'Неправильно. Верный ответ - 4632\n\nПродолжим?')

    elif vopros == 303:#303
        if r.text == '34': verno(r,'Совершенно верно) \n\nДальше?')
        else: neverno(r,'Ошибочка. Верный ответ - 34\n\nДальше?')

    elif vopros == 304:#304
        if r.text.lower() == 'классические': verno(r,'Да, именно так.\n\nПродолжаем?')
        else: neverno(r,'Мимо. Верный ответ - "классические"\n\nПродолжаем?')

    elif vopros == 305:#305
        if r.text == '5236': verno(r,'В точку) \n\nЕдем далее?')
        else: neverno(r,'Промах. Правильный ответ 5236\n\nЕдем делее?')

    elif vopros == 306:#306
        if r.text == '1524': verno(r,'Идеально! \n\nИдём дальше?')
        else: neverno(r,'Неверно. Правильное решение  1524\n\nИдём дальше?')

    elif vopros == 307:#307
        if r.text == '146': verno(r,'Точно! \n\nПродолжим?')
        else: neverno(r,'Промах. Правильный ответ 146\n\nПродолжим?')

    elif vopros == 308:#308
        if r.text == '213': verno(r,'Хорошо) \n\nДалее?')
        else: neverno(r,'Не-а. Верный ответ такой: 213\n\nДалее?')

    elif vopros == 309:#309
        if r.text == '5614': verno(r,'Отлично) \n\nПродолжаем?')
        else: neverno(r,'Ошибка. Правильны ответ - 5614\n\nПродолжаем?')

    elif vopros == 310:#310
        if r.text.lower() == 'брежнев': verno(r,'Совершенно верно!\n\nЕдем далее?')
        else: neverno(r,'Непопадание( Правильный ответ - товарищ "Брежнев"\n\nЕдем далее?')
        
    elif vopros == 311:#311
        if r.text == '762415': verno(r,'Молодец! \n\nДалее?')
        else: neverno(r,'Не верно. Верный ответ такой: 762415\n\nДалее?')

    elif vopros == 312:#312
        if r.text == '345': verno(r,'Совершенно верно) \n\nПродолжаем?')
        else: neverno(r,'Ошибка. Правильны ответ - 345\n\nПродолжаем?')

    elif vopros == 313:#313
        if r.text.lower() == 'тарутино': verno(r,'Совершенно справедливо! \n\nПродолжаем?')
        else: neverno(r,'Непопадание( Правильно - "Тарутино"\n\nЕдем дальше?')   
        
    elif vopros == 314:#314
        if r.text.lower() in ('барклайде толли','барклайдетолли'): verno(r,'Отлично) \n\nПродолжаем?')
        else: neverno(r,'Ошибка. Правильны ответ - Барклайде Толли\n\nПродолжаем?')

    elif vopros == 315:#315
        if r.text.lower() == 'смоленск': verno(r,'Совершенно верно! \n\nЕдем делее?')
        else: neverno(r,'Непопадание( Правильный ответ - Смоленск\n\nЕдем делее?')
        
    elif vopros == 316:#316
        if r.text == '145': verno(r,'Молодец! \n\nДалее?')
        else: neverno(r,'Не верно. Верный ответ: 145\n\nДалее?')

    elif vopros == 317:#317
        if r.text == '1465': verno(r,'Совершенно верно) \n\nПродолжаем?')
        else: neverno(r,'Ошибка. Правильны ответ - 1465\n\nПродолжаем?')

    elif vopros == 318:#318
        if r.text == '15': verno(r,'Совершенно справедливо! \n\nИдём дальше?')
        else: neverno(r,'Непопадание(Правильно - 15\n\nИдём дальше?')
    elif vopros == 319:#319
        if r.text == '13': verno(r,'Совершенно справедливо! \n\nПродолжаем?')
        else: neverno(r,'Промах. Правильно - 13(\n\nПродолжаем?')


    elif vopros == 8301:#8301
        if r.text == '213': vernotime(r,'Неплохо для начала) ',1)
        else: nevernotime(r,'Не-а. Правильный ответ - 213. Ничего, первый блин комом. ')

    elif vopros == 8302:#8302
        if r.text == '4632': vernotime(r,'Молодец! ',2)
        else: nevernotime(r,'Неправильно. Верный ответ - 4632. ')

    elif vopros == 8303:#8303
        if r.text == '34': vernotime(r,'Совершенно верно) ',2)
        else: nevernotime(r,'Ошибочка. Верный ответ - 34. ')

    elif vopros == 8304:#8304
        if r.text.lower() == 'классические': vernotime(r,'Совершенно верно. ',1)
        else: nevernotime(r,'Мимо. Правильный ответ - "классические" ')

    elif vopros == 8305:#8305
        if r.text == '5236': vernotime(r,'В точку) ',2)
        else: nevernotime(r,'Промах. Правильный ответ 5236. ')

    elif vopros == 8306:#8306
        if r.text == '1524': vernotime(r,'Идеально! ',2)
        else: nevernotime(r,'Неверно. Правильное решение - 1524. ')

    elif vopros == 8307:#8307
        if r.text == '146': vernotime(r,'Точно! ',2)
        else: nevernotime(r,'Промах. Правильный ответ - 146. ')

    elif vopros == 8308:#8308
        if r.text == '213': vernotime(r,'Абсолюрно верно. ',2)
        else: nevernotime(r,'Не-а. Верный ответ - 213. ')

    elif vopros == 8309:#8309
        if r.text == '5614': vernotime(r,'Отлично)  ',2)
        else: nevernotime(r,'Ошибка. Правильный ответ - 5614. ')

    elif vopros == 8310:#8310
        if r.text.lower() == 'брежнев': vernotime(r,'Совершенно верно! ',1)
        else: nevernotime(r,'Непопадание( Правильный ответ - Брежнев. ')

    elif vopros == 8311:#8311
        if r.text == '762415': vernotime(r,'В точку) ',3)
        else: nevernotime(r,'Промах. Правильный ответ 762415. ')

    elif vopros == 8312:#8312
        if r.text == '345': vernotime(r,'Идеально! ',2)
        else: nevernotime(r,'Неверно. Правильное решение - 345. ')

    elif vopros == 8313:#8313
        if r.text.lower() == 'тарутино': vernotime(r,'Точно! ',1)
        else: nevernotime(r,'Промах. Правильный ответ - "Тарутино" ')

    elif vopros == 8314:#8214
        if r.text.lower in ('барклайдетолли','барклайде толли'): vernotime(r,'Абсолюрно верно. ',1)
        else: nevernotime(r,'Не-а. Верный ответ - Барклайде Толли. ')

    elif vopros == 8315:#8315
        if r.text.lower() == 'смоленск': vernotime(r,'Отлично)  ',1)
        else: nevernotime(r,'Ошибка. Правильный ответ - Смоленск. ')

    elif vopros == 8316:#8316
        if r.text == '145': vernotime(r,'Совершенно верно! ',2)
        else: nevernotime(r,'Непопадание( Верно - 145 ')

    elif vopros == 8317:#8317
        if r.text == '1465': vernotime(r,'Абсолюрно верно. ',2)
        else: nevernotime(r,'Не-а. Верный ответ - 1465. ')

    elif vopros == 8318:#8318
        if r.text == '15': vernotime(r,'Отлично)  ',1)
        else: nevernotime(r,'Ошибка. Правильный ответ - 15. ')

    elif vopros == 8319:#8319
        if r.text == '13': vernotime(r,'Совершенно верно! ',1)
        else: nevernotime(r,'Непопадание( Правильно было бы 13')

                    #Четвёртый вариант

    elif vopros == 401:#401
        if r.text == '132': verno(r,'Неплохо для начала) Это было задание на 4 балла. Напомню, что СУММА баллов и время считается только в режиме "на время", не в этом.\n\nИдём дальше?')
        else: neverno(r,'Не-а. Правильный ответ - 132. Ничего, первый блин комом. Это было задание на 4 балла. Напомню, что СУММА баллов и время считается только в режиме "на время", не в этом.\n\nИдём дальше?')

    elif vopros == 402:#402
        if r.text == '3426': verno(r,'Молодец!\n\nПродолжим?')
        else: neverno(r,'Неправильно. Верный ответ - 3426\n\nПродолжим?')

    elif vopros == 403:#403
        if r.text == '46': verno(r,'Совершенно верно) \n\nДальше?')
        else: neverno(r,'Ошибочка. Верный ответ - 46\n\nДальше?')

    elif vopros == 404:#404
        if r.text.lower() == 'кулачество': verno(r,'Да, именно так.\n\nПродолжаем?')
        else: neverno(r,'Мимо. Верный ответ - "кулачество"\n\nПродолжаем?')

    elif vopros == 405:#405
        if r.text == '2641': verno(r,'В точку) \n\nЕдем далее?')
        else: neverno(r,'Промах. Правильный ответ 2641\n\nЕдем делее?')

    elif vopros == 406:#406
        if r.text == '1346': verno(r,'Идеально! \n\nИдём дальше?')
        else: neverno(r,'Неверно. Правильное решение  1346\n\nИдём дальше?')

    elif vopros == 407:#407
        if r.text == '235': verno(r,'Точно! \n\nПродолжим?')
        else: neverno(r,'Промах. Правильный ответ 235\n\nПродолжим?')

    elif vopros == 408:#408
        if r.text == '615': verno(r,'Хорошо) \n\nДалее?')
        else: neverno(r,'Не-а. Верный ответ такой: 615\n\nДалее?')

    elif vopros == 409:#409
        if r.text == '5146': verno(r,'Отлично) \n\nПродолжаем?')
        else: neverno(r,'Ошибка. Правильны ответ - 5146\n\nПродолжаем?')

    elif vopros == 410:#410
        if r.text.lower() == 'хрущёв': verno(r,'Совершенно верно!\n\nЕдем далее?')
        else: neverno(r,'Непопадание( Правильный ответ - товарищ "Хрущёв"\n\nЕдем далее?')
        
    elif vopros == 411:#411
        if r.text == '695248': verno(r,'Молодец! \n\nДалее?')
        else: neverno(r,'Не верно. Верный ответ такой: 695248\n\nДалее?')

    elif vopros == 412:#412
        if r.text == '146': verno(r,'Совершенно верно) \n\nПродолжаем?')
        else: neverno(r,'Ошибка. Правильны ответ - 146\n\nПродолжаем?')

    elif vopros == 413:#413
        if r.text.lower() == 'пятидесятым': verno(r,'Совершенно справедливо! \n\nПродолжаем?')
        else: neverno(r,'Непопадание( Правильно - "пятидесятым"\n\nЕдем дальше?')   
        
    elif vopros == 414:#414
        if r.text.lower() in ('александр первый','александрпервый'): verno(r,'Отлично) \n\nПродолжаем?')
        else: neverno(r,'Ошибка. Правильны ответ -  Александр Первый\n\nПродолжаем?')

    elif vopros == 415:#415
        if r.text.lower() == 'финляндия': verno(r,'Совершенно верно! \n\nЕдем делее?')
        else: neverno(r,'Непопадание( Правильный ответ - Финляндия\n\nЕдем делее?')
        
    elif vopros == 416:#416
        if r.text == '146': verno(r,'Молодец! \n\nДалее?')
        else: neverno(r,'Не верно. Верный ответ: 146\n\nДалее?')

    elif vopros == 417:#417
        if r.text == '1264': verno(r,'Совершенно верно) \n\nПродолжаем?')
        else: neverno(r,'Ошибка. Правильны ответ - 1264\n\nПродолжаем?')

    elif vopros == 418:#418
        if r.text == '25': verno(r,'Совершенно справедливо! \n\nИдём дальше?')
        else: neverno(r,'Непопадание(Правильно - 25\n\nИдём дальше?')
    elif vopros == 419:#419
        if r.text == '12': verno(r,'Совершенно справедливо! \n\nПродолжаем?')
        else: neverno(r,'Промах. Правильно - 12(\n\nПродолжаем?')


    elif vopros == 8401:#8401
        if r.text == '132': vernotime(r,'Неплохо для начала) ',1)
        else: nevernotime(r,'Не-а. Правильный ответ - 132. Ничего, первый блин комом. ')

    elif vopros == 8402:#8402
        if r.text == '3426': vernotime(r,'Молодец! ',2)
        else: nevernotime(r,'Неправильно. Верный ответ - 3426. ')

    elif vopros == 8403:#8403
        if r.text == '46': vernotime(r,'Совершенно верно) ',2)
        else: nevernotime(r,'Ошибочка. Верный ответ - 46. ')

    elif vopros == 8404:#8404
        if r.text.lower() == 'кулачество': vernotime(r,'Совершенно верно. ',1)
        else: nevernotime(r,'Мимо. Правильный ответ - "кулачество" ')

    elif vopros == 8405:#8405
        if r.text == '2641': vernotime(r,'В точку) ',2)
        else: nevernotime(r,'Промах. Правильный ответ 2641. ')

    elif vopros == 8406:#8406
        if r.text == '1346': vernotime(r,'Идеально! ',2)
        else: nevernotime(r,'Неверно. Правильное решение - 1346. ')

    elif vopros == 8407:#8407
        if r.text == '235': vernotime(r,'Точно! ',2)
        else: nevernotime(r,'Промах. Правильный ответ - 235. ')

    elif vopros == 8408:#8408
        if r.text == '615': vernotime(r,'Абсолюрно верно. ',2)
        else: nevernotime(r,'Не-а. Верный ответ - 615. ')

    elif vopros == 8409:#8409
        if r.text == '5146': vernotime(r,'Отлично)  ',2)
        else: nevernotime(r,'Ошибка. Правильный ответ - 5146. ')

    elif vopros == 8410:#8410
        if r.text.lower() == 'хрущёв': vernotime(r,'Совершенно верно! ',1)
        else: nevernotime(r,'Непопадание( Правильный ответ - Хрущёв. ')

    elif vopros == 8411:#8411
        if r.text == '695248': vernotime(r,'В точку) ',3)
        else: nevernotime(r,'Промах. Правильный ответ 695248. ')

    elif vopros == 8412:#8412
        if r.text == '146': vernotime(r,'Идеально! ',2)
        else: nevernotime(r,'Неверно. Правильное решение - 146. ')

    elif vopros == 8413:#8413
        if r.text.lower() == 'пятидесятым': vernotime(r,'Точно! ',1)
        else: nevernotime(r,'Промах. Правильный ответ - "пятидесятым" ')

    elif vopros == 8414:#8414
        if r.text.lower in ('александр первый','александрпервый'): vernotime(r,'Абсолюрно верно. ',1)
        else: nevernotime(r,'Не-а. Верный ответ - Александр Первый. ')

    elif vopros == 8415:#8415
        if r.text.lower() == 'финляндия': vernotime(r,'Отлично)  ',1)
        else: nevernotime(r,'Ошибка. Правильный ответ - Финляндия. ')

    elif vopros == 8416:#8416
        if r.text == '146': vernotime(r,'Совершенно верно! ',2)
        else: nevernotime(r,'Непопадание( Верно - 146 ')

    elif vopros == 8417:#8417
        if r.text == '1264': vernotime(r,'Абсолюрно верно. ',2)
        else: nevernotime(r,'Не-а. Верный ответ - 1264. ')

    elif vopros == 8418:#8418
        if r.text == '25': vernotime(r,'Отлично)  ',1)
        else: nevernotime(r,'Ошибка. Правильный ответ - 25. ')

    elif vopros == 8419:#8419
        if r.text == '12': vernotime(r,'Совершенно верно! ',1)
        else: nevernotime(r,'Непопадание( Правильно было бы 12')

#Эта херня обрабатывает нажатие юзером тех или иных кнопок на инлайн клавиатуре    
@bot.callback_query_handler(func=lambda c: True)
def inline(c):
    if c.data == 'Решать ЕГЭ на время':
        smena(c.message,'Wellcome to hell 3:D Этот режим имитирует ЕГЭ, с тем отличием, что набранные баллы ты узнаёшь сразу. \
Остановить время нельзя, при выходе из режима набранные баллы сгорят. Даётся 3 часа 55 минут времени.',keyboard_reshat_na_vremia,kluchkovar)
        
    elif c.data == 'Решать ЕГЭ не на время':
        smena(c.message,'В этом режиме нет времени и подсчёта суммы баллов, он позволит \
тебе не торопясь проработать варианты. Приступим?',keyboard_reshat_ne_na_vremia,kluch)
        
    elif c.data == 'На главную':
        smena(c.message,'Мы на главной.',keyboard,kluch)
        sost[c.from_user.id] = [0,0,2000000000,0]
    elif c.data == 'Начать':
        smena(c.message,'Выбери вариант',keyboard_variant_ne_time,kluch)
    elif c.data == 'Поехали!':
        smena(c.message,'Ща поедем) Только выбери вариант)',keyboard_variant_time,kluchvesel)
    elif c.data == 'Узнать ответ':
        try:
                    #Первый вариант
            if sost[c.from_user.id][0] == 120:#120
                bot.edit_message_text(chat_id = c.message.chat.id, message_id=c.message.message_id, text = otvet1_20,reply_markup = prinetime2024(c.from_user.id))
            elif sost[c.from_user.id][0] == 121:#121
                bot.edit_message_text(chat_id = c.message.chat.id, message_id=c.message.message_id, text = otvet1_21,reply_markup = prinetime2024(c.from_user.id))
            elif sost[c.from_user.id][0] == 122:#122
                bot.edit_message_text(chat_id = c.message.chat.id, message_id=c.message.message_id, text = otvet1_22,reply_markup = prinetime2024(c.from_user.id))
            elif sost[c.from_user.id][0] == 123:#123
                bot.edit_message_text(chat_id = c.message.chat.id, message_id=c.message.message_id, text = otvet1_23,reply_markup = prinetime2024(c.from_user.id))
            elif sost[c.from_user.id][0] == 124:#124
                bot.edit_message_text(chat_id = c.message.chat.id, message_id=c.message.message_id, text = otvet1_24,reply_markup = prinetime2024(c.from_user.id))
            elif sost[c.from_user.id][0] == 125:#125
                bot.edit_message_text(chat_id = c.message.chat.id, message_id=c.message.message_id, text = otvet1_25,reply_markup = prinetime25(c.from_user.id))

            elif sost[c.from_user.id][0] == 8120:#8120
                bot.edit_message_text(chat_id = c.message.chat.id, message_id=c.message.message_id, text = otvet1_20,reply_markup = privoprosetime2024(c.from_user.id))
            elif sost[c.from_user.id][0] == 8121:#8121
                bot.edit_message_text(chat_id = c.message.chat.id, message_id=c.message.message_id, text = otvet1_21,reply_markup = privoprosetime2024(c.from_user.id))
            elif sost[c.from_user.id][0] == 8122:#8122
                bot.edit_message_text(chat_id = c.message.chat.id, message_id=c.message.message_id, text = otvet1_22,reply_markup = privoprosetime2024(c.from_user.id))
            elif sost[c.from_user.id][0] == 8123:#8123
                bot.edit_message_text(chat_id = c.message.chat.id, message_id=c.message.message_id, text = otvet1_23,reply_markup = privoprosetime2024(c.from_user.id))
            elif sost[c.from_user.id][0] == 8124:#8124
                bot.edit_message_text(chat_id = c.message.chat.id, message_id=c.message.message_id, text = otvet1_24,reply_markup = privoprosetime2024(c.from_user.id))
            elif sost[c.from_user.id][0] == 8125:#8125
                bot.edit_message_text(chat_id = c.message.chat.id, message_id=c.message.message_id, text = otvet1_25,reply_markup = privoprosetime25(c.from_user.id))
                
                    #Второй вариант
            elif sost[c.from_user.id][0] == 220:#220
                bot.edit_message_text(chat_id = c.message.chat.id, message_id=c.message.message_id, text = otvet2_20,reply_markup = prinetime2024(c.from_user.id))
            elif sost[c.from_user.id][0] == 221:#221
                bot.edit_message_text(chat_id = c.message.chat.id, message_id=c.message.message_id, text = otvet2_21,reply_markup = prinetime2024(c.from_user.id))
            elif sost[c.from_user.id][0] == 222:#222
                bot.edit_message_text(chat_id = c.message.chat.id, message_id=c.message.message_id, text = otvet2_22,reply_markup = prinetime2024(c.from_user.id))
            elif sost[c.from_user.id][0] == 223:#223
                bot.edit_message_text(chat_id = c.message.chat.id, message_id=c.message.message_id, text = otvet2_23,reply_markup = prinetime2024(c.from_user.id))
            elif sost[c.from_user.id][0] == 224:#224
                bot.edit_message_text(chat_id = c.message.chat.id, message_id=c.message.message_id, text = otvet2_24,reply_markup = prinetime2024(c.from_user.id))
            elif sost[c.from_user.id][0] == 225:#225
                bot.edit_message_text(chat_id = c.message.chat.id, message_id=c.message.message_id, text = otvet2_25,reply_markup = prinetime25(c.from_user.id))
                
            elif sost[c.from_user.id][0] == 8220:#8220
                bot.edit_message_text(chat_id = c.message.chat.id, message_id=c.message.message_id, text = otvet2_20,reply_markup = privoprosetime2024(c.from_user.id))
            elif sost[c.from_user.id][0] == 8221:#8221
                bot.edit_message_text(chat_id = c.message.chat.id, message_id=c.message.message_id, text = otvet2_21,reply_markup = privoprosetime2024(c.from_user.id))
            elif sost[c.from_user.id][0] == 8222:#8222
                bot.edit_message_text(chat_id = c.message.chat.id, message_id=c.message.message_id, text = otvet2_22,reply_markup = privoprosetime2024(c.from_user.id))
            elif sost[c.from_user.id][0] == 8223:#8223
                bot.edit_message_text(chat_id = c.message.chat.id, message_id=c.message.message_id, text = otvet2_23,reply_markup = privoprosetime2024(c.from_user.id))
            elif sost[c.from_user.id][0] == 8224:#8224
                bot.edit_message_text(chat_id = c.message.chat.id, message_id=c.message.message_id, text = otvet2_24,reply_markup = privoprosetime2024(c.from_user.id))
            elif sost[c.from_user.id][0] == 8225:#8225
                bot.edit_message_text(chat_id = c.message.chat.id, message_id=c.message.message_id, text = otvet2_25,reply_markup = privoprosetime25(c.from_user.id))

                    #Третий вариант
            elif sost[c.from_user.id][0] == 320:#320
                bot.edit_message_text(chat_id = c.message.chat.id, message_id=c.message.message_id, text = otvet3_20,reply_markup = prinetime2024(c.from_user.id))
            elif sost[c.from_user.id][0] == 321:#321
                bot.edit_message_text(chat_id = c.message.chat.id, message_id=c.message.message_id, text = otvet3_21,reply_markup = prinetime2024(c.from_user.id))
            elif sost[c.from_user.id][0] == 322:#322
                bot.edit_message_text(chat_id = c.message.chat.id, message_id=c.message.message_id, text = otvet3_22,reply_markup = prinetime2024(c.from_user.id))
            elif sost[c.from_user.id][0] == 323:#323
                bot.edit_message_text(chat_id = c.message.chat.id, message_id=c.message.message_id, text = otvet3_23,reply_markup = prinetime2024(c.from_user.id))
            elif sost[c.from_user.id][0] == 324:#324
                bot.edit_message_text(chat_id = c.message.chat.id, message_id=c.message.message_id, text = otvet3_24,reply_markup = prinetime2024(c.from_user.id))
            elif sost[c.from_user.id][0] == 325:#325
                bot.edit_message_text(chat_id = c.message.chat.id, message_id=c.message.message_id, text = otvet3_25,reply_markup = prinetime25(c.from_user.id))
                
            elif sost[c.from_user.id][0] == 8320:#8320
                bot.edit_message_text(chat_id = c.message.chat.id, message_id=c.message.message_id, text = otvet3_20,reply_markup = privoprosetime2024(c.from_user.id))
            elif sost[c.from_user.id][0] == 8321:#8321
                bot.edit_message_text(chat_id = c.message.chat.id, message_id=c.message.message_id, text = otvet3_21,reply_markup = privoprosetime2024(c.from_user.id))
            elif sost[c.from_user.id][0] == 8322:#8322
                bot.edit_message_text(chat_id = c.message.chat.id, message_id=c.message.message_id, text = otvet3_22,reply_markup = privoprosetime2024(c.from_user.id))
            elif sost[c.from_user.id][0] == 8323:#8323
                bot.edit_message_text(chat_id = c.message.chat.id, message_id=c.message.message_id, text = otvet3_23,reply_markup = privoprosetime2024(c.from_user.id))
            elif sost[c.from_user.id][0] == 8324:#8324
                bot.edit_message_text(chat_id = c.message.chat.id, message_id=c.message.message_id, text = otvet3_24,reply_markup = privoprosetime2024(c.from_user.id))
            elif sost[c.from_user.id][0] == 8325:#8325
                bot.edit_message_text(chat_id = c.message.chat.id, message_id=c.message.message_id, text = otvet3_25,reply_markup = privoprosetime25(c.from_user.id))

                    #Четвёртый вариант
            elif sost[c.from_user.id][0] == 420:#420
                bot.edit_message_text(chat_id = c.message.chat.id, message_id=c.message.message_id, text = otvet4_20,reply_markup = prinetime2024(c.from_user.id))
            elif sost[c.from_user.id][0] == 421:#421
                bot.edit_message_text(chat_id = c.message.chat.id, message_id=c.message.message_id, text = otvet4_21,reply_markup = prinetime2024(c.from_user.id))
            elif sost[c.from_user.id][0] == 422:#422
                bot.edit_message_text(chat_id = c.message.chat.id, message_id=c.message.message_id, text = otvet4_22,reply_markup = prinetime2024(c.from_user.id))
            elif sost[c.from_user.id][0] == 423:#423
                bot.edit_message_text(chat_id = c.message.chat.id, message_id=c.message.message_id, text = otvet4_23,reply_markup = prinetime2024(c.from_user.id))
            elif sost[c.from_user.id][0] == 424:#424
                bot.edit_message_text(chat_id = c.message.chat.id, message_id=c.message.message_id, text = otvet4_24,reply_markup = prinetime2024(c.from_user.id))
            elif sost[c.from_user.id][0] == 425:#425
                bot.edit_message_text(chat_id = c.message.chat.id, message_id=c.message.message_id, text = otvet4_25,reply_markup = prinetime25(c.from_user.id))
                
            elif sost[c.from_user.id][0] == 8420:#8420
                bot.edit_message_text(chat_id = c.message.chat.id, message_id=c.message.message_id, text = otvet4_20,reply_markup = privoprosetime2024(c.from_user.id))
            elif sost[c.from_user.id][0] == 8421:#8421
                bot.edit_message_text(chat_id = c.message.chat.id, message_id=c.message.message_id, text = otvet4_21,reply_markup = privoprosetime2024(c.from_user.id))
            elif sost[c.from_user.id][0] == 8422:#8422
                bot.edit_message_text(chat_id = c.message.chat.id, message_id=c.message.message_id, text = otvet4_22,reply_markup = privoprosetime2024(c.from_user.id))
            elif sost[c.from_user.id][0] == 8423:#8423
                bot.edit_message_text(chat_id = c.message.chat.id, message_id=c.message.message_id, text = otvet4_23,reply_markup = privoprosetime2024(c.from_user.id))
            elif sost[c.from_user.id][0] == 8424:#8424
                bot.edit_message_text(chat_id = c.message.chat.id, message_id=c.message.message_id, text = otvet4_24,reply_markup = privoprosetime2024(c.from_user.id))
            elif sost[c.from_user.id][0] == 8425:#8425
                bot.edit_message_text(chat_id = c.message.chat.id, message_id=c.message.message_id, text = otvet4_25,reply_markup = privoprosetime25(c.from_user.id))
        except:
            pass

              
    elif c.data == 'Осталось времени':
        if sost[c.from_user.id][3] == 0:
            if sost[c.from_user.id][0] % 100 < 20:
                bot.edit_message_text(chat_id = c.message.chat.id, message_id=c.message.message_id, text=c.message.text+'\n\n'+skokostalos(c.from_user.id),reply_markup = privoprosetime(c.from_user.id))
            elif sost[c.from_user.id][0] % 100 < 25:
                bot.edit_message_text(chat_id = c.message.chat.id, message_id=c.message.message_id, text=c.message.text+'\n\n'+skokostalos(c.from_user.id),reply_markup = privoprosetime2024(c.from_user.id))
            elif sost[c.from_user.id][0] % 100 == 25:
                bot.edit_message_text(chat_id = c.message.chat.id, message_id=c.message.message_id, text=c.message.text+'\n\n'+skokostalos(c.from_user.id),reply_markup = privoprosetime25(c.from_user.id))                
        elif sost[c.from_user.id][3] == 1:
            if sost[c.from_user.id][0] % 100 < 20:
                bot.edit_message_text(chat_id = c.message.chat.id, message_id=c.message.message_id, text=c.message.text+'\n\n'+skokostalos(c.from_user.id),reply_markup = priotvetetime(c.from_user.id))
            elif sost[c.from_user.id][0] % 100 < 25:
                bot.edit_message_text(chat_id = c.message.chat.id, message_id=c.message.message_id, text=c.message.text+'\n\n'+skokostalos(c.from_user.id),reply_markup = priotvetetime2024(c.from_user.id))
            elif sost[c.from_user.id][0] % 100 == 25:
                bot.edit_message_text(chat_id = c.message.chat.id, message_id=c.message.message_id, text=c.message.text+'\n\n'+skokostalos(c.from_user.id),reply_markup = priotvetetime25(c.from_user.id))                
                    #Первый вариант            
    elif c.data == '101':
        sost[c.from_user.id][0] = 101
        smena(c.message,Q1_1,prinetime(c.from_user.id),kluch)
    elif c.data == '102':
        sost[c.from_user.id][0] = 102
        smena(c.message,Q1_2,prinetime(c.from_user.id),kluch)
    elif c.data == '103':
        sost[c.from_user.id][0] = 103
        smena(c.message,Q1_3,prinetime(c.from_user.id),kluch)
    elif c.data == '104':
        sost[c.from_user.id][0] = 104
        smena(c.message,Q1_4,prinetime(c.from_user.id),kluch)
    elif c.data == '105':
        sost[c.from_user.id][0] = 105
        smena(c.message,Q1_5,prinetime(c.from_user.id),kluch)
    elif c.data == '106':
        sost[c.from_user.id][0] = 106
        smena(c.message,Q1_6,prinetime(c.from_user.id),kluch)
    elif c.data == '107':
        sost[c.from_user.id][0] = 107
        smena(c.message,Q1_7,prinetime(c.from_user.id),kluch)
    elif c.data == '108':
        sost[c.from_user.id][0] = 108
        smena(c.message,Q1_8,prinetime(c.from_user.id),kluch)
    elif c.data == '109':
        sost[c.from_user.id][0] = 109
        smena(c.message,Q1_9,prinetime(c.from_user.id),kluch)
    elif c.data == '110':
        sost[c.from_user.id][0] = 110
        smena(c.message,Q1_10,prinetime(c.from_user.id),kluch)
    elif c.data == '111':
        sost[c.from_user.id][0] = 111
        smena(c.message,Q1_11,prinetime(c.from_user.id),kluch)
    elif c.data == '112':
        sost[c.from_user.id][0] = 112
        smena(c.message,Q1_12,prinetime(c.from_user.id),kluch)
    elif c.data == '113':
        sost[c.from_user.id][0] = 113
        smena(c.message,Q1_13,prinetime(c.from_user.id),pic1_13_16)
    elif c.data == '114':
        sost[c.from_user.id][0] = 114
        smena(c.message,Q1_14,prinetime(c.from_user.id),pic1_13_16)
    elif c.data == '115':
        sost[c.from_user.id][0] = 115
        smena(c.message,Q1_15,prinetime(c.from_user.id),pic1_13_16)
    elif c.data == '116':
        sost[c.from_user.id][0] = 116
        smena(c.message,Q1_16,prinetime(c.from_user.id),pic1_13_16)
    elif c.data == '117':
        sost[c.from_user.id][0] = 117
        smena(c.message,Q1_17,prinetime(c.from_user.id),kluch)
    elif c.data == '118':
        sost[c.from_user.id][0] = 118
        smena(c.message,Q1_18,prinetime(c.from_user.id),pic1_18)
    elif c.data == '119':
        sost[c.from_user.id][0] = 119
        smena(c.message,Q1_19,prinetime(c.from_user.id),pic1_19)
    elif c.data == '120':
        sost[c.from_user.id][0] = 120
        smena(c.message,Q1_20,prinetime2024(c.from_user.id),kluch)
    elif c.data == '121':
        sost[c.from_user.id][0] = 121
        smena(c.message,Q1_21,prinetime2024(c.from_user.id),kluch)
    elif c.data == '122':
        sost[c.from_user.id][0] = 122
        smena(c.message,Q1_22,prinetime2024(c.from_user.id),kluch)
    elif c.data == '123':
        sost[c.from_user.id][0] = 123
        smena(c.message,Q1_23,prinetime2024(c.from_user.id),kluch)
    elif c.data == '124':
        sost[c.from_user.id][0] = 124
        smena(c.message,Q1_24,prinetime2024(c.from_user.id),kluch)
    elif c.data == '125':
        sost[c.from_user.id][0] = 125
        smena(c.message,Q1_25,prinetime25(c.from_user.id),kluch)

    elif c.data == '8101':
        sost[c.from_user.id][0] = 8101
        sost[c.from_user.id][2] = int(time.time())+14100
        sost[c.from_user.id][3] = 0
        smena(c.message,Q1_1,privoprosetime(c.from_user.id),kluch)
    elif c.data == '8102':
        sost[c.from_user.id][0] = 8102
        sost[c.from_user.id][3] = 0
        smena(c.message,Q1_2,privoprosetime(c.from_user.id),kluch)
    elif c.data == '8103':
        sost[c.from_user.id][0] = 8103
        sost[c.from_user.id][3] = 0
        smena(c.message,Q1_3,privoprosetime(c.from_user.id),kluch)
    elif c.data == '8104':
        sost[c.from_user.id][0] = 8104
        sost[c.from_user.id][3] = 0
        smena(c.message,Q1_4,privoprosetime(c.from_user.id),kluch)
    elif c.data == '8105':
        sost[c.from_user.id][0] = 8105
        sost[c.from_user.id][3] = 0
        smena(c.message,Q1_5,privoprosetime(c.from_user.id),kluch)
    elif c.data == '8106':
        sost[c.from_user.id][0] = 8106
        sost[c.from_user.id][3] = 0
        smena(c.message,Q1_6,privoprosetime(c.from_user.id),kluch)
    elif c.data == '8107':
        sost[c.from_user.id][0] = 8107
        sost[c.from_user.id][3] = 0
        smena(c.message,Q1_7,privoprosetime(c.from_user.id),kluch)
    elif c.data == '8108':
        sost[c.from_user.id][0] = 8108
        sost[c.from_user.id][3] = 0
        smena(c.message,Q1_8,privoprosetime(c.from_user.id),kluch)
    elif c.data == '8109':
        sost[c.from_user.id][0] = 8109
        sost[c.from_user.id][3] = 0
        smena(c.message,Q1_9,privoprosetime(c.from_user.id),kluch)
    elif c.data == '8110':
        sost[c.from_user.id][0] = 8110
        sost[c.from_user.id][3] = 0
        smena(c.message,Q1_10,privoprosetime(c.from_user.id),kluch)
    elif c.data == '8111':
        sost[c.from_user.id][0] = 8111
        sost[c.from_user.id][3] = 0
        smena(c.message,Q1_11,privoprosetime(c.from_user.id),kluch)
    elif c.data == '8112':
        sost[c.from_user.id][0] = 8112
        sost[c.from_user.id][3] = 0
        smena(c.message,Q1_12,privoprosetime(c.from_user.id),kluch)
    elif c.data == '8113':
        sost[c.from_user.id][0] = 8113
        sost[c.from_user.id][3] = 0
        smena(c.message,Q1_13,privoprosetime(c.from_user.id),pic1_13_16)
    elif c.data == '8114':
        sost[c.from_user.id][0] = 8114
        sost[c.from_user.id][3] = 0
        smena(c.message,Q1_14,privoprosetime(c.from_user.id),pic1_13_16)
    elif c.data == '8115':
        sost[c.from_user.id][0] = 8115
        sost[c.from_user.id][3] = 0
        smena(c.message,Q1_15,privoprosetime(c.from_user.id),pic1_13_16)
    elif c.data == '8116':
        sost[c.from_user.id][0] = 8116
        sost[c.from_user.id][3] = 0
        smena(c.message,Q1_16,privoprosetime(c.from_user.id),pic1_13_16)
    elif c.data == '8117':
        sost[c.from_user.id][0] = 8117
        sost[c.from_user.id][3] = 0
        smena(c.message,Q1_17,privoprosetime(c.from_user.id),kluch)
    elif c.data == '8118':
        sost[c.from_user.id][0] = 8118
        sost[c.from_user.id][3] = 0
        smena(c.message,Q1_18,privoprosetime(c.from_user.id),pic1_18)
    elif c.data == '8119':
        sost[c.from_user.id][0] = 8119
        sost[c.from_user.id][3] = 0
        smena(c.message,Q1_19,privoprosetime(c.from_user.id),pic1_19)
    elif c.data == '8120':
        sost[c.from_user.id][0] = 8120
        sost[c.from_user.id][3] = 0
        smena(c.message,Q1_20,privoprosetime2024(c.from_user.id),kluch)
    elif c.data == '8121':
        sost[c.from_user.id][0] = 8121
        sost[c.from_user.id][3] = 0
        smena(c.message,Q1_21,privoprosetime2024(c.from_user.id),kluch)
    elif c.data == '8122':
        sost[c.from_user.id][0] = 8122
        sost[c.from_user.id][3] = 0
        smena(c.message,Q1_22,privoprosetime2024(c.from_user.id),kluch)
    elif c.data == '8123':
        sost[c.from_user.id][0] = 8123
        sost[c.from_user.id][3] = 0
        smena(c.message,Q1_23,privoprosetime2024(c.from_user.id),kluch)
    elif c.data == '8124':
        sost[c.from_user.id][0] = 8124
        sost[c.from_user.id][3] = 0
        smena(c.message,Q1_24,privoprosetime2024(c.from_user.id),kluch)
    elif c.data == '8125':
        sost[c.from_user.id][0] = 8125
        sost[c.from_user.id][3] = 0
        smena(c.message,Q1_25,privoprosetime25(c.from_user.id),kluch)
                    #Второй вариант
    elif c.data == '201':
        sost[c.from_user.id][0] = 201
        smena(c.message,Q2_1,prinetime(c.from_user.id),kluch)
    elif c.data == '202':
        sost[c.from_user.id][0] = 202
        smena(c.message,Q2_2,prinetime(c.from_user.id),kluch)
    elif c.data == '203':
        sost[c.from_user.id][0] = 203
        smena(c.message,Q2_3,prinetime(c.from_user.id),kluch)
    elif c.data == '204':
        sost[c.from_user.id][0] = 204
        smena(c.message,Q2_4,prinetime(c.from_user.id),kluch)
    elif c.data == '205':
        sost[c.from_user.id][0] = 205
        smena(c.message,Q2_5,prinetime(c.from_user.id),kluch)
    elif c.data == '206':
        sost[c.from_user.id][0] = 206
        smena(c.message,Q2_6,prinetime(c.from_user.id),kluch)
    elif c.data == '207':
        sost[c.from_user.id][0] = 207
        smena(c.message,Q2_7,prinetime(c.from_user.id),kluch)
    elif c.data == '208':
        sost[c.from_user.id][0] = 208
        smena(c.message,Q2_8,prinetime(c.from_user.id),kluch)
    elif c.data == '209':
        sost[c.from_user.id][0] = 209
        smena(c.message,Q2_9,prinetime(c.from_user.id),kluch)
    elif c.data == '210':
        sost[c.from_user.id][0] = 210
        smena(c.message,Q2_10,prinetime(c.from_user.id),kluch)
    elif c.data == '211':
        sost[c.from_user.id][0] = 211
        smena(c.message,Q2_11,prinetime(c.from_user.id),kluch)
    elif c.data == '212':
        sost[c.from_user.id][0] = 212
        smena(c.message,Q2_12,prinetime(c.from_user.id),kluch)
    elif c.data == '213':
        sost[c.from_user.id][0] = 213
        smena(c.message,Q2_13,prinetime(c.from_user.id),pic2_13_16)
    elif c.data == '214':
        sost[c.from_user.id][0] = 214
        smena(c.message,Q2_14,prinetime(c.from_user.id),pic2_13_16)
    elif c.data == '215':
        sost[c.from_user.id][0] = 215
        smena(c.message,Q2_15,prinetime(c.from_user.id),pic2_13_16)
    elif c.data == '216':
        sost[c.from_user.id][0] = 216
        smena(c.message,Q2_16,prinetime(c.from_user.id),pic2_13_16)
    elif c.data == '217':
        sost[c.from_user.id][0] = 217
        smena(c.message,Q2_17,prinetime(c.from_user.id),kluch)
    elif c.data == '218':
        sost[c.from_user.id][0] = 218
        smena(c.message,Q2_18,prinetime(c.from_user.id),pic2_18)
    elif c.data == '219':
        sost[c.from_user.id][0] = 219
        smena(c.message,Q2_19,prinetime(c.from_user.id),pic2_19)
    elif c.data == '220':
        sost[c.from_user.id][0] = 220
        smena(c.message,Q2_20,prinetime2024(c.from_user.id),kluch)
    elif c.data == '221':
        sost[c.from_user.id][0] = 221
        smena(c.message,Q2_21,prinetime2024(c.from_user.id),kluch)
    elif c.data == '222':
        sost[c.from_user.id][0] = 222
        smena(c.message,Q2_22,prinetime2024(c.from_user.id),kluch)
    elif c.data == '223':
        sost[c.from_user.id][0] = 223
        smena(c.message,Q2_23,prinetime2024(c.from_user.id),kluch)
    elif c.data == '224':
        sost[c.from_user.id][0] = 224
        smena(c.message,Q2_24,prinetime2024(c.from_user.id),kluch)
    elif c.data == '225':
        sost[c.from_user.id][0] = 225
        smena(c.message,Q2_25,prinetime25(c.from_user.id),kluch)

    elif c.data == '8201':
        sost[c.from_user.id][0] = 8201
        sost[c.from_user.id][2] = int(time.time())+14100
        sost[c.from_user.id][3] = 0
        smena(c.message,Q2_1,privoprosetime(c.from_user.id),kluch)
    elif c.data == '8202':
        sost[c.from_user.id][0] = 8202
        sost[c.from_user.id][3] = 0
        smena(c.message,Q2_2,privoprosetime(c.from_user.id),kluch)
    elif c.data == '8203':
        sost[c.from_user.id][0] = 8203
        sost[c.from_user.id][3] = 0
        smena(c.message,Q2_3,privoprosetime(c.from_user.id),kluch)
    elif c.data == '8204':
        sost[c.from_user.id][0] = 8204
        sost[c.from_user.id][3] = 0
        smena(c.message,Q2_4,privoprosetime(c.from_user.id),kluch)
    elif c.data == '8205':
        sost[c.from_user.id][0] = 8205
        sost[c.from_user.id][3] = 0
        smena(c.message,Q2_5,privoprosetime(c.from_user.id),kluch)
    elif c.data == '8206':
        sost[c.from_user.id][0] = 8206
        sost[c.from_user.id][3] = 0
        smena(c.message,Q2_6,privoprosetime(c.from_user.id),kluch)
    elif c.data == '8207':
        sost[c.from_user.id][0] = 8207
        sost[c.from_user.id][3] = 0
        smena(c.message,Q2_7,privoprosetime(c.from_user.id),kluch)
    elif c.data == '8208':
        sost[c.from_user.id][0] = 8208
        sost[c.from_user.id][3] = 0
        smena(c.message,Q2_8,privoprosetime(c.from_user.id),kluch)
    elif c.data == '8209':
        sost[c.from_user.id][0] = 8209
        sost[c.from_user.id][3] = 0
        smena(c.message,Q2_9,privoprosetime(c.from_user.id),kluch)
    elif c.data == '8210':
        sost[c.from_user.id][0] = 8210
        sost[c.from_user.id][3] = 0
        smena(c.message,Q2_10,privoprosetime(c.from_user.id),kluch)
    elif c.data == '8211':
        sost[c.from_user.id][0] = 8211
        sost[c.from_user.id][3] = 0
        smena(c.message,Q2_11,privoprosetime(c.from_user.id),kluch)
    elif c.data == '8212':
        sost[c.from_user.id][0] = 8212
        sost[c.from_user.id][3] = 0
        smena(c.message,Q2_12,privoprosetime(c.from_user.id),kluch)
    elif c.data == '8213':
        sost[c.from_user.id][0] = 8213
        sost[c.from_user.id][3] = 0
        smena(c.message,Q2_13,privoprosetime(c.from_user.id),pic2_13_16)
    elif c.data == '8214':
        sost[c.from_user.id][0] = 8214
        sost[c.from_user.id][3] = 0
        smena(c.message,Q2_14,privoprosetime(c.from_user.id),pic2_13_16)
    elif c.data == '8215':
        sost[c.from_user.id][0] = 8215
        sost[c.from_user.id][3] = 0
        smena(c.message,Q2_15,privoprosetime(c.from_user.id),pic2_13_16)
    elif c.data == '8216':
        sost[c.from_user.id][0] = 8216
        sost[c.from_user.id][3] = 0
        smena(c.message,Q2_16,privoprosetime(c.from_user.id),pic2_13_16)
    elif c.data == '8217':
        sost[c.from_user.id][0] = 8217
        sost[c.from_user.id][3] = 0
        smena(c.message,Q2_17,privoprosetime(c.from_user.id),kluch)
    elif c.data == '8218':
        sost[c.from_user.id][0] = 8218
        sost[c.from_user.id][3] = 0
        smena(c.message,Q2_18,privoprosetime(c.from_user.id),pic2_18)
    elif c.data == '8219':
        sost[c.from_user.id][0] = 8219
        sost[c.from_user.id][3] = 0
        smena(c.message,Q2_19,privoprosetime(c.from_user.id),pic2_19)
    elif c.data == '8220':
        sost[c.from_user.id][0] = 8220
        sost[c.from_user.id][3] = 0
        smena(c.message,Q2_20,privoprosetime2024(c.from_user.id),kluch)
    elif c.data == '8221':
        sost[c.from_user.id][0] = 8221
        sost[c.from_user.id][3] = 0
        smena(c.message,Q2_21,privoprosetime2024(c.from_user.id),kluch)
    elif c.data == '8222':
        sost[c.from_user.id][0] = 8222
        sost[c.from_user.id][3] = 0
        smena(c.message,Q2_22,privoprosetime2024(c.from_user.id),kluch)
    elif c.data == '8223':
        sost[c.from_user.id][0] = 8223
        sost[c.from_user.id][3] = 0
        smena(c.message,Q2_23,privoprosetime2024(c.from_user.id),kluch)
    elif c.data == '8224':
        sost[c.from_user.id][0] = 8224
        sost[c.from_user.id][3] = 0
        smena(c.message,Q2_24,privoprosetime2024(c.from_user.id),kluch)
    elif c.data == '8225':
        sost[c.from_user.id][0] = 8225
        sost[c.from_user.id][3] = 0
        smena(c.message,Q2_25,privoprosetime25(c.from_user.id),kluch)

                    #Третий вариант
    
    elif c.data == '301':
        sost[c.from_user.id][0] = 301
        smena(c.message,Q3_1,prinetime(c.from_user.id),kluch)
    elif c.data == '302':
        sost[c.from_user.id][0] = 302
        smena(c.message,Q3_2,prinetime(c.from_user.id),kluch)
    elif c.data == '303':
        sost[c.from_user.id][0] = 303
        smena(c.message,Q3_3,prinetime(c.from_user.id),kluch)
    elif c.data == '304':
        sost[c.from_user.id][0] = 304
        smena(c.message,Q3_4,prinetime(c.from_user.id),kluch)
    elif c.data == '305':
        sost[c.from_user.id][0] = 305
        smena(c.message,Q3_5,prinetime(c.from_user.id),kluch)
    elif c.data == '306':
        sost[c.from_user.id][0] = 306
        smena(c.message,Q3_6,prinetime(c.from_user.id),kluch)
    elif c.data == '307':
        sost[c.from_user.id][0] = 307
        smena(c.message,Q3_7,prinetime(c.from_user.id),kluch)
    elif c.data == '308':
        sost[c.from_user.id][0] = 308
        smena(c.message,Q3_8,prinetime(c.from_user.id),kluch)
    elif c.data == '309':
        sost[c.from_user.id][0] = 309
        smena(c.message,Q3_9,prinetime(c.from_user.id),kluch)
    elif c.data == '310':
        sost[c.from_user.id][0] = 310
        smena(c.message,Q3_10,prinetime(c.from_user.id),kluch)
    elif c.data == '311':
        sost[c.from_user.id][0] = 311
        smena(c.message,Q3_11,prinetime(c.from_user.id),kluch)
    elif c.data == '312':
        sost[c.from_user.id][0] = 312
        smena(c.message,Q3_12,prinetime(c.from_user.id),kluch)
    elif c.data == '313':
        sost[c.from_user.id][0] = 313
        smena(c.message,Q3_13,prinetime(c.from_user.id),pic3_13_16)
    elif c.data == '314':
        sost[c.from_user.id][0] = 314
        smena(c.message,Q3_14,prinetime(c.from_user.id),pic3_13_16)
    elif c.data == '315':
        sost[c.from_user.id][0] = 315
        smena(c.message,Q3_15,prinetime(c.from_user.id),pic3_13_16)
    elif c.data == '316':
        sost[c.from_user.id][0] = 316
        smena(c.message,Q3_16,prinetime(c.from_user.id),pic3_13_16)
    elif c.data == '317':
        sost[c.from_user.id][0] = 317
        smena(c.message,Q3_17,prinetime(c.from_user.id),kluch)
    elif c.data == '318':
        sost[c.from_user.id][0] = 318
        smena(c.message,Q3_18,prinetime(c.from_user.id),pic3_18)
    elif c.data == '319':
        sost[c.from_user.id][0] = 319
        smena(c.message,Q3_19,prinetime(c.from_user.id),pic3_19)
    elif c.data == '320':
        sost[c.from_user.id][0] = 320
        smena(c.message,Q3_20,prinetime2024(c.from_user.id),kluch)
    elif c.data == '321':
        sost[c.from_user.id][0] = 321
        smena(c.message,Q3_21,prinetime2024(c.from_user.id),kluch)
    elif c.data == '322':
        sost[c.from_user.id][0] = 322
        smena(c.message,Q3_22,prinetime2024(c.from_user.id),kluch)
    elif c.data == '323':
        sost[c.from_user.id][0] = 323
        smena(c.message,Q3_23,prinetime2024(c.from_user.id),kluch)
    elif c.data == '324':
        sost[c.from_user.id][0] = 324
        smena(c.message,Q3_24,prinetime2024(c.from_user.id),kluch)
    elif c.data == '325':
        sost[c.from_user.id][0] = 325
        smena(c.message,Q3_25,prinetime25(c.from_user.id),kluch)

    elif c.data == '8301':
        sost[c.from_user.id][0] = 8301
        sost[c.from_user.id][2] = int(time.time())+14100
        sost[c.from_user.id][3] = 0
        smena(c.message,Q3_1,privoprosetime(c.from_user.id),kluch)
    elif c.data == '8302':
        sost[c.from_user.id][0] = 8302
        sost[c.from_user.id][3] = 0
        smena(c.message,Q3_2,privoprosetime(c.from_user.id),kluch)
    elif c.data == '8303':
        sost[c.from_user.id][0] = 8303
        sost[c.from_user.id][3] = 0
        smena(c.message,Q3_3,privoprosetime(c.from_user.id),kluch)
    elif c.data == '8304':
        sost[c.from_user.id][0] = 8304
        sost[c.from_user.id][3] = 0
        smena(c.message,Q3_4,privoprosetime(c.from_user.id),kluch)
    elif c.data == '8305':
        sost[c.from_user.id][0] = 8305
        sost[c.from_user.id][3] = 0
        smena(c.message,Q3_5,privoprosetime(c.from_user.id),kluch)
    elif c.data == '8306':
        sost[c.from_user.id][0] = 8306
        sost[c.from_user.id][3] = 0
        smena(c.message,Q3_6,privoprosetime(c.from_user.id),kluch)
    elif c.data == '8307':
        sost[c.from_user.id][0] = 8307
        sost[c.from_user.id][3] = 0
        smena(c.message,Q3_7,privoprosetime(c.from_user.id),kluch)
    elif c.data == '8308':
        sost[c.from_user.id][0] = 8308
        sost[c.from_user.id][3] = 0
        smena(c.message,Q3_8,privoprosetime(c.from_user.id),kluch)
    elif c.data == '8309':
        sost[c.from_user.id][0] = 8309
        sost[c.from_user.id][3] = 0
        smena(c.message,Q3_9,privoprosetime(c.from_user.id),kluch)
    elif c.data == '8310':
        sost[c.from_user.id][0] = 8310
        sost[c.from_user.id][3] = 0
        smena(c.message,Q3_10,privoprosetime(c.from_user.id),kluch)
    elif c.data == '8311':
        sost[c.from_user.id][0] = 8311
        sost[c.from_user.id][3] = 0
        smena(c.message,Q3_11,privoprosetime(c.from_user.id),kluch)
    elif c.data == '8312':
        sost[c.from_user.id][0] = 8312
        sost[c.from_user.id][3] = 0
        smena(c.message,Q3_12,privoprosetime(c.from_user.id),kluch)
    elif c.data == '8313':
        sost[c.from_user.id][0] = 8313
        sost[c.from_user.id][3] = 0
        smena(c.message,Q3_13,privoprosetime(c.from_user.id),pic3_13_16)
    elif c.data == '8314':
        sost[c.from_user.id][0] = 8314
        sost[c.from_user.id][3] = 0
        smena(c.message,Q3_14,privoprosetime(c.from_user.id),pic3_13_16)
    elif c.data == '8315':
        sost[c.from_user.id][0] = 8315
        sost[c.from_user.id][3] = 0
        smena(c.message,Q3_15,privoprosetime(c.from_user.id),pic3_13_16)
    elif c.data == '8316':
        sost[c.from_user.id][0] = 8316
        sost[c.from_user.id][3] = 0
        smena(c.message,Q3_16,privoprosetime(c.from_user.id),pic3_13_16)
    elif c.data == '8317':
        sost[c.from_user.id][0] = 8317
        sost[c.from_user.id][3] = 0
        smena(c.message,Q3_17,privoprosetime(c.from_user.id),kluch)
    elif c.data == '8318':
        sost[c.from_user.id][0] = 8318
        sost[c.from_user.id][3] = 0
        smena(c.message,Q3_18,privoprosetime(c.from_user.id),pic3_18)
    elif c.data == '8319':
        sost[c.from_user.id][0] = 8319
        sost[c.from_user.id][3] = 0
        smena(c.message,Q3_19,privoprosetime(c.from_user.id),pic3_19)
    elif c.data == '8320':
        sost[c.from_user.id][0] = 8320
        sost[c.from_user.id][3] = 0
        smena(c.message,Q3_20,privoprosetime2024(c.from_user.id),kluch)
    elif c.data == '8321':
        sost[c.from_user.id][0] = 8321
        sost[c.from_user.id][3] = 0
        smena(c.message,Q3_21,privoprosetime2024(c.from_user.id),kluch)
    elif c.data == '8322':
        sost[c.from_user.id][0] = 8322
        sost[c.from_user.id][3] = 0
        smena(c.message,Q3_22,privoprosetime2024(c.from_user.id),kluch)
    elif c.data == '8323':
        sost[c.from_user.id][0] = 8323
        sost[c.from_user.id][3] = 0
        smena(c.message,Q3_23,privoprosetime2024(c.from_user.id),kluch)
    elif c.data == '8324':
        sost[c.from_user.id][0] = 8324
        sost[c.from_user.id][3] = 0
        smena(c.message,Q3_24,privoprosetime2024(c.from_user.id),kluch)
    elif c.data == '8325':
        sost[c.from_user.id][0] = 8325
        sost[c.from_user.id][3] = 0
        smena(c.message,Q3_25,privoprosetime25(c.from_user.id),kluch)

                    #Четвёртый вариант
    elif c.data == '401':
        sost[c.from_user.id][0] = 401
        smena(c.message,Q4_1,prinetime(c.from_user.id),kluch)
    elif c.data == '402':
        sost[c.from_user.id][0] = 402
        smena(c.message,Q4_2,prinetime(c.from_user.id),kluch)
    elif c.data == '403':
        sost[c.from_user.id][0] = 403
        smena(c.message,Q4_3,prinetime(c.from_user.id),kluch)
    elif c.data == '404':
        sost[c.from_user.id][0] = 404
        smena(c.message,Q4_4,prinetime(c.from_user.id),kluch)
    elif c.data == '405':
        sost[c.from_user.id][0] = 405
        smena(c.message,Q4_5,prinetime(c.from_user.id),kluch)
    elif c.data == '406':
        sost[c.from_user.id][0] = 406
        smena(c.message,Q4_6,prinetime(c.from_user.id),kluch)
    elif c.data == '407':
        sost[c.from_user.id][0] = 407
        smena(c.message,Q4_7,prinetime(c.from_user.id),kluch)
    elif c.data == '408':
        sost[c.from_user.id][0] = 408
        smena(c.message,Q4_8,prinetime(c.from_user.id),kluch)
    elif c.data == '409':
        sost[c.from_user.id][0] = 409
        smena(c.message,Q4_9,prinetime(c.from_user.id),kluch)
    elif c.data == '410':
        sost[c.from_user.id][0] = 410
        smena(c.message,Q4_10,prinetime(c.from_user.id),kluch)
    elif c.data == '411':
        sost[c.from_user.id][0] = 411
        smena(c.message,Q4_11,prinetime(c.from_user.id),kluch)
    elif c.data == '412':
        sost[c.from_user.id][0] = 412
        smena(c.message,Q4_12,prinetime(c.from_user.id),kluch)
    elif c.data == '413':
        sost[c.from_user.id][0] = 413
        smena(c.message,Q4_13,prinetime(c.from_user.id),pic4_13_16)
    elif c.data == '414':
        sost[c.from_user.id][0] = 414
        smena(c.message,Q4_14,prinetime(c.from_user.id),pic4_13_16)
    elif c.data == '415':
        sost[c.from_user.id][0] = 415
        smena(c.message,Q4_15,prinetime(c.from_user.id),pic4_13_16)
    elif c.data == '416':
        sost[c.from_user.id][0] = 416
        smena(c.message,Q4_16,prinetime(c.from_user.id),pic4_13_16)
    elif c.data == '417':
        sost[c.from_user.id][0] = 417
        smena(c.message,Q4_17,prinetime(c.from_user.id),kluch)
    elif c.data == '418':
        sost[c.from_user.id][0] = 418
        smena(c.message,Q4_18,prinetime(c.from_user.id),pic4_18)
    elif c.data == '419':
        sost[c.from_user.id][0] = 419
        smena(c.message,Q4_19,prinetime(c.from_user.id),pic4_19)
    elif c.data == '420':
        sost[c.from_user.id][0] = 420
        smena(c.message,Q4_20,prinetime2024(c.from_user.id),kluch)
    elif c.data == '421':
        sost[c.from_user.id][0] = 421
        smena(c.message,Q4_21,prinetime2024(c.from_user.id),kluch)
    elif c.data == '422':
        sost[c.from_user.id][0] = 422
        smena(c.message,Q4_22,prinetime2024(c.from_user.id),kluch)
    elif c.data == '423':
        sost[c.from_user.id][0] = 423
        smena(c.message,Q4_23,prinetime2024(c.from_user.id),kluch)
    elif c.data == '424':
        sost[c.from_user.id][0] = 424
        smena(c.message,Q4_24,prinetime2024(c.from_user.id),kluch)
    elif c.data == '425':
        sost[c.from_user.id][0] = 425
        smena(c.message,Q4_25,prinetime25(c.from_user.id),kluch)

    elif c.data == '8401':
        sost[c.from_user.id][0] = 8401
        sost[c.from_user.id][2] = int(time.time())+14100
        sost[c.from_user.id][3] = 0
        smena(c.message,Q4_1,privoprosetime(c.from_user.id),kluch)
    elif c.data == '8402':
        sost[c.from_user.id][0] = 8402
        sost[c.from_user.id][3] = 0
        smena(c.message,Q4_2,privoprosetime(c.from_user.id),kluch)
    elif c.data == '8403':
        sost[c.from_user.id][0] = 8403
        sost[c.from_user.id][3] = 0
        smena(c.message,Q4_3,privoprosetime(c.from_user.id),kluch)
    elif c.data == '8404':
        sost[c.from_user.id][0] = 8404
        sost[c.from_user.id][3] = 0
        smena(c.message,Q4_4,privoprosetime(c.from_user.id),kluch)
    elif c.data == '8405':
        sost[c.from_user.id][0] = 8405
        sost[c.from_user.id][3] = 0
        smena(c.message,Q4_5,privoprosetime(c.from_user.id),kluch)
    elif c.data == '8406':
        sost[c.from_user.id][0] = 8406
        sost[c.from_user.id][3] = 0
        smena(c.message,Q4_6,privoprosetime(c.from_user.id),kluch)
    elif c.data == '8407':
        sost[c.from_user.id][0] = 8407
        sost[c.from_user.id][3] = 0
        smena(c.message,Q4_7,privoprosetime(c.from_user.id),kluch)
    elif c.data == '8408':
        sost[c.from_user.id][0] = 8408
        sost[c.from_user.id][3] = 0
        smena(c.message,Q4_8,privoprosetime(c.from_user.id),kluch)
    elif c.data == '8409':
        sost[c.from_user.id][0] = 8409
        sost[c.from_user.id][3] = 0
        smena(c.message,Q4_9,privoprosetime(c.from_user.id),kluch)
    elif c.data == '8410':
        sost[c.from_user.id][0] = 8410
        sost[c.from_user.id][3] = 0
        smena(c.message,Q4_10,privoprosetime(c.from_user.id),kluch)
    elif c.data == '8411':
        sost[c.from_user.id][0] = 8411
        sost[c.from_user.id][3] = 0
        smena(c.message,Q4_11,privoprosetime(c.from_user.id),kluch)
    elif c.data == '8412':
        sost[c.from_user.id][0] = 8412
        sost[c.from_user.id][3] = 0
        smena(c.message,Q4_12,privoprosetime(c.from_user.id),kluch)
    elif c.data == '8413':
        sost[c.from_user.id][0] = 8413
        sost[c.from_user.id][3] = 0
        smena(c.message,Q4_13,privoprosetime(c.from_user.id),pic4_13_16)
    elif c.data == '8414':
        sost[c.from_user.id][0] = 8414
        sost[c.from_user.id][3] = 0
        smena(c.message,Q4_14,privoprosetime(c.from_user.id),pic4_13_16)
    elif c.data == '8415':
        sost[c.from_user.id][0] = 8415
        sost[c.from_user.id][3] = 0
        smena(c.message,Q4_15,privoprosetime(c.from_user.id),pic4_13_16)
    elif c.data == '8416':
        sost[c.from_user.id][0] = 8416
        sost[c.from_user.id][3] = 0
        smena(c.message,Q4_16,privoprosetime(c.from_user.id),pic4_13_16)
    elif c.data == '8417':
        sost[c.from_user.id][0] = 8417
        sost[c.from_user.id][3] = 0
        smena(c.message,Q4_17,privoprosetime(c.from_user.id),kluch)
    elif c.data == '8418':
        sost[c.from_user.id][0] = 8418
        sost[c.from_user.id][3] = 0
        smena(c.message,Q4_18,privoprosetime(c.from_user.id),pic4_18)
    elif c.data == '8419':
        sost[c.from_user.id][0] = 8419
        sost[c.from_user.id][3] = 0
        smena(c.message,Q4_19,privoprosetime(c.from_user.id),pic4_19)
    elif c.data == '8420':
        sost[c.from_user.id][0] = 8420
        sost[c.from_user.id][3] = 0
        smena(c.message,Q4_20,privoprosetime2024(c.from_user.id),kluch)
    elif c.data == '8421':
        sost[c.from_user.id][0] = 8421
        sost[c.from_user.id][3] = 0
        smena(c.message,Q4_21,privoprosetime2024(c.from_user.id),kluch)
    elif c.data == '8422':
        sost[c.from_user.id][0] = 8422
        sost[c.from_user.id][3] = 0
        smena(c.message,Q4_22,privoprosetime2024(c.from_user.id),kluch)
    elif c.data == '8423':
        sost[c.from_user.id][0] = 8423
        sost[c.from_user.id][3] = 0
        smena(c.message,Q4_23,privoprosetime2024(c.from_user.id),kluch)
    elif c.data == '8424':
        sost[c.from_user.id][0] = 8424
        sost[c.from_user.id][3] = 0
        smena(c.message,Q4_24,privoprosetime2024(c.from_user.id),kluch)
    elif c.data == '8425':
        sost[c.from_user.id][0] = 8425
        sost[c.from_user.id][3] = 0
        smena(c.message,Q4_25,privoprosetime25(c.from_user.id),kluch)

#А эта херня всё запускает. Причём, если она вылетет, данные выгрузятся в файлик
while True:
    try:
        if __name__ == '__main__':
            bot.polling(none_stop=True)
    except:
        vigruzka()

